[
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit2lc",
    "self_text": "I've delegated this role to one of our regular users. However, the only thing they can do is enter the email address where the invitiation is being sent. Is there another permission that isn't User Administrator that would allow them to enter some data in other fields? Namely, First and Last Name, Company Name and maybe even add them to some security groups? I'm an admin, so I see all of these fields when I'm adding guests.   Adding to the groups would be the cherry on top, but I understand group membership isn't the same thing as user properties.",
    "subreddit": "AZURE",
    "title": "Question about Guest Inviter role"
  },
  {
    "link_flair_text": "Events",
    "over_18": "false",
    "post_id": "yit2lm",
    "self_text": "I have had NO trick or treaters so far. And im not about to post my address but i am on the Pawnee and Meridian Area! Come find some candy! People over here are handing out candy!",
    "subreddit": "wichita",
    "title": "Trick or Treaters!"
  },
  {
    "link_flair_text": "Events",
    "over_18": "false",
    "post_id": "yit2lm",
    "self_text": "I have had NO trick or treaters so far. And im not about to post my address but i am on the Pawnee and Meridian Area! Come find some candy! People over here are handing out candy!",
    "subreddit": "wichita",
    "title": "Trick or Treaters!"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2k0",
    "self_text": "Will someone please give me some good ways to lose weight I’ve gained being on methadone? I know it makes me crave sugar like crazy and doesn’t it slow your metabolism? Idk but I’d love to hear peoples ways to keep weight off. Like do you just eat well and exercise 30 minutes a day? Or take certain vitamins or what? Please help ❤️",
    "subreddit": "Methadone",
    "title": "Weight"
  },
  {
    "link_flair_text": "Meta",
    "over_18": "false",
    "post_id": "yit2q6",
    "self_text": "Weekly Questions Thread can be found here  LOCATION LOCATION LOCATION!   Please start your post with your location as such: [UK and EU] or [USA, California] on a separate line   Thank you!  Import regulations mean it is difficult to send plant material between certain countries.  Check for  hard frosts  overnight before posting your parcel!  Scammers will not be tolerated! If you have sent a plant and not heard from your sender, message the mods and we will take care of it. Anyone found to be scamming will be banned from the sub.  A few housekeeping points:   Please add your  location . Many countries will have import restrictions. As a simple guide, within EU, okay. Within US, okay. EU to US or vice versa, not okay. Australia: complicated.  Please try to keep the trades to succulents. There is a list of sister subreddits in the sidebar should you want trade other plants.  Think about trading seeds and pollen too! Growing from seed can be very rewarding and be a good way to expand your collection.  Grow tips are highly encouraged when trading. Its nice to know what you're getting if you have never grown one before. Share your potting mediums and watering guides to help your receiver grow successfully!  Do show us some photos of what you got!  Have a quick check to see if there is a risk of frost overnight before sending the parcel.  There are some tips of packaging succulents for shipping below. I've had people send me plants in egg cartons before. They work really well.  If you have nothing to trade but would like some plants, people are often happy to send you plants for money or just the cost of postage and packaging.   Happy swapping!  You can find some tips for packaging succulents in the wiki   Wanna leave a review for your transaction?   Click here to fill out a short review.  Spreadsheet to see all reviews.",
    "subreddit": "succulents",
    "title": "Monthly Trade Thread: November 2022"
  },
  {
    "link_flair_text": "Meta",
    "over_18": "false",
    "post_id": "yit2q6",
    "self_text": "Weekly Questions Thread can be found here  LOCATION LOCATION LOCATION!   Please start your post with your location as such: [UK and EU] or [USA, California] on a separate line   Thank you!  Import regulations mean it is difficult to send plant material between certain countries.  Check for  hard frosts  overnight before posting your parcel!  Scammers will not be tolerated! If you have sent a plant and not heard from your sender, message the mods and we will take care of it. Anyone found to be scamming will be banned from the sub.  A few housekeeping points:   Please add your  location . Many countries will have import restrictions. As a simple guide, within EU, okay. Within US, okay. EU to US or vice versa, not okay. Australia: complicated.  Please try to keep the trades to succulents. There is a list of sister subreddits in the sidebar should you want trade other plants.  Think about trading seeds and pollen too! Growing from seed can be very rewarding and be a good way to expand your collection.  Grow tips are highly encouraged when trading. Its nice to know what you're getting if you have never grown one before. Share your potting mediums and watering guides to help your receiver grow successfully!  Do show us some photos of what you got!  Have a quick check to see if there is a risk of frost overnight before sending the parcel.  There are some tips of packaging succulents for shipping below. I've had people send me plants in egg cartons before. They work really well.  If you have nothing to trade but would like some plants, people are often happy to send you plants for money or just the cost of postage and packaging.   Happy swapping!  You can find some tips for packaging succulents in the wiki   Wanna leave a review for your transaction?   Click here to fill out a short review.  Spreadsheet to see all reviews.",
    "subreddit": "succulents",
    "title": "Monthly Trade Thread: November 2022"
  },
  {
    "link_flair_text": "Monthly Hiring Thread",
    "over_18": "false",
    "post_id": "yit2qe",
    "self_text": "The monthly thread for people to post openings at their companies.  &#x200B;  * Please state the job location and include the keywords REMOTE, INTERNS and/or VISA when the corresponding sort of candidate is welcome. When remote work is not an option, include ONSITE.  &#x200B;  * Please only post if you personally are part of the hiring company—no recruiting firms or job boards **Please report recruiters or job boards**.   &#x200B;  * Only one post per company.   &#x200B;  * If it isn't a household name, explain what your company does. Sell it.  &#x200B;  * Please add the company email that applications should be sent to, or the companies application web form/job posting (needless to say this should be on the company website, not a third party site).  &#x200B;  &#x200B;  Commenters: please don't reply to job posts to complain about something. It's off topic here.  &#x200B;  Readers: please only email if you are personally interested in the job.   &#x200B;  Posting top level comments that aren't job postings, [that's a paddlin](https://i.imgur.com/FxMKfnY.jpg)",
    "subreddit": "typescript",
    "title": "Who's hiring Typescript developers November"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2ps",
    "self_text": "This is the official advice and price check thread for r/legomarket. Use this thread to get advice on buying/selling/trading LEGO products, check how much what you have is worth, and ask other related questions.  No offering is allowed, it will result in your comment being removed, and may result in you being banned.   Please also check sites like Bricklink or eBay to get an idea of pricing as typically most sets will be posted for sale there as well.  If you know what something is worth, please comment. Sorting by new is encouraged.",
    "subreddit": "Legomarket",
    "title": "November 2022 Advice and Price Check Thread"
  },
  {
    "link_flair_text": "Meta",
    "over_18": "false",
    "post_id": "yit2q6",
    "self_text": "Weekly Questions Thread can be found here  LOCATION LOCATION LOCATION!   Please start your post with your location as such: [UK and EU] or [USA, California] on a separate line   Thank you!  Import regulations mean it is difficult to send plant material between certain countries.  Check for  hard frosts  overnight before posting your parcel!  Scammers will not be tolerated! If you have sent a plant and not heard from your sender, message the mods and we will take care of it. Anyone found to be scamming will be banned from the sub.  A few housekeeping points:   Please add your  location . Many countries will have import restrictions. As a simple guide, within EU, okay. Within US, okay. EU to US or vice versa, not okay. Australia: complicated.  Please try to keep the trades to succulents. There is a list of sister subreddits in the sidebar should you want trade other plants.  Think about trading seeds and pollen too! Growing from seed can be very rewarding and be a good way to expand your collection.  Grow tips are highly encouraged when trading. Its nice to know what you're getting if you have never grown one before. Share your potting mediums and watering guides to help your receiver grow successfully!  Do show us some photos of what you got!  Have a quick check to see if there is a risk of frost overnight before sending the parcel.  There are some tips of packaging succulents for shipping below. I've had people send me plants in egg cartons before. They work really well.  If you have nothing to trade but would like some plants, people are often happy to send you plants for money or just the cost of postage and packaging.   Happy swapping!  You can find some tips for packaging succulents in the wiki   Wanna leave a review for your transaction?   Click here to fill out a short review.  Spreadsheet to see all reviews.",
    "subreddit": "succulents",
    "title": "Monthly Trade Thread: November 2022"
  },
  {
    "link_flair_text": "Daily Thread",
    "over_18": "false",
    "post_id": "yit2pp",
    "self_text": "Have some burning questions on advanced Python topics? Use this thread to ask more advanced questions related to Python.   If your question is a beginner question we hold a beginner Daily Thread tomorrow (Wednesday) where you can ask any question! We may remove questions here and ask you to resubmit tomorrow.   This thread may be fairly low volume in replies, if you don't receive a response we recommend looking at r/LearnPython or joining the Python Discord server at https://discord.gg/python where you stand a better chance of receiving a response.",
    "subreddit": "Python",
    "title": "Tuesday Daily Thread: Advanced questions"
  },
  {
    "link_flair_text": "𝗚𝗲𝗻𝗲𝗿𝗮𝗹 🌀",
    "over_18": "false",
    "post_id": "yit2pz",
    "self_text": "Please use this sticky thread to discuss any challenges you are currently facing, or that you have faced and made a breakthrough with, so that others may gain from your experience without having to go through similar experiences themselves. A new thread will start every month on the 1st.  The greatest use of the internet is that it can help us gain knowledge from everyone around the world, and fast. So use this thread as a way by which all of us spiritual-growth driven folks across the world can benefit greatly; while motivating/encouraging/inspiring everyone else who comes here just for fun/lurking/pastime/curiosity.  All in all, we can have great spiritual discussions, share our learnings, assist others and learn from others in a rapid and amazing way, by using the abilities of the internet for good rather than for the opposite. After all, isn't that what spirituality is all about?  Namaste",
    "subreddit": "spirituality",
    "title": "Monthly Spiritual Challenges Thread"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was cleaning out my attic yesterday and stumbled upon an old VHS tape labeled \"Summer '95\" I popped it in and was surprised to find it was a mixtape my ex and I made for each other back when we were in high school. I had completely forgotten about it. The tape has a bunch of our favorite songs, and some obscure tracks that I had never even remembered. But the real kicker is that it also has a bunch of recordings of us talking and laughing together. It's surreal listening to our old conversations and remembering the way we used to be. Has anyone else ever found something like this and experienced that weird mix of nostalgia and sadness?",
    "subreddit": "NostalgicMemories",
    "title": "Found this old VHS tape in my attic and it's blowing my mind"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was cleaning out my attic yesterday and stumbled upon an old VHS tape labeled \"Summer '95\" I popped it in and was surprised to find it was a mixtape my ex and I made for each other back when we were in high school. I had completely forgotten about it. The tape has a bunch of our favorite songs, and some obscure tracks that I had never even remembered. But the real kicker is that it also has a bunch of recordings of us talking and laughing together. It's surreal listening to our old conversations and remembering the way we used to be. Has anyone else ever found something like this and experienced that weird mix of nostalgia and sadness?",
    "subreddit": "NostalgicMemories",
    "title": "Found this old VHS tape in my attic and it's blowing my mind"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2qk",
    "self_text": "make sure to join my sub and check out Homemade memes, i am getting some people from there, also, please post stuff.",
    "subreddit": "EpicHomemadeMemes",
    "title": "this is important"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've always been a bit of a music snob and have spent the last decade collecting vinyl records. I've got over 500 records, including some super rare ones that I've spent years searching for. But the other day I was at a record store and I noticed that one of the employees was wearing a shirt that said \"Made from recycled materials\" and had a picture of a vinyl record on it. I was skeptical, I mean I've always thought of vinyl as this really old fashioned material that's made from, well, real materials, like vinyl. But the employee told me that almost all new vinyl records are made from recycled plastic. Apparently the old records that get thrown away are collected and melted down to make new ones. I was shocked, I mean I've been buying records for years and I had no idea. I guess it's a bit of a silver lining to the whole \"disposable culture\" of the music industry. Anyone else know about this?",
    "subreddit": "Music",
    "title": "I spent 10 years collecting vinyl records and just found out they're actually made from recycled plastic"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2st",
    "self_text": "welcome to da rubreddit",
    "subreddit": "dasonicreddit",
    "title": "the rubreddit"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was cleaning out my attic and stumbled upon an old trunk that had been collecting dust for years. Inside, I found a vintage Remington portable typewriter that I had forgotten existed. I took it downstairs, dusted it off, and gave it a try. To my surprise, it still works perfectly. The keys are a bit sticky, but after some lubricant and a good cleaning, it's humming along like new. I've been using it to write short stories and letters to my friends. It's amazing how a simple object can bring so much joy and nostalgia. Does anyone else have any vintage typewriter stories or recommendations for cleaning and maintenance?",
    "subreddit": "vintagecomputing",
    "title": "Found a vintage typewriter in my attic and it still works"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2t8",
    "self_text": "I really want someone else to burn down his village and then be helped by his OB1 while he's too unconscious to ask for help.  But the experts make me think that what happens to him has to be because of his decisions.  I don't want to have him make a prophecy that he's a chosen one, burn down his own village, and hunt down some mysterious old hermit to tell him about the magic sword.",
    "subreddit": "writingcirclejerk",
    "title": "Do I really have to not let my protagonist be passive?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was at an antique shop in my hometown and I stumbled upon an old wooden door that caught my eye. It was beautifully crafted with intricate carvings and had a unique patina to it. The shop owner told me it was from the 1600s and I just had to have it. As I was sanding it down I discovered that the wood was made from a single tree that was over 800 years old. I'm talking about the world's oldest known piece of reclaimed wood from a Yew tree that's estimated to be from the 12th century. The Yew tree was cut down in the 1700s and this door has been in my family for generations. I'm not sure what to do with it now, should I restore it to its former glory or leave it as is?",
    "subreddit": "woodworking",
    "title": "I Just Discovered the World's Oldest Known Piece of Reclaimed Wood"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was at the doctor's office the other day and they told me that I'm biologically older than my dad. I know it sounds weird, but hear me out. Apparently, my mom was born on a leap year and my dad was born on a normal year. So, when I do the math, I'm actually 1 year older than him. I know it's not a big deal, but it's just weird thinking about it. Has anyone else ever found out they're older than one of their parents?",
    "subreddit": "todayilearnedsomethingnew",
    "title": "I Just Found Out I'm Biologically Older Than My Father"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I finally finished building the treehouse I've been putting off for months and I'm pretty proud of how it turned out. The kids are stoked and it's going to be a great addition to the backyard. The only downside is that I'm covered in sawdust and my back is killing me. Anyone else have a fun weekend project they're working on?",
    "subreddit": "DIYprojects",
    "title": "Just spent the last 4 hours building a treehouse for my kids and I'm covered in sawdust"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit2x5",
    "self_text": "on my way to help boy that was shot for eating",
    "subreddit": "whteverittakes",
    "title": "on my way to help boy that was shot for eating"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was browsing through some statistics the other day and I came across a fascinating fact. Apparently, Monday mornings are the most hazardous time to be on the road. It's not just because of the morning commute, but studies have shown that people are more likely to get in an accident on a Monday. Apparently, this is because our brains are still recovering from the weekend and our reaction times are slower. I know it sounds weird, but it's true. I've been doing some research and it seems that this is because our brains have to wake up from a state of reduced activity and it takes a while to get back to full alertness. It's pretty wild to think about how much of a difference a day of the week can make in our safety on the road.",
    "subreddit": "AskScience",
    "title": "Today I Learned That I'm More Likely to Get in a Car Accident on a Monday"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I was playing Overwatch with my sister last night and it was just one of those nights where everything came together. We're both really into Widowmaker and we've been practicing her ultimates together for weeks. She's only 8 and she's getting really good at it. \nI was playing Reaper and she was playing Widowmaker. We're in a match and she gets her ultimate and picks off a whole team of enemy heroes. The crowd goes wild and I'm just laughing and high-fiving her. She's beaming with pride and I'm just so proud of her. We end up winning the match and she screams \"WIDOWMAKER IS THE BEST!\" at the top of her lungs. I'm just so happy to be able to share this experience with her and watch her grow as a player.",
    "subreddit": "gaming",
    "title": "Just had the most epic gaming session with my little sister"
  },
  {
    "link_flair_text": "Dream",
    "over_18": "false",
    "post_id": "yit31o",
    "self_text": "Last night, I dreamed that I was walking outside and a fox ran up behind me. As I turned towards the fox, a coyote was in front of me. So a fox behind me and a coyote in front of me. The fox attacked me from the back and that’s all I remember. It’s sticking in my head though so I feel like it means something. I’ve read on both of these animals appearing in dreams but not at the same time. What do you think it means?",
    "subreddit": "DreamInterpretation",
    "title": "Fox &amp; coyote"
  },
  {
    "link_flair_text": "Question ❓",
    "over_18": "false",
    "post_id": "yit334",
    "self_text": "Hi,  I would like to know what do you think about taking sublingual drops before meditation like this one for example: https://ausflowers.com.au/ABFE-Products/Meditation-Remedy/Meditation-Essence-30ml.html  Should I meditate with drops or it is \"bad\" because it can \"change\" my meditation?  Do you think it is good using drops for meditation or not? If you think its good, which drops (flowers) do you suggest?  Thank you",
    "subreddit": "Meditation",
    "title": "Drops for meditation"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit33e",
    "self_text": "I suck at everything I want to do it",
    "subreddit": "mentalhealth",
    "title": "That is all folks"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit344",
    "self_text": "Yum",
    "subreddit": "actuallesbians",
    "title": "Women are so delicious"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit35f",
    "self_text": "English: lecture    especially, a formal or methodical discourse, intended for instruction    sometimes, a familiar discourse, in contrast with a sermon    a discourse on any subject    ––––––––––––  Translations    Catalan: conferència    Esperanto: lekcio    Galician: conferencia    German: der Vortrag    Hindi: लेक्चर    Italian: conferenza    Portuguese: palestra    Spanish: conferencia    Swedish: föredrag    Welsh: darlith    ––––––––––––  See previous words @ https://wordofthehour.org/r/past",
    "subreddit": "Word_of_The_Hour",
    "title": "Word of The Hour: lecture"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was driving home from work and I saw a guy walking down the street with a live chicken on his head. Not just any chicken, but a live chicken. I'm talking feathers and beak and everything. I slammed on the brakes and almost hit him but I managed to stop in time. He looked up at me with this completely serious expression and I swear he said \"excuse me\" like it was the most normal thing in the world. I just sat there for a second trying to process what I had just seen. I finally started driving again and he walked off with his chicken still on his head. I'm still trying to wrap my head around it. Has anyone else ever seen something this weird happen?",
    "subreddit": "todayilearnedsomethingnew",
    "title": "A weird thing that happened to me today"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit35t",
    "self_text": "So, a couple of years ago, I started a new job.  As I was coming out one night from work, I did what a lot of us would do and ripped off my surgical mask to breathe in some fresh air.   When I did it, I felt the earring come out of my ear because it got caught on the mask ear loop.   I heard it hit the ground and I took my phone out to look for it, but it was a dark parking lot and I just couldn’t find it.  It was a small white gold hoop.  I searched for it the next day during the daylight, but was unable to find it.  It’s a busy parking lot in the city, so I figured it was long gone. I was bummed because it was favorite daily wear earrings and they were not super cheap to replace.  I can only wear gold because everything else gives me an allergic reaction, so I just haven’t worn earrings for the last two years for fear of the same thing happening again.  I put the remaining earring in my jewelry box because I keep my scrap gold jewelry in case I need to get something repaired.   Well, today, almost exactly two years later I noticed something on my sunporch that was shiny.  I reached down and picked up a small white gold hoop earring.   I thought it was weird because I remembered specifically putting it in my jewelry box in the little drawer were I keep my scrap gold.  I went to the jewelry box and sure enough, there it was.   So now I have the original set and no explanation how the missing earring made it back home.  I have regularly vacuumed and swept that sunporch over the last two years and I specifically remember the incident in the parking lot because I was so bummed about losing my earring.",
    "subreddit": "Glitch_in_the_Matrix",
    "title": "Lost earring found two years later, not where I lost it"
  },
  {
    "link_flair_text": "Other",
    "over_18": "false",
    "post_id": "yit36f",
    "self_text": "like i know they are cousins but how? is bruces dad her uncle ?? vice versa?",
    "subreddit": "Marvel",
    "title": "how are she hulk &amp; hulk related?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I was watching my cat play in my living room the other day and I saw her climb up the curtains and sit on top of my bookshelf. I thought nothing of it at the time but it got me thinking. I decided to test her skills so I set up a mini climbing wall in my garage and to my surprise she nailed it. She's been climbing ever since and it's honestly the funniest thing to watch. She's not as fast as a human but she's definitely got the agility and strength for it. I'm thinking of getting her a climbing harness and some ropes so she can join the climbing club at the local gym. Has anyone else out there had a pet with an unusual talent?",
    "subreddit": "aww",
    "title": "Just found out my cat is secretly a skilled rock climber"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3aa",
    "self_text": "I'm a massage therapist.  I'm a confused by the behavior of the majority of people who call in for a massage. People will call in to book a massage but refuse to disclose when they want to come in, even when they are looking for a specific time slot.  For example a client wants to book a 4pm appointment. They call and ask what time do you have available.  I answer 11am.  They respond, \"no that won't do\".  I ask when would you like to come in.  Instead of telling me when they want to come in they will repeatedly ask what times I have available until I basically guess the time they want.  What I don't understand is if they are looking for a specific slot and can only come in at a specific time why not lead with that? Why waste their own time?  It happens so often I assume it must have something to do with human nature.",
    "subreddit": "NoStupidQuestions",
    "title": "Why are people so hesitant to say when they want to book an appointment?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I had my kids help me dig a hole in our backyard and fill it with a bunch of small trinkets and notes about our lives right now. We made a big deal about it and they were really excited to imagine what it would be like when they dig it up in 20 years. I included some notes about the world right now, like how we're still using smartphones but also still have landlines, and how the biggest threat to the world is still climate change. I also included some personal notes about our family and our pets. We made a little ceremony out of it and said some words about why it's important to leave a piece of ourselves behind for the future. My kids are 7 and 9 and they really got into it. I'm hoping this little time capsule will be a fun way for them to look back on their childhoods and see how things have changed. Does anyone have any other ideas for things we could have included in it?",
    "subreddit": "todayilearnedsomethingnew",
    "title": "I made a time capsule with my kids and buried it in our backyard"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was digging through my old gaming stuff and stumbled upon my old Nintendo 64 memory card. I popped it into my console and started messing around with some old games. I was playing Banjo-Kazooie when I noticed that the memory card had a hidden folder labeled \"Secrets\" with a bunch of random names in it. I'm assuming it's just a leftover from a previous game or something but I'm curious to know if anyone else has seen something like this before or if it's something more interesting.",
    "subreddit": "N64",
    "title": "Found a weird quirk in my old Nintendo 64 memory card"
  },
  {
    "link_flair_text": "Advice needed",
    "over_18": "false",
    "post_id": "yit3dr",
    "self_text": "I'm a righty, and my left hand always looks good  The right hand is always shaky, with thicker strokes, because I can't paint well with my left",
    "subreddit": "NailArt",
    "title": "Tips on how to paint your dominant hand?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3em",
    "self_text": "But nothing could’ve prepared me for the horror I felt looking out of the space station one morning, and not seeing the earth anymore",
    "subreddit": "TwoSentenceHorror",
    "title": "I had always dreamt about being an astronaut as a kid."
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I used to work for a company that bred and trained snails for racing. It was a weird job, but it was my dream job. I spent 10 years working with these slimy creatures and learned a lot about them. Here are some interesting facts about snails.\n\nFirst, snails are highly intelligent. They can learn to navigate mazes and remember routes they've taken before. They're also very curious and will explore their surroundings to find food and shelter.\n\nSecond, snails are very social creatures. They live in communities and have a complex hierarchy. They even have a way of communicating with each other through a series of clicks and whistles.\n\nThird, snails are incredibly resilient. They can survive for a long time without water and can even seal themselves in a protective shell to protect themselves from predators.\n\nLastly, snails are very romantic creatures. They mate for life and are very loyal to their partners.\n\nI'm not sure why I'm sharing this, but I just found out that I'm getting laid off from my job as a snail trainer and I'm feeling a little nostalgic. Anybody else have any weird jobs they've had in the past?",
    "subreddit": "todayilearned",
    "title": "I spent 10 years working as a professional snail trainer and here's what I learned"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3gv",
    "self_text": "It seems sweeter. Maybe i'm just dehydrated....But i do know the mix changes throughout the year, so maybe it is a higher proportion of Hetch-Hetchy now. North Beach/Telegraph Hill area if it still matters.",
    "subreddit": "AskSF",
    "title": "Did the tap water change? In the past week or so."
  },
  {
    "link_flair_text": "Discussion &amp; Info",
    "over_18": "false",
    "post_id": "yit3gy",
    "self_text": "Idk bleed just isn't fun for me,it feels kinda cheesy and just mashing buttons but I still prefer faster weapons like katanas and curved swords.what fast dex weapons work well without bleed?i dont mind if there is bleed as long as the weapon is good enough even without it. I already have the ushikatana and nagakiba but what else should I try. Edit:thanks for the answers I didn't know what to chose so im just gonna upgrade all of them to 24 and see who I like the best(there is a giltch where you can get an easy 250k here https://youtu.be/g2P-eJTBzWE, i don't gonna level up using this but i am gonna buy every loads of smithing stones)",
    "subreddit": "Eldenring",
    "title": "pure dex without bleed build"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've been listening to a lot of music lately and I've noticed that I still find myself humming this one song from a band I've never actually listened to. I'm not sure why it's stuck in my head but it's been driving me crazy. I finally looked it up and it's a song by a band called 'The Freshies' from their 1987 album 'Freshies'. The song is called 'I'm in Love with the Girl with the Curly Hair'. Does anyone else have a song like this that's just stuck in their head?",
    "subreddit": "music",
    "title": "What's the most obscure song that you still find yourself humming"
  },
  {
    "link_flair_text": "Recommend",
    "over_18": "false",
    "post_id": "yit3js",
    "self_text": "what disbanded groups have a good discography??  can you recomended me 3 songs from each group if possible",
    "subreddit": "kpophelp",
    "title": "The Best Disbanded Groups??"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've always had a fascination with classic cars and I finally broke down and spent my entire paycheck on a 1967 Pontiac GTO that I found online for sale. The previous owner was a old retired mechanic and it showed. He had completely restored it and had all the receipts for parts and labor. I took it for a spin and the thing purrs like a kitten and handles like a dream. I'm so happy I made the purchase and can't wait to show it off at the local car shows.",
    "subreddit": "classiccars",
    "title": "I spent my entire paycheck on a used 1967 Pontiac GTO"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3l9",
    "self_text": "Bias laden article saying 'why are people not working themselves to  death?? article  Ironically Jeff Bezos (kind micromanager) owns this newspaper.  Talk about capitalist propaganda",
    "subreddit": "antiwork",
    "title": "Washington Post (owned by Bezos) bitching about productivity."
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3n9",
    "self_text": "😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8===✊===D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8====✊==D  😣8==✊====D  😣8==✊====D  😣8===✊===D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8====✊==D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8==✊====D  😣8=✊=====D  😣8==✊====D  😣8===✊===D  😣8====✊==D  😣8=====✊=D  😣8====✊==D  😣8===✊===D  😣8====✊==D  🥵8=====✊=D 💦 🐈    😳",
    "subreddit": "copypasta",
    "title": "masturbation shane dawson ending"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3nx",
    "self_text": "For this incoming month of November I shall be deleting Reddit from my phone, this place is too fucking horny, even if I don’t go on porn subs other subs still contain NSFW things, See you when I fail or hopefully on December 1st",
    "subreddit": "nonutnovember",
    "title": "Gentlemen I have an announcement"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was trying to explain to my 7 year old why the answer to 2 + 2 is 4 and not 5 because you have to add the two numbers together, not just look at them and guess. I swear I've seen her add 3 + 3 in her head before so I thought this would be a piece of cake. \nBut then she looks at me with this completely serious face and says \"but why can't it be 5?\" and I'm like \"ummm well because... uh... \" and she just looks at me and says \"I don't know why\" and I'm left standing there looking like a total idiot. \nI mean I know it's not the end of the world but it's just so frustrating to know that I'm supposed to be teaching her and I'm failing.",
    "subreddit": "fathers",
    "title": "Just spent 10 minutes trying to explain a complex math concept to my 7 year old and I am SHATTERED"
  },
  {
    "link_flair_text": ":flair-discussion: Discussion",
    "over_18": "false",
    "post_id": "yit3p2",
    "self_text": "Hi everyone, I’ve got friends doing nanowrimo, but not being a novelist, I decided to turn it into 30 songs written, recorded and posted in 30 day.   I’m basing this strongly on the quantity creating quality idea here https://austinkleon.com/2020/12/10/quantity-leads-to-quality-the-origin-of-a-parable/  Anyone who wants to join in, let’s do it :)",
    "subreddit": "Songwriting",
    "title": "30 songs in 30 days"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "so I fell asleep on the couch and had a dream that I was back in high school. I was sitting in my old history class, but everything was slightly off. The teacher was wearing a full suit of armor and the chalkboard was a giant chalkboard from the 50s with a giant neon sign above it that said \"Welcome to the Time Traveling History Class\".\nI looked down and saw that I was wearing a pair of roller skates, which was really weird because we never wore those in school. I tried to take them off but they wouldn't budge.\nThe teacher started writing on the chalkboard with a giant piece of chalk that was attached to his hand by a metal chain. He wrote out a math problem and I was the only one in class who knew the answer. Everyone else was staring at me in confusion.\nI stood up and skated around the room, trying to get the teacher's attention, but he just kept writing on the board. I finally managed to skate up to him and tap him on the shoulder with a rolled up newspaper. He turned around and said \"Ah, yes, the student who knows the answer!\" and started explaining the solution to the problem. It was so vivid and real that I woke up with a start.",
    "subreddit": "dreams",
    "title": "Just had the most surreal dream last night"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was at a dinner party last night and this guy tells this story and I just had to look it up. So a man walks into a library and asks the librarian \"Do you have any books on Pavlov's dogs and Schrödinger's cat?\" The librarian says \"It rings a bell, but I'm not sure if it's here or not.\"",
    "subreddit": "todayilookedupthateffect",
    "title": "A man walked into a library and asked the librarian \"Do you have any books on Pavlov's dogs and Schrödinger's cat?\""
  },
  {
    "link_flair_text": "RANT",
    "over_18": "false",
    "post_id": "yit3to",
    "self_text": "Her house could be on show hoarders. She’s old and I think it’s unfair of her to leave it all to her only child to take care of when she pass a away. She’s 72, hopefully over the next decade she will get rid of her crap.",
    "subreddit": "hoarding",
    "title": "I called elderly services on my mother n law,"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit3w0",
    "self_text": "I feel like I use the word “and” way too much. I know in some cases it is necessary, but does anyone have tips on ways I can avoid it more?",
    "subreddit": "writing",
    "title": "Ways to avoid using the word “and” ?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I work in an office with a bunch of pretty normal people, but our coworker Dave has always been a bit of a mystery. He's a middle-aged guy who's always dressed in button-down shirts and khakis, and he's always been a bit of a wallflower. I've tried to get to know him a bit, but he's always brushed me off with a friendly but vague response.\n\nSo yesterday, my boss asked me to help him move a couch from the conference room to his house. I agreed, thinking it would be a good opportunity to get to know Dave a bit better. We got to his house and started loading up the couch. As we were carrying it up the stairs, I asked him if he needed any help. He said no, but I could see him straining under the weight of the couch.\n\nI decided to help him lift it up the rest of the way, and as we were setting it down, I asked him if he needed any more help. He said no, but then he looked at me with a sly grin and said \"I've got one more thing to show you.\" He pulled out a guitar from behind the couch and started playing a sick solo. I was shocked - I had no idea he played guitar.\n\nIt turned out that Dave is a huge fan of 80s rock music and has been playing guitar since he was a kid. He's been playing in a band with his friends on the weekends, and they've even played a few gigs around town. I was blown away by his talent, and we ended up talking for hours about music and rock history.\n\nI feel like I've known Dave for years, not just hours. He's still a bit of a mystery, but now I know a lot more about him than I thought I would. And who knows, maybe I'll even get invited to one of his band's gigs sometime.",
    "subreddit": "guitarists",
    "title": "A coworker asked me to help him move a couch and I found out his secret talent"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I've always been fascinated by languages and a few years ago I decided to tackle learning Spanish. It took me around 10 years to reach a decent level of proficiency, and I've been using it to watch Spanish media and even travel to Spain a few times. However, the other day I was watching a TV show in English and I was really struggling to keep up with the dialogue. The pace was so much faster than anything I'd ever seen in Spanish, and I found myself rewinding the show multiple times just to catch a few words. I was really frustrated and it made me realize how much more difficult my native language is to understand than I ever thought possible. Has anyone else had a similar experience switching between languages, or is it just me?",
    "subreddit": "languagelearning",
    "title": "I spent 10 years learning a new language and now I'm struggling to understand a TV show in my native language"
  },
  {
    "link_flair_text": "Emotional Support",
    "over_18": "false",
    "post_id": "yit400",
    "self_text": "I didn't realize that penn state needs official scores, so I tried to rush score it using my visa gift card, but it wouldn't work, so I asked my mom to pay for it, and at first she agreed, but now my dad is yelling about how 31 dollars is too much and it doesn't make sense that I need to pay to send scores. and they're telling me to just not apply because pennsylvania is too far anyways 😭 i should have done this 2 weeks ago, then I'd be able to use my fee waiver and avoid this mess...",
    "subreddit": "ApplyingToCollege",
    "title": "I fucked up"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit429",
    "self_text": "I'm currently learning to program through TOP and I come from a non-CS background. I was curious if anyone can share their experiences with self-learning programming...How long it took to learn, how hard/easy it was to learn, and what your journey looked like to getting your first job?  Also I'm open to any recommendations on resources that helped you along the way in self-learning. I appreciate any advice I receive, thanks!  Edit: Thanks for all the comments with your advice and experience as a self-taught programmer, I truly appreciate it!",
    "subreddit": "learnprogramming",
    "title": "Getting a Job Without CS Degree - Is It Possible?"
  },
  {
    "link_flair_text": "Long",
    "over_18": "false",
    "post_id": "yit45s",
    "self_text": "Two soldiers are patrolling a forest, suddenly one of them collapses to the ground and the other begins to panic.  He picks up his walkie talkie and contacts his captain, he says \"I need help! my partner collapsed to the ground and isn't moving, I think he's dead!\"  The Captain responds: \"Don't worry, I can help, just calm down and do exactly what I say\"  \"Yes Captain\" the soldier says  \"Now before we do anything, let's make sure he's actually dead\"  \"Yes Captain\"  A few seconds later, the Captain hears a gunshot from the distance, before he can wonder who it was and where it came from, the soldier contacts him and says; \"ok, now what?\"",
    "subreddit": "Jokes",
    "title": "Two soldiers in a forest"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I was out with my friends last night and we were all trying to get home after a night out. I was driving and we were all joking around about how we were reliving the same night over and over. I laughed it off and we all got home safely. \n\nFast forward to this morning and I'm on my way to work. I'm driving down the same street I was on last night and I see my friends walking down the street. I'm confused but I shrug it off and tell myself I must have slept in and missed breakfast.\n\nBut then I see the same conversation with my friends in my head, the same jokes, the same laughter. I try to shake it off but I'm starting to feel a sense of déjà vu.\n\nI get to work and my boss tells me that we're having a meeting at 2 PM to discuss the Johnson account. I'm thinking to myself \"this is getting weird\". But then I start to feel that same sense of déjà vu again.\n\nI'm working at my desk and I see the same coworkers around me, the same computers, the same papers. It's like I'm living the same day over and over.\n\nI try to take a break and go outside and I see the same people walking down the street, the same cars driving by. I'm starting to lose my grip on reality.\n\nI come home and my family is making dinner, the same dinner we had last night. I'm starting to feel like I'm stuck in some kind of time loop.\n\nI've been trying to figure out what's going on but I'm stumped. I've been going through the same day over and over and I'm starting to lose my mind.\n\nHas anyone else experienced anything like this? Any ideas on what's going on?",
    "subreddit": "time_loop",
    "title": "I just spent 5 hours in a time loop and I'm still trying to wrap my head around it"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I went to a small town's annual fair today and it was just the most wholesome thing I've ever seen. They had a petting zoo for kids and it was adorable. There was a little boy who was about 4 years old and he was absolutely smitten with a goat. He kept going up to the goat and giving it hugs and kisses. The goat just took it all in stride and even seemed to be enjoying it. Then the boy started feeding the goat and it started to nuzzle his hands and lick his face. It was like they were the best of friends. The cuteness was almost too much to handle. The rest of the fair was pretty standard, but that little interaction between the boy and the goat was definitely the highlight of my day.",
    "subreddit": "offmychest",
    "title": "Just spent the day at a small town's annual fair and had the most surreal experience"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I just learned that giraffes have the same number of neurons in their brains as humans. They have approximately 86 billion neurons. This is despite their much smaller brain-to-body mass ratio compared to humans. This makes me think about the complexity and diversity of life on our planet. Who else knew this?",
    "subreddit": "todayilearned",
    "title": "Random Fun Fact - Giraffes Have the Same Number of Neurons as Humans"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I'm about to start my first indoor herb garden and I'm super excited. I've always been fascinated by the idea of growing my own herbs, but I've never had the space or knowledge to do so. I've read a few books and articles, but I'm still a bit overwhelmed by the options. Does anyone have any tips for a beginner like me? What are some easy-to-grow herbs that I should start with? Are there any specific light requirements or watering schedules I should follow? Any advice on containers or soil would be great too. Thanks in advance for your help!",
    "subreddit": "gardening",
    "title": "Gardening for Beginners: Tips for a Thriving Indoor Herb Garden"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I recently started a small herb garden in my backyard and have been experimenting with a new method of watering that's been getting rave reviews. I've been using a drip irrigation system that's connected to a rainwater harvesting tank. So far, it's been a game-changer for my plants and the environment. I'm harvesting a bunch of fresh herbs every week, and I've even started selling some to my neighbors. Has anyone else had experience with this type of system? What are some tips and tricks for optimizing its performance?",
    "subreddit": "gardening",
    "title": "Garden Update: Harvesting Success with Minimal Watering"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I recently started a small herb garden in my backyard and have been experimenting with a new method of watering that's been getting rave reviews. I've been using a drip irrigation system that's connected to a rainwater harvesting tank. So far, it's been a game-changer for my plants and the environment. I'm harvesting a bunch of fresh herbs every week, and I've even started selling some to my neighbors. Has anyone else had experience with this type of system? What are some tips and tricks for optimizing its performance?",
    "subreddit": "gardening",
    "title": "Garden Update: Harvesting Success with Minimal Watering"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "rd Dream I Had Last Night\n self_text: I had the craziest dream last night, I'm still laughing about it. I was in a long, winding hallway, and I kept trying to find the door to my apartment, but every door I opened led to a different room in my childhood home. The weird part was that each room was filled with my old stuffed animals, but they were all wearing tiny little hats and sunglasses, and they were all playing tiny instruments. My cat was there too, and it was playing the piano, but it was using its paws to play a really complex jazz piece. I woke up laughing because it was just so absurd. Has anyone else ever had a dream like that?",
    "subreddit": "Dreams",
    "title": "Weird Dream I Had Last Night\n self_text: I had the craziest dream last night, I'm still laughing about it. I was in a long, winding hallway, and I kept trying to find the door to my apartment, but every door I opened led to a different room in my childhood home. The weird part was that each room was filled with my old stuffed animals, but they were all wearing tiny little hats and sunglasses, and they were all playing tiny instruments. My cat was there too, and it was playing the piano, but it was using its paws to play a really complex jazz piece. I woke up laughing because it was just so absurd. Has anyone else ever had a dream like that? \nsubreddit: r/Dream"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4xw",
    "self_text": "I'm planning to use halogen heat lamp for heat and was just going to turn it off at night. No light means no heat but the house stays 68F or higher year round.   I've read they're pretty tolerant of this nighttime cool down but was curious what others are doing.  TIA",
    "subreddit": "cornsnakes",
    "title": "Heat at night...yay or nay?"
  },
  {
    "link_flair_text": "Rant",
    "over_18": "false",
    "post_id": "yit4yl",
    "self_text": "Inflation at an all time high  House market horrible  Car market at all time high  Hardest time to find work in decades  Etc etc etc",
    "subreddit": "teenagers",
    "title": "this is the worst time in decades to become an adult"
  },
  {
    "link_flair_text": "DISCUSSION",
    "over_18": "false",
    "post_id": "yit4yn",
    "self_text": "i’m honestly not in too much trouble because i only have 15 or so plants, but i’m graduating college soon and have no idea where i’m going to wind up. can’t think of a better place to ask how i should plan to transport my plants if i end up across the country. any advice or experiences others have had would be super appreciated :)",
    "subreddit": "houseplants",
    "title": "how to move plants cross-country?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "Hey fellow Angelenos, I'm looking to start a garden in my tiny backyard and was wondering if anyone has any recommendations for the best plants to grow in a small space. I'm open to anything from herbs to veggies to flowers. Bonus points if you have any tips on how to maximize the space and keep it looking nice.",
    "subreddit": "LosAngeles",
    "title": "Best Garden for a Small Space in LA"
  },
  {
    "link_flair_text": "App Question",
    "over_18": "false",
    "post_id": "yit53m",
    "self_text": "Hi I just downloaded Hinge and I have some questions:  -What is a respectable timeframe to respond to a like? I am on the free version so I can only see the most recent like at a time. But will people take it as a slight if I don't respond to their like in a week+?  -Do people know if I X'd their like?  -Is it the right thing to do to respond to a very thoughtful like message, even if they aren't your type?  -What happens to a profile on my feed when I close the app and a different profile pops up after I open the app? Is that profile gone or will I have the opportunity to see it again?  -If I X a profile first, will my profile still show up on their feed?  &#x200B;  Sorry for the avalanche of questions, I am a bit overwhelmed with it all and its my first time on any kind of dating app.",
    "subreddit": "hingeapp",
    "title": "New To Hinge and Have a Some Questions"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I had the strangest dream last night. I was in a huge garden filled with trees, flowers, and a massive pond. I was walking through the garden and stumbled upon a small clearing. In the center of the clearing was a giant piano. I sat down and started playing a beautiful melody on it, but as I finished the song, a massive wave crashed over the pond, flooding the entire garden. The trees started to turn into giant guitars, and I found myself surrounded by them, playing a giant guitar solo. I woke up feeling really inspired and wondering what it means.",
    "subreddit": "dreams",
    "title": "Weird Dream I Had Last Night"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit555",
    "self_text": "like most drivers speed to some degree. but like i’ll hear people brag about speeding 20-30 MPH above the speed limit. like how is that cool? at that point you’re just endangering yourself and others.",
    "subreddit": "RandomThoughts",
    "title": "i don’t understand people who brag about speeding."
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "Hey fellow Redditors, I just finished my master's in computer science at UCLA and I'm feeling pretty proud of myself. After a long day of coding, I love unwinding with some yoga. My go-to routine is a gentle flow class that focuses on restorative poses and breathing exercises. It's amazing how it helps me clear my mind and relax my muscles. Does anyone else have a favorite yoga routine or a go-to class that helps you unwind after a long day? I'd love to hear about it.",
    "subreddit": "yoga",
    "title": "Favorite Yoga Routine After a Long Day of Coding"
  },
  {
    "link_flair_text": "WWYD",
    "over_18": "false",
    "post_id": "yit59l",
    "self_text": "Hi all!  I don’t work in actual social work, but I do work in low income housing (at a Housing Authority) as a caseworker, and I feel like this might be the closest spot on Reddit for asking this question!   I am the housing caseworker for 3 separate properties (and two different programs). I handle things for current tenants of those properties, including income reexaminations, annual inspections, and all the other program rules HUD requires — most of which have to do with the income exams and inspections. I also handle things for people wanting to join the program and move into the properties — income checking, citizenship/immigration and background verification, securing socials/birth certificates/ID/etc, and completing the leases, rent calculations, and getting security deposits. It is a job I love a LOT and find really fulfilling, but I’ve reached a point where I’m absolutely at the end of my rope.   I have to have communication with the property staff — who collect rent, enforce the lease, handle maintenance requests, and other various property management style duties. For the past 5 months, despite MULTIPLE talks —we are talking DOUBLE DIGIT sit down meetings — nothing is being communicated with me. For example, When someone moves out, I have two days to process that in our system in order to trigger a refund of their security deposit. That is a legal standard for the program we are part of. I am not being told about people moving out until weeks or even months later. I am not being told when there are pending evictions, Im not being told about people who change their minds about moving in — nothing is being communicated to me. These things are critical for me doing my job. I’ve given up on this shit ever being resolved, because if no less than 16 meetings has gotten the point across, I doubt anything will.   I am the one tasked with training new employees — including new supervisors (I am not a supervisor!).  I have to help out one of my coworkers who is drowning in late work (a caseload she inherited that hadn’t been worked in over a year) as well as helping the other programs in the building. Our IT department is woefully awful, and I’m under 35, so I also have to play IT. I pride myself on being organized and good at my job (I’ve gotten an award for shining star employee of the year!), but I feel like my job and the clientele I serve are suffering because I cannot stay ahead.   I am just so burnt out! I have stress nightmares. What do y’all do to help maintain boundaries? To help the burnout? I do not want to quit my job — I truly love what I do. But my mental health is suffering massively.",
    "subreddit": "socialwork",
    "title": "Dealing with burnout/boundaries?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "As I'm about to start my PhD program in CS, I've been thinking about establishing a consistent morning routine to set myself up for success. I've always been a fan of meditation and yoga, but I want to incorporate more structure and productivity into my mornings. Does anyone have a morning routine they'd be willing to share? I'm open to any suggestions, from simple to complex. I'm currently thinking of waking up 30 minutes earlier each day and dedicating that time to a mix of meditation, journaling, and some light stretching.",
    "subreddit": "productivity",
    "title": "A Calm Morning Routine for a New Semester"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit5cb",
    "self_text": "Plant had been leaning pretty badly, while I was gone for an extended time, it fell over and has been deformed like this ever since. Stems are floppy now, what can I do to fix this?",
    "subreddit": "plantclinic",
    "title": "What’s going on :("
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I'm moving into a new apartment in LA and I'm excited to start my garden, but I'm worried about the limited space. I've got a few plants I'm bringing with me from my current place, but I'm looking for some advice on how to keep them happy in a smaller space. I've heard that LA's dry climate can be tough on plants, so any tips on how to keep them hydrated would be great. Also, are there any good small-space planters that you'd recommend? I'm thinking of getting some vertical planters to make the most of my balcony.",
    "subreddit": "urban gardening",
    "title": "Best way to keep my plants happy and thriving in a small LA apartment"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I had the weirdest dream last night. I was in a garden with a bunch of animals, there were birds, dogs, and even a tiger. They were all learning how to play the piano, and they were all really good. The tiger was doing a rendition of a Chopin nocturne and it was actually really beautiful. Then I started playing guitar and we all jammed together. It was surreal but also kind of peaceful.",
    "subreddit": "dreams",
    "title": "Weird Dream I Had Last Night"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I just finished my master's degree in computer science and decided to take up sewing as a hobby. I made a custom guitar strap for my trusty old instrument. It took me a few attempts to get the pattern right, but it turned out amazing. The strap is made from a sturdy canvas and has a nice weight to it. Now I'm thinking of making one for my friend's guitar. Has anyone else made anything like this before? What were some challenges you faced?",
    "subreddit": "sewing",
    "title": "Just Learned How to Sew and Made a Custom Guitar Strap"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I had the strangest dream last night, I was in a beautiful garden surrounded by lush greenery and vibrant flowers, but it wasn't until I started playing my guitar that things took a turn for the surreal. As I strummed the strings, the plants and trees began to transform into musical instruments, and before I knew it, I was in a huge outdoor amphitheater surrounded by an orchestra of trees and flowers all playing their own unique instruments. The music was enchanting, and I was playing my guitar solo with the trees and flowers in perfect harmony. I woke up feeling inspired, and now I'm itching to write a song inspired by my dream. Has anyone else ever had a dream that inspired a creative project?",
    "subreddit": "dreams",
    "title": "A Musical Dream That Left Me Puzzled"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "b Your Enthusiasm Binge and Workout Routine\n self_text: \nJust finished a Curb Your Enthusiasm marathon and I'm feeling inspired to crush my fitness goals. I've started incorporating some of Larry's antics into my workout routine. Squats are now'squirming out of a meeting uninvited' and burpees are 'trying to get out of a social engagement'. My running has become 'chasing after the valet' and I've started doing more yoga poses in the style of Larry's awkward interactions. Anyone else have any funny workout routines or Larry-esque life hacks?",
    "subreddit": "fitness",
    "title": "Curb Your Enthusiasm Binge and Workout Routine\n self_text: \nJust finished a Curb Your Enthusiasm marathon and I'm feeling inspired to crush my fitness goals. I've started incorporating some of Larry's antics into my workout routine. Squats are now'squirming out of a meeting uninvited' and burpees are 'trying to get out of a social engagement'. My running has become 'chasing after the valet' and I've started doing more yoga poses in the style of Larry's awkward interactions. Anyone else have any funny workout routines or Larry-esque life hacks? \nsubreddit: r/fitnes"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I just had the craziest idea for a musical episode of Curb Your Enthusiasm where Larry David is a struggling musician trying to make it big in LA. He gets a gig at a trendy coffee shop but ends up getting kicked out for his terrible singing and constant complaining about the avocado toast prices. Meanwhile, Cheryl tries to teach him how to play the ukulele but he ends up breaking it and then gets in a fight with the shop owner over the cost of repairs. The whole thing is just a series of hilarious mishaps and awkward encounters with his friends and acquaintances. I'd pay to watch this episode.",
    "subreddit": "curbyourethsiasm",
    "title": "Curb Your Enthusiasm: The Musical Edition"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've been playing the guitar for a few years now and I find it to be a great way to unwind after a long day. Does anyone else have a favorite song or piece to play that they find really relaxing? I've been trying to expand my repertoire and I'm looking for some new material to add to my practice routine. Maybe something by James Taylor or Jack Johnson? Any recommendations would be appreciated.",
    "subreddit": "music",
    "title": "Guitar Playing for Relaxation"
  },
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit5q6",
    "self_text": "I joined girls wrestling and had my first day of practice and omg... is the first time wrestling always so embarrassing and horrible? edit: I'm quitting tomorrow. I just can't handle it.  second edit.... I guess I'll try it for a week and see how I feel then.",
    "subreddit": "wrestling",
    "title": "First time wrestling"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit5q9",
    "self_text": "Show me and my now ex girlfriend broke up about two weeks ago. I ended things with her because I thought I was losing feelings for her. Now I’m regretting it and realizing that I still have feelings for her. Towards the end of our relationship and mental health is beginning to deteriorate day by day and it was becoming exhausting to be in a relationship. I started to Become more Distant with my girlfriend and started to focus more on her flaws this week convincing myself that I was losing feelings. I guess this is my way of copping out and telling myself that all I need is myself in order to become more happy and stop feeling depressed. So eventually I broke the news to her I told her I was losing feelings I didn’t break up with her yet but  I just wanted to let her know how I was feeling. This obviously destroyed her and she became very sad I told her that I try to see if I could rekindle those feelings knowing that I was going to break up with her a week or so passes by the end of things she took it very well we ended on good terms and we went our separate ways. Immediately after I begin to regret my decision but I was trying to convince myself as if it was the right choice for me every day pass by and I felt like my mental health was worsening and it was becoming suicidal. Two weeks have gone by now and I’ve told her how I feel and that I want her back and I want to mend things and work through things. Understandably she told me that she has been recovering from everything and can just go back into a relationship just like that. And that she has felt like she is becoming a better version of herself and trying to love herself. She said she needed to see growth between both of us before we ever got back together. I regret everything that I’ve done in the past month I ruined a perfectly good relationship and I don’t know what to do. If anybody has any thoughts I would love to hear it thank you.",
    "subreddit": "relationship_advice",
    "title": "I regret breaking up with my ex"
  },
  {
    "link_flair_text": "Galaxy 1",
    "over_18": "false",
    "post_id": "yit5qm",
    "self_text": "What was the easiest prankster comet to you all?  View Poll",
    "subreddit": "SuperMarioGalaxy",
    "title": "EASIEST prankster comet"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I'm looking for some new routes to run in LA now that I'm done with school and back in the city. Does anyone have any favorite spots to share? I've been doing the same old loop around the UCLA campus for months and I'm looking to mix things up. Bonus points if you have a favorite coffee shop or cafe at the end of the route where I can grab a post-run coffee.",
    "subreddit": "running",
    "title": "What's your favorite running route in LA?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've been running consistently for a few months now and was wondering if anyone has any recommendations for yoga routines that are specifically tailored for runners. I've tried a few classes at my local studio but was hoping to find something that I can do at home. Any suggestions or favorite poses that help with injury prevention and recovery?",
    "subreddit": "running",
    "title": "Yoga for Runners"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I'm trying to get into running more regularly and was wondering if anyone has any favorite routes in LA. I'm familiar with the usual spots like Runyon Canyon and Griffith Park, but looking for some new places to explore. Any suggestions would be greatly appreciated.",
    "subreddit": "running",
    "title": "Favorite running routes in LA"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I had the weirdest dream last night, I was at a music festival and all the bands were made up of animals, a band of cats played a cover of a Velvet Revolver song, a band of dogs did a great cover of a Foo Fighters song, a band of birds sang a haunting rendition of a Fleetwood Mac song, and a band of elephants played a beautiful instrumental that was like a mix of classical and world music. I was in the audience and I was playing guitar with a band that was made up of pandas, we were doing a great set and everyone was dancing and having a great time. The whole festival was being held on a giant floating island in the sky and it was lit up with thousands of tiny lights that looked like fireflies.",
    "subreddit": "dreams",
    "title": "Weird dream I had last night"
  },
  {
    "link_flair_text": "Other",
    "over_18": "false",
    "post_id": "yit5yw",
    "self_text": "Wonder about things like if I'll ever find a dom. Guess this femboy will never know TwT",
    "subreddit": "teenagers",
    "title": "Sometimes i wonder about things."
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit613",
    "self_text": "If so, did any have any real chance of success?",
    "subreddit": "AskHistorians",
    "title": "Were there any attempts to unify Italy between the invasion of the Lombards and the founding of modern Italy?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I've been gardening for a few years now, but I've been wanting to take it to the next level by creating a pollinator-friendly garden in my backyard. Does anyone have experience with this? I've done some research, but I'm not sure where to start. I've got a decent size yard, but I'm not sure what plants are best for attracting bees, butterflies, and hummingbirds. I've heard that native plants are key, but I'm not sure which ones to choose. Any advice or resources would be great. I'd love to see pictures of your pollinator-friendly gardens if you have them.",
    "subreddit": "gardening",
    "title": "Most Challenging Gardening Task: Creating a Pollinator-Friendly Garden"
  },
  {
    "link_flair_text": "Lovers",
    "over_18": "false",
    "post_id": "yit62u",
    "self_text": "You remind me of weed and honey, my two favourite things. I love the way you look at me after you laugh or make a joke when you’re with your friends. Yes baby, I did find it funny too. I love the way you search for me in crowded rooms. I love the way you smile and I love everything else about you.  I’m sorry we can’t be together In this life, or maybe we can. There’s still a lot of work to do in life, I hope we can meet eachother halfway someday.  Recently you changed, in a good way. You’re more open and you’re even more brave than before. I had a picture of you in my head … an idea and now you’re someone new.  I feel like I’m mourning the past version of you because I loved them for so long . It hasn’t changed my feelings one bit though. Actually I think I love you ever more this time around.  I tell myself every day don’t get attached . But I wake up and remember your smile. I remember the way you kissed me and the way you would always be awake ready to talk to me.  I miss you so much everyday it hurts, something that was so traumatising for me is something that’s so hard for you to acknowledge. That hurts me a lot, I wish you would man up sometimes.  But you’re the other half of my soul, you’re the love of my life. Nobody is you, everyone I meet is a disappointment compared to you. You know this too don’t you?  Sometimes I feel stupid, maybe I made this hop all in my head. Maybe I am crazy but Atleast I got to experience whatever this was.  Take me back to the night we met",
    "subreddit": "UnsentLetters",
    "title": "I love you"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I played in a pickleball tournament yesterday and had the most epic game ever. I was up against a super competitive player who was destroying everyone else on the court. I managed to win the first game but the second game was a nail-biter. I was down 10-5 but managed to make an incredible comeback and won 15-13. I was on cloud nine and my opponents were pretty impressed. The best part was when I did a victory dance and slipped on the floor, falling flat on my butt. The crowd was in stitches and I couldn't help but laugh too. Has anyone else ever had an epic pickleball game?",
    "subreddit": "pickleball",
    "title": "Most Epic Pickleball Game Ever"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I had the craziest dreams last night. I dreamed I was a professional pickleball player and I was competing in the national championships. I was serving aces and winning match after match, but then I looked down and saw that my paddle was made of a giant avocado. I was freaking out, but my opponent just laughed and said \"don't worry, it's a game-changer.\" \n \nI also had a dream that I was trying to cook a perfect soufflé, but every time I took it out of the oven it would collapse and turn into a giant pile of dirt. I was getting so frustrated that I just started dancing on top of the kitchen table, singing a ridiculous song about the importance of proper egg whites.\n \nHas anyone else had any weird dreams lately? Share yours!",
    "subreddit": "dreams",
    "title": "Weird dreams I've had this week"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit6ef",
    "self_text": "So my uncle has been living mainly off grid for almost 30 years. He has no electricity or plumbing in his house, and only a wood stove to cook.   He has a home sawmill, which makes him some money - buys logs and uses the large and straight ones for lumber, and the rest for firewood. He does not grow his own food - usually just eats food that doesn't need to be cooked.  BUT - his income comes from a full time job at a local sawmill. Has worked there for 33 years.   Otherwise, his lifestyle is fully that of most homesteaders. Spends his off time working on his property, or helping other people. Has a tractor, farm/work truck, countless tools along with the sawmill, does all his own repairs and such.  No cell phone, landline, computer, or even a debit card.  What do think? Is this in the same spirit of homesteading, or is it not the same without being fully financially sustainable?",
    "subreddit": "homestead",
    "title": "Would you consider this homesteading?"
  },
  {
    "link_flair_text": "Exes",
    "over_18": "false",
    "post_id": "yit6gu",
    "self_text": "I miss the days where I felt safe with you. The you that would kiss each and every tear away instead of adding more. I miss the you that cared when you would hurt me instead of doing it intentionally. I miss the you that never existed. I miss the way you would hug me so tight; I felt like all my broken pieces were being pushed back into place, making up the girl before she was left broken and bruised. I miss the pretending that you actually cared. I miss the you from 5 years ago. The you that would hold my hand so gentle that I felt tears well behind my eyes, because finally someone loved me how I wanted to be loved. The you that was so happy to see me, that you that cried when I left your state when we were long distance. The you that would stay on the phone all night together because you didn't want to let me go. I miss the you I thought you were. The you that didn't cheat every few months then promise to change. The you that didn't ditch me one Halloween ago to go out with friends and leave me alone in our bedroom crying thinking you no longer loved me. I miss the you that loved and kissed every inch of my body cause so many before you used and abused it. I miss the you that didn't add to it. I miss the you that would promise to be at my side. The you that promised and convinced me that you would be different. I miss the you that didn't lie, but I know now that was a lie too. I miss your lies, the promises that I was your only one. The playing pretend that you wanted to build this future with me. The you that would pick out baby names with me for our future family. I miss not knowing who you really are. I miss when I used to believe in you and whatever you said must be the truth. I miss the fake you. The you, you used to make me fall for you. The you that would pick a rose from someone's bush to give to me. The you that didn't tear apart my self imagine and esteem. The you that didn't make me go back on my morals to keep you, even after you kept disrespecting me. The you that all my friends loved instead of scolding me cause I am still with you. The you that didn't make me feel so stupid and naive to think someone could love me. The you that could go out without me always thinking that you're cheating. I miss the act of you being my safety, the you that swore would never hurt me. The you that I can look at his phone and don't feel my stomach drop. The you that calmed my anxiety instead of adding on top of it. I miss you that never was you.",
    "subreddit": "UnsentLetters",
    "title": "Missing The Pretend You"
  },
  {
    "link_flair_text": "[new]",
    "over_18": "false",
    "post_id": "yit6hr",
    "self_text": "Hi Folks, The story goes as follows:  I was at an assembly where we had to play rock paper scissors for a challenge. I lost to my friends friend(F17) who i thought was really cute and had really cool outfits. I asked my friend to help and set my up with her and she did it for me! We are both seniors and she is from Thailand, it's super cool.  We met for the first time in the library during lunch and talked a bit about our general interests. The problem here is we are both EXTREMELY SHY and awkward. I've never had a girlfriend or the opportunity to get to know a single girl and work my way up to asking her out. I think we hit it off a bit but I don't know what to do from here without seeming pushy or weird about it. Today was a significant bit more quite.  Today we talked a little about what she does after school and she said the friends she doesn't hangout with are far or their parents are strict. We live in the same general area so I said \"Well then maybe we could hangout sometime because we live close and my parents aren't too strict.\" and then she said \"I also work a lot though\" she works at a little place inside a store and they get a lot of people calling in sick lately so it makes sense. But that part of me can't help but feel like it was more of a \"no I don't think I'd want to hang out with you\" type thing.  How do i progress a relationship normally? I've been antisocial for most of high school so I'm really bad at this. I know she was fine with getting to know me like that because that's what my friend told her. But I also don't want to bore her and make her uninterested.  TLDR: I'm a antisocial guy trying to talk to a really shy girl, how do i progress normally without being weird or without boring her?",
    "subreddit": "relationships",
    "title": "I(M16) got set up with a girl(F17) but we are both extremely shy"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "t Creative Way to Get Your Cat to Take a Nap\n self_text: So I was trying to get my cat to take a nap the other day and I had an idea. I put on some soft piano music and then placed a tiny guitar pick on the floor near the cat's favorite sleeping spot. The cat saw the pick and immediately pounced on it, then proceeded to bat it around the room for a bit. After that, the cat was exhausted from all the play and fell asleep right next to the pick. I've tried this a few times now and it seems to work like a charm. Has anyone else tried something similar with their pets?",
    "subreddit": "aww",
    "title": "Most Creative Way to Get Your Cat to Take a Nap\n self_text: So I was trying to get my cat to take a nap the other day and I had an idea. I put on some soft piano music and then placed a tiny guitar pick on the floor near the cat's favorite sleeping spot. The cat saw the pick and immediately pounced on it, then proceeded to bat it around the room for a bit. After that, the cat was exhausted from all the play and fell asleep right next to the pick. I've tried this a few times now and it seems to work like a charm. Has anyone else tried something similar with their pets?\nsubreddit: r/aw"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "Hey fellow gardening enthusiasts, I'm a new graduate from UCLA's CS program and I've found that gardening has been a great way to unwind and reduce stress after long days of coding. I've started a small herb garden on my balcony and it's been amazing to watch it grow. Not only does it provide a calming atmosphere, but it's also a great way to get some exercise and fresh air. Has anyone else found that gardening helps with mental health? Do you have any tips on how to keep your plants thriving in urban environments?",
    "subreddit": "gardening",
    "title": "Gardening as a Therapeutic Tool for Students"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "So I had the craziest dream last night. I dreamt that I was in a beautiful garden with my cat and my plants were all somehow sentient and they were all trying to get my attention. I was trying to water them but they kept moving out of the way. Then I started playing my guitar and they all started dancing to the music. One of them even started playing a tiny harmonica. I woke up feeling really inspired and I think I'm going to try to get into some more musical gardening in real life.",
    "subreddit": "dreams",
    "title": "A funny dream I had about gardening"
  },
  {
    "link_flair_text": "Unanswered",
    "over_18": "false",
    "post_id": "yit6k2",
    "self_text": "Working on a documentary about my mom, an artist from the 60s--I was a little kid and who used to work for her. She'd pay me just enough to buy a box of pop tarts after a long day's work... I think it was 89c but can't recall for sure. How to find out? Thanks!",
    "subreddit": "NoStupidQuestions",
    "title": "How much did Pop Tarts cost in from 1966-1969?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I just started a small garden in my backyard and I'm loving every minute of it. I've been putting in a few hours each weekend to get it up and running. I've planted a variety of herbs and some easy-to-grow vegetables like cherry tomatoes and zucchini. I've also started a small section for flowers to attract some butterflies and bees. I'm planning on expanding it to include a small fruit tree and some berries soon. Does anyone have any advice on what to plant next? I'm looking for some inspiration.",
    "subreddit": "gardening",
    "title": "I'm so excited to share my new garden with you all"
  },
  {
    "link_flair_text": "Taxes",
    "over_18": "false",
    "post_id": "yit6kp",
    "self_text": "Like the title mentions, how does a state know if you owe taxes? Is it based on the address on your W2? For context, the state of Colorado recently came after me saying I owe state income taxes for 2018. I did not live in Colorado at the time, but I had accidentally used my parents’ home address in CO on my W4 as I had not moved into my new city when I started the Job 1 (and forgot to change it once I moved - my mistake!). I already paid them the taxes I “owed” in 2017 when I started Job 1 - it was a headache to deal with so I just paid and thought that would be the end of it. I stayed at Job 1 until September of 2018, when I started Job 2. I used the correct state (not CO) when filling out my W4 for Job 2. The letter I received stating the income I owe taxes on in 2018 is for the total income I made between Job 1 and Job 2, so I’m confused why it would be that amount if my W2 for Job 2 does not have a CO address. I’m concerned they will keep coming after me for subsequent years even though I filled out W4s with the correct state address for subsequent jobs. Thanks in advance for any info/advice!",
    "subreddit": "personalfinance",
    "title": "How does a state know if you owe them taxes?"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "I was watching Curb Your Enthusiasm the other day and I had the most relatable moment. Larry is trying to get a table at a new restaurant and he keeps getting rejected. He gets frustrated and starts making a scene, which is classic Larry. But then he gets to the table and it's tiny. He complains to the manager that it's the smallest table he's ever seen and that he's a big man. I laughed so hard because I've had moments like that when I'm trying to get a table at a new restaurant and it's always a tiny table. The thing is, I'm not a big guy, but I do get frustrated when I'm trying to eat and my elbows are cramped against my ribcage. Anyone else have a moment like this?",
    "subreddit": "curbyourethiasm",
    "title": "Curb Your Enthusiasm - Most Relatable Moment"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit6mb",
    "self_text": "I’m 21 and a senior in college. I go to a local college and I live at home. There’s a few colleges in my city but she really likes the one I’m at and pretty much made me go. My college is good academically but it wasn’t the best fit for me. My mom and all of the people on her side of the family are super against leaving for college. But realistically there’s colleges that are a much better fit for me socially and career-wise. If I point this out she acts like I’m “choosing to be unhappy” with my college. I agreed to stay at home and go to the college she chose for undergrad but she’s trying to get me to stay for grad school too. A while back she told me I could leave for grad school but now she’s trying to walk that back and say I can move out if I stay in the city. I didn’t even mention leaving, I brought up an online program at an out of state college and she’s saying “they might want me to leave at some point.” She thinks I’m bent on moving out but I just want to be at the best college for me.",
    "subreddit": "Advice",
    "title": "How to deal with overly controlling mother"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "Hey fellow music enthusiasts, I'm looking to start taking guitar lessons again after a long break. Does anyone have any tips for a beginner like me? Specifically, I'm looking for recommendations on a good teacher, practice routines, and any other advice you might have to share. I'm looking to learn classical and some jazz standards, but I'm open to learning other styles as well. Thanks in advance for any advice!",
    "subreddit": "guitar",
    "title": "Guitar Lessons for Beginners: Tips and Tricks"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "After years of doomscrolling and fractured focus, I built a friction-first phone setup for Mon–Fri: 1) Move social/media apps off the home screen into a folder named \"Later\"; 2) Delete addictive apps and rely on their web versions only (harder to use, easier to ignore); 3) Set Screen Time/Focus with Downtime from 8am–6pm allowing only calls, maps, calendar, camera, notes, authenticator, and messages; 4) Use a minimalist launcher and grayscale mode to reduce visual reward; 5) Add a home-screen shortcut to a \"Bored? Read this\" note that lists quick tasks (two push-ups, drink water, inbox-zero a single email); 6) Keep a $10 kitchen timer on the desk to start 25-minute deep-work sprints; 7) Put the charger outside the bedroom and use a $15 alarm clock; 8) Give a friend your Screen Time passcode for the first 30 days; Results: daily pickups down ~40%, screen time -2h/day, sleep up 45 minutes, and I actually finish books again. If you try this, start with just Downtime + grayscale for a week. Happy to answer questions or share my Focus filters if helpful.",
    "subreddit": "DecidingToBeBetter",
    "title": "I turned my smartphone into a weekday \"dumb phone\" and it's been life-changing—here's the exact setup"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "After years of doomscrolling and fractured focus, I built a friction-first phone setup for Mon–Fri: 1) Move social/media apps off the home screen into a folder named \"Later\"; 2) Delete addictive apps and rely on their web versions only (harder to use, easier to ignore); 3) Set Screen Time/Focus with Downtime from 8am–6pm allowing only calls, maps, calendar, camera, notes, authenticator, and messages; 4) Use a minimalist launcher and grayscale mode to reduce visual reward; 5) Add a home-screen shortcut to a \"Bored? Read this\" note that lists quick tasks (two push-ups, drink water, inbox-zero a single email); 6) Keep a $10 kitchen timer on the desk to start 25-minute deep-work sprints; 7) Put the charger outside the bedroom and use a $15 alarm clock; 8) Give a friend your Screen Time passcode for the first 30 days; Results: daily pickups down ~40%, screen time -2h/day, sleep up 45 minutes, and I actually finish books again. If you try this, start with just Downtime + grayscale for a week. Happy to answer questions or share my Focus filters if helpful.",
    "subreddit": "DecidingToBeBetter",
    "title": "I turned my smartphone into a weekday \"dumb phone\" and it's been life-changing—here's the exact setup"
  },
  {
    "link_flair_text": "Discussion",
    "over_18": "false",
    "post_id": "yit4sw",
    "self_text": "I am looking for a way to get stats from how many servers of all the ones on discord that have 100+ members. I have seen a lot of stats on usage by users, but nothing that tells me how many discord servers have more than 100 members.",
    "subreddit": "discordapp",
    "title": "How can I get stats on server size and usage?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4tm",
    "self_text": "I bought the Deluxe Edition - hell, I bought a hard copy of it, just because I think it'd be awesome on my shelf. I am, however, wondering if the author has given their blessing on sharing files of the book with the other people I play with, or if I should continue using the free edition with them.",
    "subreddit": "SWN",
    "title": "Has anything been stated about sharing files of the books with others?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4tm",
    "self_text": "I bought the Deluxe Edition - hell, I bought a hard copy of it, just because I think it'd be awesome on my shelf. I am, however, wondering if the author has given their blessing on sharing files of the book with the other people I play with, or if I should continue using the free edition with them.",
    "subreddit": "SWN",
    "title": "Has anything been stated about sharing files of the books with others?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4tm",
    "self_text": "I bought the Deluxe Edition - hell, I bought a hard copy of it, just because I think it'd be awesome on my shelf. I am, however, wondering if the author has given their blessing on sharing files of the book with the other people I play with, or if I should continue using the free edition with them.",
    "subreddit": "SWN",
    "title": "Has anything been stated about sharing files of the books with others?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4tm",
    "self_text": "I bought the Deluxe Edition - hell, I bought a hard copy of it, just because I think it'd be awesome on my shelf. I am, however, wondering if the author has given their blessing on sharing files of the book with the other people I play with, or if I should continue using the free edition with them.",
    "subreddit": "SWN",
    "title": "Has anything been stated about sharing files of the books with others?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit4xc",
    "self_text": "I want to send a screenplay out to attract a cast and crew to make a trailer, from it and then from there on, get crowdfunding and investors possibly.  But is it risky to send out a script.  I have heard stories about script concepts being stolen once in a while.  And even if I register it for copyright, I couldn't do a lawsuit.  Or is it not going to happen most likely and just not worry?",
    "subreddit": "Filmmakers",
    "title": "Should filmmakers be nervous about their script work stolen or no?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit4xc",
    "self_text": "I want to send a screenplay out to attract a cast and crew to make a trailer, from it and then from there on, get crowdfunding and investors possibly.  But is it risky to send out a script.  I have heard stories about script concepts being stolen once in a while.  And even if I register it for copyright, I couldn't do a lawsuit.  Or is it not going to happen most likely and just not worry?",
    "subreddit": "Filmmakers",
    "title": "Should filmmakers be nervous about their script work stolen or no?"
  },
  {
    "link_flair_text": "THE SINGLE LIFE",
    "over_18": "false",
    "post_id": "yit4z3",
    "self_text": "Title",
    "subreddit": "90dayfianceuncensored",
    "title": "Veronica is kinda fucking crazy if she gets so upset about a man putting his child before anything else."
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4z6",
    "self_text": "Whats going on with these supports. Missing, broken, floating supports. Its all on default and even messing with the support settings I cant seem to get it to generate supports properly on this model.  &#x200B;  https://preview.redd.it/zq1mr3xod8x91.png?width=1201&format=png&auto=webp&s=405628095c5262bf450e3d8e1fff929a7a15d3d2",
    "subreddit": "ender3v2",
    "title": "Cura Supports"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4za",
    "self_text": "How's everyone's turnout so far? Pretty busy is Cedar Park center.",
    "subreddit": "CedarPark",
    "title": "Halloween Turnout"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4zp",
    "self_text": "Hey all appreciate any advice. I graduated this past June with a math and physics undergraduate degree. Currently working as a data scientist on OPT with my employer adding me to the H1 lottery. Essentially I’d like to start pursuing a online part time masters degree in Data Science as soon as possible. Am I allowed to do this while working on OPT, or must I wait until I get a different visa?",
    "subreddit": "f1visa",
    "title": "Part time studies while on OPT"
  },
  {
    "link_flair_text": "Academic Advising/Counseling ",
    "over_18": "false",
    "post_id": "yit550",
    "self_text": "I’m confused what classes I should take for the upper division elective courses. I have psych 312 done and i plan to take the 400 level a different semester. Looking at my tda is confusing in which 300 level ones can apply for an elective and which can’t. can anyone give me some recommendations??",
    "subreddit": "csuf",
    "title": "Help with psychology electives"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit554",
    "self_text": "I went to the hospital Thursday night. Left home with nothing .3 something. Shakes bad and kept withdrawing so drank wine. Tried to go to detox Friday afternoon. Was a bad place. No nurses or doctors on staff cuz “weekend”. Detox sent me back to the hospital because “psych eval”. My bloodwork is stellar. Great. Home but drank maybe 18 light beers. Better than the 30-40 before Friday. 11 Libriums left. Don’t drink and benzo. Plan is to wake up tomorrow and just Librium no booze. Dear god let the sleep come and shakes stop at some point.",
    "subreddit": "Crippled_Alcoholics",
    "title": "Back from detox"
  },
  {
    "link_flair_text": "Ask the Aggies",
    "over_18": "false",
    "post_id": "yit58f",
    "self_text": "Would you recommend working for TAMU EMS for healthcare experience? Are there usually a lot of patients if you do standby or is there a lot of downtime? Are there more patients if you do ambulance? If you are looking for healthcare experience, would you get to do more by being an er tech at one of the hospitals here?",
    "subreddit": "aggies",
    "title": "How is it working for TAMU EMS?"
  },
  {
    "link_flair_text": "Discussion",
    "over_18": "false",
    "post_id": "yit590",
    "self_text": "Okay. It used to be a scroll wheel menu to get the gas stove started.  I'm on PC, how can I light my gas stove, canister, pot full of water, and venison?   TY In Advance. Everything I find is either like just switch it on, or they mention the old ui. I keep just picking it up and have seen conflicting information on if I need matches or not.",
    "subreddit": "dayz",
    "title": "Halp. Back at it, need to switch on gas stove."
  },
  {
    "link_flair_text": "WWYD",
    "over_18": "false",
    "post_id": "yit59l",
    "self_text": "Hi all!  I don’t work in actual social work, but I do work in low income housing (at a Housing Authority) as a caseworker, and I feel like this might be the closest spot on Reddit for asking this question!   I am the housing caseworker for 3 separate properties (and two different programs). I handle things for current tenants of those properties, including income reexaminations, annual inspections, and all the other program rules HUD requires — most of which have to do with the income exams and inspections. I also handle things for people wanting to join the program and move into the properties — income checking, citizenship/immigration and background verification, securing socials/birth certificates/ID/etc, and completing the leases, rent calculations, and getting security deposits. It is a job I love a LOT and find really fulfilling, but I’ve reached a point where I’m absolutely at the end of my rope.   I have to have communication with the property staff — who collect rent, enforce the lease, handle maintenance requests, and other various property management style duties. For the past 5 months, despite MULTIPLE talks —we are talking DOUBLE DIGIT sit down meetings — nothing is being communicated with me. For example, When someone moves out, I have two days to process that in our system in order to trigger a refund of their security deposit. That is a legal standard for the program we are part of. I am not being told about people moving out until weeks or even months later. I am not being told when there are pending evictions, Im not being told about people who change their minds about moving in — nothing is being communicated to me. These things are critical for me doing my job. I’ve given up on this shit ever being resolved, because if no less than 16 meetings has gotten the point across, I doubt anything will.   I am the one tasked with training new employees — including new supervisors (I am not a supervisor!).  I have to help out one of my coworkers who is drowning in late work (a caseload she inherited that hadn’t been worked in over a year) as well as helping the other programs in the building. Our IT department is woefully awful, and I’m under 35, so I also have to play IT. I pride myself on being organized and good at my job (I’ve gotten an award for shining star employee of the year!), but I feel like my job and the clientele I serve are suffering because I cannot stay ahead.   I am just so burnt out! I have stress nightmares. What do y’all do to help maintain boundaries? To help the burnout? I do not want to quit my job — I truly love what I do. But my mental health is suffering massively.",
    "subreddit": "socialwork",
    "title": "Dealing with burnout/boundaries?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit5a6",
    "self_text": "I feel like I can never really enjoy it as I’m so self conscious. I much prefer to give than receive.",
    "subreddit": "LesbianActually",
    "title": "Do you enjoy being eaten out?"
  },
  {
    "link_flair_text": "Technical",
    "over_18": "false",
    "post_id": "yit5aa",
    "self_text": "To start off I’ve already tested for CO and the levels in the car are the same as they are outside.   Whenever I turn the heat on it just smells sort of like exhaust but slightly different, if that makes sense. If I switch it to the coldest setting the smell goes away. Does anyone know what the issue might be?",
    "subreddit": "mazda3",
    "title": "08 Mazda 3 heater smells somewhat like exhaust but AC smells fine."
  }
]