[
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit2lc",
    "self_text": "I've delegated this role to one of our regular users. However, the only thing they can do is enter the email address where the invitiation is being sent. Is there another permission that isn't User Administrator that would allow them to enter some data in other fields? Namely, First and Last Name, Company Name and maybe even add them to some security groups? I'm an admin, so I see all of these fields when I'm adding guests.   Adding to the groups would be the cherry on top, but I understand group membership isn't the same thing as user properties.",
    "subreddit": "AZURE",
    "title": "Question about Guest Inviter role"
  },
  {
    "link_flair_text": "Talk/Support",
    "over_18": "false",
    "post_id": "yit2lq",
    "self_text": "I feel like I must scar my face badly, because by this logic then my brain would have a reason more to commit self-oof... or even do permanent and serious stuff. Anyone else ever felt this?",
    "subreddit": "selfharm",
    "title": "I feel like I must do something but I'm trying to hold myself back, anyone else ever experienced this? TW: suicide"
  },
  {
    "is_ai": true,
    "link_flair_text": "AI",
    "over_18": "false",
    "post_id": "0",
    "self_text": "After years of doomscrolling and fractured focus, I built a friction-first phone setup for Mon–Fri: 1) Move social/media apps off the home screen into a folder named \"Later\"; 2) Delete addictive apps and rely on their web versions only (harder to use, easier to ignore); 3) Set Screen Time/Focus with Downtime from 8am–6pm allowing only calls, maps, calendar, camera, notes, authenticator, and messages; 4) Use a minimalist launcher and grayscale mode to reduce visual reward; 5) Add a home-screen shortcut to a \"Bored? Read this\" note that lists quick tasks (two push-ups, drink water, inbox-zero a single email); 6) Keep a $10 kitchen timer on the desk to start 25-minute deep-work sprints; 7) Put the charger outside the bedroom and use a $15 alarm clock; 8) Give a friend your Screen Time passcode for the first 30 days; Results: daily pickups down ~40%, screen time -2h/day, sleep up 45 minutes, and I actually finish books again. If you try this, start with just Downtime + grayscale for a week. Happy to answer questions or share my Focus filters if helpful.",
    "subreddit": "DecidingToBeBetter",
    "title": "I turned my smartphone into a weekday \"dumb phone\" and it's been life-changing—here's the exact setup"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4tm",
    "self_text": "I bought the Deluxe Edition - hell, I bought a hard copy of it, just because I think it'd be awesome on my shelf. I am, however, wondering if the author has given their blessing on sharing files of the book with the other people I play with, or if I should continue using the free edition with them.",
    "subreddit": "SWN",
    "title": "Has anything been stated about sharing files of the books with others?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Build - Help",
    "over_18": "false",
    "post_id": "yit4xi",
    "self_text": "Okay so I have a custom built computer that me and a few previous friends helped me put together.   I went into pcpartpicker and put in the graphics card I'm looking at and it only says in the notes that the CPU cooler may require a separately available mounting adapter with the motherboard. So it doesn't say that there might be a problem with this new graphics card. And the CPU and motherboard fit fine so no problems there. Everything seems compatible from what I see.  I'm just needing help seeing if the graphics card that I'm considering buying is better than my current one. Here's what newegg says when I compare the two (if that link doesn't work just yell at me or something to fix it xD):  Computer parts, laptops, electronics, and more - Newegg United States   Space in the case is not a concern and I have enough wattage to support the 3060 card (I have a 650W power supply)  Also wondering what they mean when they say, \" 2 x HDMI 2.1\" That means it'll still give me 2 HDMI ports right? I need that for my monitor and my drawing tablet.  Any feedback would seriously be awsome. Thanks <3",
    "subreddit": "PcBuild",
    "title": "I need help with finding a new graphics card but I'm a freaking noob LOL Can anyone help me figure out if this card I found would work fine with my current build?"
  },
  {
    "link_flair_text": "Question",
    "over_18": "false",
    "post_id": "yit4xc",
    "self_text": "I want to send a screenplay out to attract a cast and crew to make a trailer, from it and then from there on, get crowdfunding and investors possibly.  But is it risky to send out a script.  I have heard stories about script concepts being stolen once in a while.  And even if I register it for copyright, I couldn't do a lawsuit.  Or is it not going to happen most likely and just not worry?",
    "subreddit": "Filmmakers",
    "title": "Should filmmakers be nervous about their script work stolen or no?"
  },
  {
    "link_flair_text": "THE SINGLE LIFE",
    "over_18": "false",
    "post_id": "yit4z3",
    "self_text": "Title",
    "subreddit": "90dayfianceuncensored",
    "title": "Veronica is kinda fucking crazy if she gets so upset about a man putting his child before anything else."
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4z6",
    "self_text": "Whats going on with these supports. Missing, broken, floating supports. Its all on default and even messing with the support settings I cant seem to get it to generate supports properly on this model.  &#x200B;  https://preview.redd.it/zq1mr3xod8x91.png?width=1201&format=png&auto=webp&s=405628095c5262bf450e3d8e1fff929a7a15d3d2",
    "subreddit": "ender3v2",
    "title": "Cura Supports"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4za",
    "self_text": "How's everyone's turnout so far? Pretty busy is Cedar Park center.",
    "subreddit": "CedarPark",
    "title": "Halloween Turnout"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit4zp",
    "self_text": "Hey all appreciate any advice. I graduated this past June with a math and physics undergraduate degree. Currently working as a data scientist on OPT with my employer adding me to the H1 lottery. Essentially I’d like to start pursuing a online part time masters degree in Data Science as soon as possible. Am I allowed to do this while working on OPT, or must I wait until I get a different visa?",
    "subreddit": "f1visa",
    "title": "Part time studies while on OPT"
  },
  {
    "link_flair_text": "Academic Advising/Counseling ",
    "over_18": "false",
    "post_id": "yit550",
    "self_text": "I’m confused what classes I should take for the upper division elective courses. I have psych 312 done and i plan to take the 400 level a different semester. Looking at my tda is confusing in which 300 level ones can apply for an elective and which can’t. can anyone give me some recommendations??",
    "subreddit": "csuf",
    "title": "Help with psychology electives"
  },
  {
    "link_flair_text": "Ask the Aggies",
    "over_18": "false",
    "post_id": "yit58f",
    "self_text": "Would you recommend working for TAMU EMS for healthcare experience? Are there usually a lot of patients if you do standby or is there a lot of downtime? Are there more patients if you do ambulance? If you are looking for healthcare experience, would you get to do more by being an er tech at one of the hospitals here?",
    "subreddit": "aggies",
    "title": "How is it working for TAMU EMS?"
  },
  {
    "link_flair_text": "Ask the Aggies",
    "over_18": "false",
    "post_id": "yit58f",
    "self_text": "Would you recommend working for TAMU EMS for healthcare experience? Are there usually a lot of patients if you do standby or is there a lot of downtime? Are there more patients if you do ambulance? If you are looking for healthcare experience, would you get to do more by being an er tech at one of the hospitals here?",
    "subreddit": "aggies",
    "title": "How is it working for TAMU EMS?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit58x",
    "self_text": "So does UT Austin not have a single day where they release all the early action decisions?",
    "subreddit": "UTAustinAdmissions2",
    "title": "Early action decision date"
  },
  {
    "link_flair_text": "WWYD",
    "over_18": "false",
    "post_id": "yit59l",
    "self_text": "Hi all!  I don’t work in actual social work, but I do work in low income housing (at a Housing Authority) as a caseworker, and I feel like this might be the closest spot on Reddit for asking this question!   I am the housing caseworker for 3 separate properties (and two different programs). I handle things for current tenants of those properties, including income reexaminations, annual inspections, and all the other program rules HUD requires — most of which have to do with the income exams and inspections. I also handle things for people wanting to join the program and move into the properties — income checking, citizenship/immigration and background verification, securing socials/birth certificates/ID/etc, and completing the leases, rent calculations, and getting security deposits. It is a job I love a LOT and find really fulfilling, but I’ve reached a point where I’m absolutely at the end of my rope.   I have to have communication with the property staff — who collect rent, enforce the lease, handle maintenance requests, and other various property management style duties. For the past 5 months, despite MULTIPLE talks —we are talking DOUBLE DIGIT sit down meetings — nothing is being communicated with me. For example, When someone moves out, I have two days to process that in our system in order to trigger a refund of their security deposit. That is a legal standard for the program we are part of. I am not being told about people moving out until weeks or even months later. I am not being told when there are pending evictions, Im not being told about people who change their minds about moving in — nothing is being communicated to me. These things are critical for me doing my job. I’ve given up on this shit ever being resolved, because if no less than 16 meetings has gotten the point across, I doubt anything will.   I am the one tasked with training new employees — including new supervisors (I am not a supervisor!).  I have to help out one of my coworkers who is drowning in late work (a caseload she inherited that hadn’t been worked in over a year) as well as helping the other programs in the building. Our IT department is woefully awful, and I’m under 35, so I also have to play IT. I pride myself on being organized and good at my job (I’ve gotten an award for shining star employee of the year!), but I feel like my job and the clientele I serve are suffering because I cannot stay ahead.   I am just so burnt out! I have stress nightmares. What do y’all do to help maintain boundaries? To help the burnout? I do not want to quit my job — I truly love what I do. But my mental health is suffering massively.",
    "subreddit": "socialwork",
    "title": "Dealing with burnout/boundaries?"
  },
  {
    "link_flair_text": "WWYD",
    "over_18": "false",
    "post_id": "yit59l",
    "self_text": "Hi all!  I don’t work in actual social work, but I do work in low income housing (at a Housing Authority) as a caseworker, and I feel like this might be the closest spot on Reddit for asking this question!   I am the housing caseworker for 3 separate properties (and two different programs). I handle things for current tenants of those properties, including income reexaminations, annual inspections, and all the other program rules HUD requires — most of which have to do with the income exams and inspections. I also handle things for people wanting to join the program and move into the properties — income checking, citizenship/immigration and background verification, securing socials/birth certificates/ID/etc, and completing the leases, rent calculations, and getting security deposits. It is a job I love a LOT and find really fulfilling, but I’ve reached a point where I’m absolutely at the end of my rope.   I have to have communication with the property staff — who collect rent, enforce the lease, handle maintenance requests, and other various property management style duties. For the past 5 months, despite MULTIPLE talks —we are talking DOUBLE DIGIT sit down meetings — nothing is being communicated with me. For example, When someone moves out, I have two days to process that in our system in order to trigger a refund of their security deposit. That is a legal standard for the program we are part of. I am not being told about people moving out until weeks or even months later. I am not being told when there are pending evictions, Im not being told about people who change their minds about moving in — nothing is being communicated to me. These things are critical for me doing my job. I’ve given up on this shit ever being resolved, because if no less than 16 meetings has gotten the point across, I doubt anything will.   I am the one tasked with training new employees — including new supervisors (I am not a supervisor!).  I have to help out one of my coworkers who is drowning in late work (a caseload she inherited that hadn’t been worked in over a year) as well as helping the other programs in the building. Our IT department is woefully awful, and I’m under 35, so I also have to play IT. I pride myself on being organized and good at my job (I’ve gotten an award for shining star employee of the year!), but I feel like my job and the clientele I serve are suffering because I cannot stay ahead.   I am just so burnt out! I have stress nightmares. What do y’all do to help maintain boundaries? To help the burnout? I do not want to quit my job — I truly love what I do. But my mental health is suffering massively.",
    "subreddit": "socialwork",
    "title": "Dealing with burnout/boundaries?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit5a6",
    "self_text": "I feel like I can never really enjoy it as I’m so self conscious. I much prefer to give than receive.",
    "subreddit": "LesbianActually",
    "title": "Do you enjoy being eaten out?"
  },
  {
    "link_flair_text": "",
    "over_18": "false",
    "post_id": "yit5le",
    "self_text": "View Poll",
    "subreddit": "barstoolsports",
    "title": "Who do you want to drain your balls?"
  }
]