[
  {
    "source": "posts",
    "id": 652881,
    "title": "Pooping nonstop",
    "self_text": "My 9 month old ACD will not stop pooping in the house. It's driving me insane. I take him out periodically throughout the day and he always poops outside (sometimes more than once.) After he does his business outside, he runs to me for a treat and I reward him every time.  The issue I am having is that he sees no issue with pooping inside the house. He sometimes will poop inside immediately after he just pooped outside. He has had plenty of time in the yard to run around and do his business, but he continues to poop inside as well.  I recently just caught him on camera eating his own poop. I'm disgusted and at a loss. I don't know how to prevent this. How do I teach him that pooping inside is bad?",
    "subreddit": "puppy101",
    "selected_at": "2025-09-06T23:09:09.913231Z"
  },
  {
    "source": "posts",
    "id": 978010,
    "title": "If you've got a reactive dog, KEEP IT ON A LEASH!!",
    "self_text": "In fact, just keep your dogs on a leash in general!!  My rescue has made incredible progress in the 4 months I've had him - he's more confident, more independent, more outgoing, and much less anxious. One of the main things we're still working on is interacting positively with other dogs. He's done great learning to not bark madly at every single dog he sees, so now we're very, very slowly learning how to be friendly with new dogs. But today some guy was sitting on a park bench with his little dog off-leash nearby. My boy barked once, and before I could calm him down the other dog started barking like crazy. Naturally my still-reactive dog reacted by barking and lunging (he never bites, just lunges), and the guy's dog reacted the same. Instead of being able to simply pull his dog back by its leash like I was, the guy had to sort of shoo it over and then motioned like he was going to hit his dog, which made it stop barking.   Besides the awfulness of threatening his dog with violence as discipline, the interaction also seriously agitated my boy - for the rest of our walk he barked and lunged at other dogs, even one of the only two he's learned how to be friendly with. It has set him back at least a week of difficult training and the whole thing could've been avoided if this clueless guy had just been able to pull his dog back as quickly as I did to stop the interaction before it started.   People, please. Even if your dog is excellently trained and perfectly behaved, KEEP IT ON A LEASH. You never know what another dog is going to do and the best way to keep everyone calm and safe - including your own dog - is to be able to pull them back if necessary. Some dogs are easily frightened, some are aggressive, some are poorly trained, some are suffering the effects of previous trauma, and obviously some have completely clueless owners. The difference between keeping yourself and your dog safe and somebody being being hurt or traumatized can be a simple as using a leash.",
    "subreddit": "dogs",
    "selected_at": "2025-09-06T23:21:18.147159Z"
  },
  {
    "source": "posts",
    "id": 831858,
    "title": "I Made This Pirate Themed Cat Wall for my Feline Overlords!",
    "self_text": "I’ve been working on this for months now and it’s finally near completion. Wanted to share some photos of the finished product!",
    "subreddit": "cats",
    "selected_at": "2025-09-06T23:21:38.989210Z"
  },
  {
    "source": "posts",
    "id": 381542,
    "title": "When is dog over emotional threshold using Julie Naismith method?",
    "self_text": "I am using Julie Naismiths method to leave dog alone. So I am basically leaving the front door for a few seconds at a time, coming back before he is over his \"emotional threshold\" and repeat, repeat, repeat and eventually up the time by adding a few seconds at a time.  My question is what counts as over his emotional threshold? My dog will let out a whimper within 2 seconds of me leaving  and I'm finding it difficult to get any further if I use this cue as I am really just shutting the door and opening it again!   I left him longer, up to a min, to see what he done and he lets out a whimper which feels like more of a whine than a cry (?) and then lies down, looks relaxed, but continues to let out a wee whine every few seconds.  Would you say these little whines are over h threshold? Or is this just a little annoyance at being left and wouldn't count as over his emotional threshold? I would say he is definitely not stressed during this first min but from what I've read you should take any sign of being uncomfortable as over his emotional threshold for this method?  Appreciate any advice!",
    "subreddit": "puppy101",
    "selected_at": "2025-09-06T23:51:55.290863Z"
  },
  {
    "source": "posts",
    "id": 972954,
    "title": "From a Dusty Porch To a Queen Bed",
    "self_text": "My love grows for her every day. I Rescued her 2 years ago when she was only ~1week old.  I wasn’t sure if she would make it through the night.  I rushed to the store and grabbed an eye dropper and KMR. I made her a small bed in a box with a warm electric blanket.  I woke up every 3 hours to feed and check on her.  A few vet visits and a lot of love later and she was fully healthy!  I never thought I would be a cat person, but here I am.  Cheers to all the other cat lovers out there 🍻",
    "subreddit": "cats",
    "selected_at": "2025-09-06T23:52:02.839501Z"
  },
  {
    "source": "posts",
    "id": 444925,
    "title": "How to remove cat pee smell from rug",
    "self_text": "I need advice on how to remove the cat pee smell from the rug in my bedroom. I've had cats for the past 10 years, and I've always been able to get rid of that pee smell but i am failing at doing so this time. I've used the nature's miracle foaming enzyme cleaner and it's always worked for me until now. My cat peed on my rug, i can see that it left a noticable mark on the underside of it. I've applied the foaming cleaner 3 times by now. And the last time I even re wet the area and blotted before applying the cleaner. Any tips or suggestions on how to get rid of the smell? It's right beside my bed and it's driving me nuts  Thanks on advance",
    "subreddit": "CatAdvice",
    "selected_at": "2025-09-06T23:55:51.496801Z"
  },
  {
    "source": "posts",
    "id": 959103,
    "title": "I'm tired of misinformation on dog nutrition and fearmongering on WSAVA brands",
    "self_text": "Title, I sometimes buy bones and raw stuff for my dog on a store, through messaging they asked me for a review of my last purchase but also asked what I give my dog as food, and my mistake was replying with the truth, Royal Canin.  The conversation ended with store telling me I was poisoning my dog and that corn is bad for dogs. Honestly, I just told them I believe real vets with certificates (I shared with them lots of tufts articles), and they told me that they prefer people who feed dog chow since they are poor and can't afford real food like, idk, Acana?  Looking at the certificates of those vets, they had DNM in their title, which is not a real university and the course looks like a bold 1990's webpage trying to sell you a scam.  When I showed them what WSAVA meant, articles on corn, on nutrition, on bacterial safety, they shut all down and just ended with \"good to have a debate but you are doing your dog wrong bye\" and never replied again.  It just bothers me because these people I bet do the same to lots of clients and try to use their credentials in order to fear monger others.  As an end note, I told them I think raw feeding is great IF you have a nutrition vet in charge of doing a balanced diet specifically for your dog, and that not all dogs do well on it. However they still felt like they should tell me how awful kibble is \"speacilly Royal Canin\"  Just venting I guess, I'm just so angry because they might get others trough that technique  &#x200B;  EDIT: Clarifying some things because of language barriers. This all happened through whatsapp, not on a physical location, they talked to me through the official store account.",
    "subreddit": "dogs",
    "selected_at": "2025-09-06T23:57:00.157388Z"
  },
  {
    "source": "posts",
    "id": 722893,
    "title": "getting my cat neuter today",
    "self_text": "This is my first cat and i have no cule what I'm doing any tips.",
    "subreddit": "CatAdvice",
    "selected_at": "2025-09-06T23:57:09.087780Z"
  },
  {
    "source": "posts",
    "id": 918708,
    "title": "How to tell if a cat likes being held?",
    "self_text": "my cat lets me pick her up, and she purrs and snuggles when shes being held. and she only wants to be set down when she sees something else that interests her (food, birds outside the window, etc)  But im worried about doing things she doesn't like because i cant ask her, so i have to just assume? will cats act like they like being held when they dont actually like it? I dont want to upset her",
    "subreddit": "CatAdvice",
    "selected_at": "2025-09-06T23:57:17.193774Z"
  },
  {
    "source": "posts",
    "id": 601490,
    "title": "Does anyone else's dog lay close to the fireplace for so long they're hot to the touch?",
    "self_text": "When my dog Buddy was alive, whenever we had a fire going in the fireplace he'd lay down with his back to the fire, and he'd be really close to it. He'd stay there for so long that even when he walked away he was hot to the touch, and it hurt to try to pet him.  Do/did any of y'all's dogs do that? Does anyone know why Buddy did it?",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T00:08:18.496591Z"
  },
  {
    "source": "posts",
    "id": 553608,
    "title": "how can I help my dog lose weight?",
    "self_text": "My mother recently gave me her dog because she cant take care of her anymore. Her name is mae mae and she's a pitbull. She weighs about 110 lbs or about 50 kilos and she has a lot of trouble walking. Along with her hip problems she has trouble doing mush of anything without falling over and giving up. How can I help her lose weight so she can do normal pitbull things again? Shes only five btw",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T00:22:33.705721Z"
  },
  {
    "source": "posts",
    "id": 604954,
    "title": "Is there a potty training God I can pray to?",
    "self_text": "Because I'm desperate 😩  I have a 7-month-old female puppy. We rescued her three months ago from the street and, since then, have been working tirelessly with her and have made significant progress on all fronts except for potty training.   She has slept through the night since we got her and can still last 8-10 hours. During the day, it was another story. She had accidents left and right and had no potty schedule; sometimes, she would hold her bladder for 5+ hours, and sometimes she wouldn’t last more than 40 minutes. I took her out as often as possible, and we eventually worked our way up to 2 hours, but even then, she was unpredictable.  After LOTS of pee puddles at home, on the couch, and even on the bed, she finally seemed to gain bladder control at around six months, and it has lasted up to 4 hours since then. One time she lasted 6 hours, and we were ecstatic. We started taking her out five times a day, and it finally seemed that we were out of the woodwork. Until yesterday. She randomly peed on the floor again, even after being taken out.  I knew what this meant. She always has multiple accidents, never just one. Her brain seems to go: “Oh, I guess this is okay now!” and then it keeps happening. So, it did. We woke up to a big pee puddle this morning. And even after being taken out four times today, and just as my partner was getting ready to take her out a fifth time, she peed on the bed while lying on it with me.   Why?! She’s been sleeping with us without issues since we brought her home. She’s only peed on the bed a couple of times, which was just in the beginning. It hadn’t happened for nearly two months!   I am beyond frustrated, and I have some questions:    Is it normal (from a developmental standpoint) for this to happen at seven months old, especially at random, since she’s shown that she can hold her bladder much longer?    Is this just adolescent regression, and if yes, is it dependent on something, or is it a spontaneous process that happens to every dog and has no way of being predicted or prevented?    How can I help my dog, except by taking her out more often? If I go back to doing this, after how much time can I confidently increase the interval again?    How can I send her the message that peing at home is not okay without upsetting or scaring her?    Which other potty training methods can I use besides crate training and using pee pads? Both of these would be too regressive for her.    I kindly ask you to take into consideration these things before commenting:    The dog does not have a medical issue and has been checked by a vet multiple times.     I am from Europe. We don’t do crate training here; even if we did, it would not work for my dog. She was abandoned as a little puppy and now has separation anxiety issues, which were only exacerbated when we used to restrict her access to us to give her time-outs as a training method. She has had full access to our home since we got her and has learned to behave perfectly, so crating her would be regressive and cause her unnecessary distress. Please don’t suggest it.     She is a medium to large-sized female dog that is almost fully grown and pees in one go. Her puddles are enormous, and peeing on a pee pad would not work. Additionally, it would be regressive to start doing it after three months of successfully peeing outside. Our goal is not to teach her that there is a place where she can pee inside; it’s to teach her that there is no peeing inside.     Tying her to me would also not work, as she was literally lying next to me when she peed on the bed.     Treating her like an 8-week-old puppy is not something we have the time, energy, or patience to do right now. I was doing that for two months, and my personal and professional life suffered, but it was okay since I was prepared to use that time only for the dog. I don’t have the luxury anymore and have serious obligations I cannot put off doing.     Sorry for the long post; I would appreciate it if you made it so far, and I would really be grateful if you could answer any of my questions.  Thank you so much!",
    "subreddit": "puppy101",
    "selected_at": "2025-09-07T00:23:42.296758Z"
  },
  {
    "source": "posts",
    "id": 995301,
    "title": "Any durable, comfortable, high quality dog beds out there?",
    "self_text": "It’s cyber Monday, and I realize my german spitz never had a proper dog bed for years since he’s always slept on the floor (he doesn’t like sleeping with me because he likes his personal space).   I wanted to get him one badly, but I’m not sure which brands are the best and most reliable. I want it to be best, since he sleeps a lot.",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T00:23:45.425145Z"
  },
  {
    "source": "posts",
    "id": 310122,
    "title": "Washing the famous \"Donut Bed\"?",
    "self_text": "Hey y'all! Does anyone have recommendations for washing the famous Best Friends by Sheri donut shag cuddler bed? My friend washed hers and the fur ended up all yucky and stuck together--not a look we are going for! The website says to just wash it in the gentle cycle, but thought I would crowdsource before I risked it! TIA!",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T00:27:56.595063Z"
  },
  {
    "source": "posts",
    "id": 964705,
    "title": "Should I rehome a bullying Bolivian Ram?",
    "self_text": "Hello everyone! Last Wednesday I bought a pair of bolivian rams for my 105l community tank.   I was skeptical at first, because from what little I studied on the subject they both seemed males to me, but I've been visiting the store for a while and the two seemed to get along pretty well in their original tank.   However, after I introduced them to my tank, the bigger one claimed most of the tank bottom for himself, harassing the other one at the other end of my aquarium. Now the smaller guy is basically stuck there, as the bully just doesn't suffer his existence and chases him away as soon as he catches a glimpse of him.   I also rearranged my driftood trying to hide them from each other, but it doesn't seem it's helping much.  Should I ask my shop if I can return them the bully? Or should I wait a couple more days to see if things settle down? I've never given away a fish and I'm afraid I might kill him in the process, but I can't stand watching him constantly being a jerk.",
    "subreddit": "Aquariums",
    "selected_at": "2025-09-07T00:39:44.163330Z"
  },
  {
    "source": "posts",
    "id": 853406,
    "title": "my vet tells me my cats only need dry food, but...",
    "self_text": "From scouring the internet, a lot of catsperts seem to advice the opposite, that wet food or even raw food is best because it's closer to their natural diet, so I'm a little conflicted on what to do...   My vet says dry food is good for their teeth & it has everything they need, so wet food should really only be like a snack every now and again.  The argument for more wet food I find online is, it's moist and since cats have a tendency to not drink well that way they get a higher liquid intake, and like stated before, it's more natural for cats to eat food that's less processed.   An argument against wet/raw food I can find is that it makes cat breath smell worse & it's less good for their gum health.  How do you guys feed your cats? Do you have any more info on this that could help me?  I have trouble finding scientific papers /proven statements/ research about cat food & what would be best, so if anyone has some sources? That would be great!  (Feeding info: Right now I've settled on once a day wet food & twice to thrice a day a portion of dry food (I have kittens of around 6-7 months old so im going from more to less feeding moments in a day)  (I feed my cats two types of Edgar Cooper dry foods that have a meat + fish percentage of 65% and 50% & is grain free with no added sugars, the wet food is about the same nutrition wise + ive made sure the food is made for (sterilised) kittens)",
    "subreddit": "cats",
    "selected_at": "2025-09-07T15:40:07.889785Z"
  },
  {
    "source": "posts",
    "id": 964794,
    "title": "One of my little ones",
    "self_text": "No special reason for posting other than last years Christmas lights reflected in her eyes.  But she'd be happy to gather more worshipers of course. She is Princess Dolly.",
    "subreddit": "cats",
    "selected_at": "2025-09-07T15:43:50.950370Z"
  },
  {
    "source": "posts",
    "id": 779329,
    "title": "Cat problems",
    "self_text": "We have had our cat since he was a baby. im stumped.  He used to use his litter box all the time then slowly stopped. Now he doesnt use it all.   He always pees or poops in the same area in our kitchen by the patio door. Its never anywhere different. I give him the IAMS cat food with zero filler. I always give him fresh water. Ive always used the PURINA tidy cats 24/7 litter. Hes always running around the house and outside too with plenty of energy ao i dont think hes sick at all.  Ive tried placing his poop in the litter box. I changed the litter to that expenaive one that supposed to guarentee your cat will love it because its supposed to be scented that way but he doesnt use it.  Ive tried moving the litter box to the area in the kitchen and just dies his business around the box. One thing i seen though... ive gotten accustomed to putting down a trail of paper towels to help with absorption and all that and he will do business on the paper towls, then hell try to kick over the papers if he can, to cover his mess, so i know hes still trained.  His mess looks normal like nirmal cat poop. He doesnt yell or seem like hes straining. He does meow alot amd want to go outside a lot so aometime i lwt him go all the time then he comes back into the house for a couple days then wanta to go outside.  We dont have other animals. And its just my wife and i.  Maybe someone can help me out with this?",
    "subreddit": "cats",
    "selected_at": "2025-09-07T16:52:02.209431Z"
  },
  {
    "source": "posts",
    "id": 1027799,
    "title": "[Pet Injury][California] My dog was injured at a kennel, should I pursue further action?",
    "self_text": "My wife and I were out of town a couple weeks ago, so we dropped off our 5-month puppy (golden retriever/poodle/shiba mix) at a dog boarding place* (not kennel sorry) over the weekend for the first time. I received a call the next day saying our puppy fractured her leg and they're not exactly sure how. They mentioned it was from \"normal play\" and that they were terribly sorry. They took our puppy to their vet, who took x-rays and revealed both her leg and knee were fractured, which would require surgery ASAP.  I find it very hard to believe this happened from just \"normal play\", but the boarding place keeps insisting this and when I requested for video footage, they claimed that their cameras do not store footage (which did not make sense to me). I did get written evidence through text that they claimed fault and that they would pay for our dog's surgery. However, prior to dropping our dog off, they had me sign a waiver freeing them of any liability if something were to happen.   Our dog had her surgery on Nov. 10, a little over 2 weeks ago, which costed $6,000 out of our pocket, and when I last contacted the boarding place yesterday, all they say is that they're working on it with their insurance. I do have pet insurance, but I would need to claim it within a month of the incident. Should I just claim it under my insurance since I am running out of time? Should I threaten with legal action? Do I even have a case?",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-07T18:22:47.364772Z"
  },
  {
    "source": "posts",
    "id": 313498,
    "title": "I recently got a puppy and I fully regret it",
    "self_text": "For years, I have wanted a puppy. I let my husband talk me out of it because we have cats, because we travel a lot, because they're expensive. Finally, after a big (unrelated) fight with my husband and the death of my childhood dog, he relented and agreed to bring a puppy into the home.   The first few days were great but now the only time I even like my dog is when he's asleep. All he does is jump and bite. Want to play fetch? Get bitten. Want to play tug? Get bitten. But he won't play with any of his toys on his own, save for one. My whole day is just correcting the puppy's behavior. Or making sure he and the stubborn cat who hates the dog but refuses to stay out of the same room don't hurt one another. My other cat won't even come downstairs anymore. I'm pretty sure she hated me now.   I looked into trainers for the dog but an in home behavior specialist costs nearly $2,000. I can't rely on the people I planned to have watch my dog watch him when we travel because I'm afraid his jumping and biting, while playful and not out of aggression, will hurt them (or, in the case of one friend, hurt her child). But I guess it doesn't matter anyway because I'll have to cancel my trip to be able to afford a trainer.   I wish I hadn't gotten this dog. I'm tired and frustrated all the time. I've cried two out of the past three days. I have no time to myself unless I put him in his crate because he needs constant supervision, but if I put him in his crate he comes out a ball of uncontrolled energy and his jumping and biting get worse.   I made such a big deal about wanting a puppy and it's ruined my life. But I can't deal with the judgement I would face from my family and friends if I even admitted that, let alone decided to give him up.",
    "subreddit": "confessions",
    "selected_at": "2025-09-07T18:47:21.182637Z"
  },
  {
    "source": "posts",
    "id": 916440,
    "title": "Does anyone here do conformation showing/judging?",
    "self_text": "Hello r/dogs,  I was wondering if anyone here has experience with dog showing and can tell me a bit more about checking the mouths of dogs. When a judge is looking at the teeth of a dog, are they only judging the bite/missing teeth/jaw alignment, or do they also judge tartar build up?  I looked at the AKC website and it doesn't mention tartar/dental health at all, apart from missing teeth.",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T18:56:40.472232Z"
  },
  {
    "source": "posts",
    "id": 949294,
    "title": "My new plants didn't make it.",
    "self_text": "I got these plants last week and was told they're juvenile and will need to float untill they grow roots, at which point I can plant them.  Unfortunately they died before I got the chance.   Did I do something wrong or was that just bad advice?   (Five gallon, one Betta, one snail. With heater and filter, water test in pics.) ((sorry I post so much I swear I'm trying my best))",
    "subreddit": "Aquariums",
    "selected_at": "2025-09-07T19:12:07.498478Z"
  },
  {
    "source": "posts",
    "id": 579178,
    "title": "Not reverse sneezing. Not bloat. Did not present as a blockage. Guess what?!",
    "self_text": "I am mostly posting this so that if there is anyone else scouring Reddit at 330 in the morning trying to figure out what the fuck is wrong with their dog, like I was last night, they might get a little insight from my past 24 hours.   6 month old golden retriever. Looking like she needs to throw up but is stopping herself from actually letting it up. Gagging. Kind of sort of sounds like some  of the reverse sneezing examples I was able to Google but not enough to make me think that’s what it was..   I was looking at my pup and I empathetically felt like I needed to puke but kept stopping just short of doing it.  no actual vomiting. No diarrhea. Stomach never distended so I was slightly confident it wasn’t bloat.   dog was inhaling grass like a cow. Never threw up. But always looked like she was about to with out actually dry heaving every 30-40 minutes from 4pm- 5am when I finally got confirmation the hospital was open.   12 hours and $1200 later. These are the symptoms of a partial blockage. 5 X-rays determined multiple blockages however all the grass seems to be pushing it through to her colon. Which is positive news. We are due back tomorrow bright and early to get a 2nd set of X-rays and possibly an ultra sound to make sure it all makes it to her colon with out surgical intervention.  she was eating normally and had normal energy levels. But there was still just something wrong so I decided to take her to a 24 hour animal hospital. Everything I googled was just not quite the symptoms of one thing or another. I’m glad I listened to my gut and took her. Even if surgery isn’t needed they were able to give her fluids and a digestive aid to help push things through. I’m hoping it’s a win tomorrow on the ultrasound.  the vet also has a 9 month old retriever and reassured me that goldens  eat EVERYTHING and that it’s not me just not paying attention. Because I am 1000% a helicopter dog mom.",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T19:16:08.304785Z"
  },
  {
    "source": "posts",
    "id": 657084,
    "title": "Dog recommendations? Hypoallergenic-ish, good with kids, friendly",
    "self_text": "Hi all! My wife and I love dogs (despite the fact that I am sadly allergic), and after saying goodbye to our beloved chihuahua rescue mutt last month, we'll start to look for another dog in the next few months. A few criteria:   Hypoallergenic: we know that no dogs are COMPLETELY allergen free, and my sh*tty allergies may act up regardless of breed, but the hope is that the dog is lower on the allergen front  Good with kids: Family starting may begin, so dog choice will want to accommodate that  Friendly but not too clingy: we like dogs that like being around humans rather than being aloof, but won't panic if I have a day of meetings and my wife is out of the house for work  Smart enough to use the dog door we've built in to our back yard   Any advice, breeds or approaches to picking a dog you'd recommend? Thanks!",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T19:19:31.000986Z"
  },
  {
    "source": "posts",
    "id": 415330,
    "title": "Yorkie mix",
    "self_text": "Hello. I’m currently wanting to adopt a dog and initially looked at shih tzus but the one I wanted was sold before me. So now I’ve found a family who has a two year old boy yorkie-poodle mix. I went to meet him today and he seems playful, clean and healthy. She said he’s up to date on all vaccines but not neutered. Does well with other dogs and barely barks. He’s about 8 pounds.  I don’t know much about yorkies but I do know some about poodles. Is there anything about the breed I should know/ask about?  About me: work outside the home about 2-3x a week for around 6 hours a time. Im more laid back but live a pretty active lifestyle. (Boxing, cardio/running) I’m not looking to have a dog workout with me. But I do go outside everyday. What do you think? Any advice?",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T19:52:24.654136Z"
  },
  {
    "source": "posts",
    "id": 750899,
    "title": "PSA - if your dog is anything like mine, don’t waste your money on the Yeti dog bowl",
    "self_text": "He doesn’t care that it keeps water cooler for longer or how expensive it is. The toilet bowl is still is preferred utensil for water consumption.",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T21:21:44.911793Z"
  },
  {
    "source": "posts",
    "id": 709878,
    "title": "My 4 year old lab teaching the new puppy naughty behavior",
    "self_text": "My 4 year old lab is the best dog ever. We got a puppy about a month ago. They are now thick as thieves. Recently, said lab is teaching new puppy naughty behavior. Like let’s go dig under the porch or crawl under the chicken house. When we see these things the puppy is in full manic mode and the lab bails, leaving puppy looking like a felon. How can I fix this?",
    "subreddit": "puppy101",
    "selected_at": "2025-09-07T22:09:24.042632Z"
  },
  {
    "source": "posts",
    "id": 577968,
    "title": "What’s wrong with Miltons eye?",
    "self_text": "Miltons eye has been an issue for almost three months now. It started when his third eyelid was red and slightly swollen. Now his upper eyelid is also swollen. We have checked his teeth, did aspirations and biopsy samples (came back negative for cancer), swabbed it for bacteria, and given him many kinds of medicine (eye drops, eye ointment, oral & injected antibiotics and most recently oral steroids) Does anyone have any advice or suggestions here? Currently his eye is pretty much shut. We are so desperate for Milton to recover but can’t figure out what’s wrong. Removing his eye is in the realm of things but ideally we want to know the cause. Milton is also 11 years old with early ckd, hypertension, and he has a pericardial peritoneal diaphragmatic hernia AKA a genetic condition where most of his organs are in his chest cavity. Which makes putting him under stressful and delicate. He’s so loved and would appreciate anyones insight!",
    "subreddit": "cats",
    "selected_at": "2025-09-07T22:13:43.084781Z"
  }
]