[
  {
    "source": "posts",
    "id": 498525,
    "title": "I have a joke about nihilism",
    "self_text": "but I guess it doesnt matter...",
    "subreddit": "Jokes",
    "selected_at": "2025-09-06T23:06:56.921220Z"
  },
  {
    "source": "posts",
    "id": 857627,
    "title": "I crouch down, tuck my head between my knees, I put my arms over my head and I rock forwards.",
    "self_text": "That's how I roll 👍🏻",
    "subreddit": "dadjokes",
    "selected_at": "2025-09-06T23:13:03.011526Z"
  },
  {
    "source": "posts",
    "id": 543105,
    "title": "A lumberjack once told me he's cut down 27,572 trees",
    "self_text": "\"How do you know exactly how many\" I replied.   “Easy, I keep a log...\"",
    "subreddit": "dadjokes",
    "selected_at": "2025-09-06T23:17:06.748235Z"
  },
  {
    "source": "posts",
    "id": 376086,
    "title": "AITA for confronting neighbourhood ding-dong-dashers?",
    "self_text": "Just to be clear if \"ding-dong-dash\" is country specific, I am talking about when children ring doorbells and run away.  I (F29) am a SAHM with a sick toddler and a newborn at the moment. My husband (M31) took some time off work when the baby was born, but has since gone back, so it is just the babies in the house day-to-day. Safe to say, I am not particularly well-rested at the moment, and the house is a bit chaotic.  Today being Saturday, my husband said that he would help me catch up on some of the chores while I got some rest. I was really grateful, it has been a tough week. Unfortunately, some kids in the neighbourhood must have taken advantage of the good weather and thought to play ding-dong-dash.  The first incident was funny, the second time was mildly irritating, but I was downright frustrated by the sixth time. The baby and the toddler were both woken/disturbed each time, and I didn't get any of the rest that I was so looking forward to. I decided that I would help my husband with chores seeing as I was up anyway.  The seventh ding-dong-dash just so happened to be when I was vaccumming the hallway, so I got to the door before the kids were gone. There were two young boys, I would say six or seven, and they got a massive shock when I opened the door.  To be clear, I was firm but I was by no means shouting or hostile. I asked them what they thought was funny about disturbing my family, and one of them responded that I was not their mom. I said back, \"I am not, but I don't think she would want to be disturbed either.\" After that, they turned and ran away. It was a very brief interaction.  Later, a man identifying himself as the boys' dad knocked on the door and said I made the boys cry. He said that it was children being children, they weren't hurting anyone, and my comment about their mom being disturbed was uncalled for seeing as she had passed away. He said that I made them both cry all afternoon and they are afraid of playing in the neighbourhood anymore. He also said that he could not believe I \"lay in wait for them.\"  I explained that I was sick and tired of the doorbell going off, but he said that I should just disarm it if some ringing disturbs my family that much. I feel like I am entitled to a doorbell, but that I shouldn't have to deal with constant ringing.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:25:35.220933Z"
  },
  {
    "source": "posts",
    "id": 374558,
    "title": "I went to a kleptomaniacs anonymous meeting last night..",
    "self_text": "I went to grab a chair but they were already taken.",
    "subreddit": "Jokes",
    "selected_at": "2025-09-06T23:25:36.861631Z"
  },
  {
    "source": "posts",
    "id": 255556,
    "title": "AITA? Tattoo appt gift, turned to nap time",
    "self_text": "Am I the asshole? I took a friend of mine to a tattoo parlor for the Halloween flash sales,  they had just started two jobs and college and I thought this would be a nice thing for them to have as a personal reward. I let them know in advanced it would be a wait and I asked if they’d be okay staying awake (this parlor is weird about patrons lounging in the waiting room and has multiple signs)They agreed multiple times letting me know they’d be able to stay awake. Once we got there we filled out the paper work chose the designs and sat down. Within 10 minutes my friend is SNORING next to me loud enough to disturb the very last booth. The young woman up at the front asked me to wake him up and I happily did and said his name a few times till he woke up. He apologized readjusted and continued to fall back asleep multiple times even after being woken up by an artist and being asked if he’d like to change the appointment so he could get some rest. He denied and I was called back while he was sleeping again for my tattoo. When I returned he was wide awake and chipper and talking to everyone in the waiting area. He was pulled back for a $40 tattoo which I was paying for, handed him $100 and told him to tip the artist $40 and give the rest back. After the tattooing was done and payments I found out when my friend who was his tattoo artist let me know he only received $40 meaning the guy I brought pocketed the rest and didn’t bother tipping him at all. I called him out on it and he proceeded to go quiet and not say anything back. And then changed the subject entirely about my future appointments and he stopped by an ice cream shop before we made it back to my apartment. Where I proceeded to gather my things get out of the car and walk into my apartment, he then messaged me apologizing for the night not going how I expected it. I had no expectations outside of having a fun night with a friend and they slept through most of it and didn’t even tip with the money I gave him!",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:27:08.690365Z"
  },
  {
    "source": "humorposts",
    "id": 1848,
    "title": "In Superman (2025), After a villain and threatens to kill the reporter Superman does interviews with. Superman decides to make an interview with Lois Lane putting her at risk of a villain killing her. This is because the \"I have a secret identity to protect those I love\" is always bullshit",
    "self_text": "",
    "subreddit": "shittymoviedetails",
    "selected_at": "2025-09-06T23:27:54.559886Z"
  },
  {
    "source": "posts",
    "id": 1018372,
    "title": "Say what you will about Die Hard, but it has the best ending for a Christmas movie…",
    "self_text": "Hans down.",
    "subreddit": "Jokes",
    "selected_at": "2025-09-06T23:35:13.878976Z"
  },
  {
    "source": "posts",
    "id": 848357,
    "title": "AITA for telling my easily nauseous wife that she can just drive herself?",
    "self_text": "My wife gets car sick easily, one time she even accidentally puked on some friends in the back seat on the way home one night but you get the picture. Well she noticed recently that when I am driving us everywhere(I use that word intentionally) that she feels better when I always have 2 hands on the wheel. I am not opposed to driving with both hands on the wheel but also my first car ever was an '89 Jeep Wrangler manual and I drove a manual all throughout college so I admit it's gonna take some behavior modification to fix. I drove us back from the lake this weekend 2 1/2 hours and I did try but old habits die hard and my wife was back seat driving the entire way home. I mean literally anytime I took my hands off from taking a drink or itching something it was \"two hands on the wheel\" 😑 So tonight I am driving us home from an awesome date night and 5 mins from home I'm making a turn when she harshly says two hands on the wheel. I said I was turning and started to get frustrated when she basically blamed me for feeling sick when I drive her. I say fine simple solution, we can drive separately or you can drive me. Problem Solved. Absolutely Not because she hates driving herself.  A huge argument that I feel is ridiculous. I don't mind driving all the time but who likes a back seat driver. And her solution is asking me how I would like to receive the criticism. I said I don't really think it's up to me to figure that out but if she must say something, be gentle, be cautious of your tone and what you say??? But in her head the way she is doing it is the only way to fix \"my problem\". I said well you can't figure out a way to address my driving in a way that doesn't make me feel attacked, then I can't drive you. And now just tears and it's somehow my fault. AITA?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:38:27.015179Z"
  },
  {
    "source": "posts",
    "id": 861250,
    "title": "What does a bush need to become a tree?",
    "self_text": "Stem cells",
    "subreddit": "dadjokes",
    "selected_at": "2025-09-06T23:50:24.631268Z"
  },
  {
    "source": "humorposts",
    "id": 498,
    "title": "The evilest song ever",
    "self_text": "It's a real son of a pitch",
    "subreddit": "badjokes",
    "selected_at": "2025-09-06T23:53:59.380601Z"
  },
  {
    "source": "humorposts",
    "id": 997,
    "title": "I tried to organise a hide and seek tournament...",
    "self_text": "Unfortunately, I failed...it is really hard to find good players....",
    "subreddit": "cleanjokes",
    "selected_at": "2025-09-07T00:27:17.311834Z"
  },
  {
    "source": "humorposts",
    "id": 257,
    "title": "I am outside an empty changing room thinking...",
    "self_text": "People don't change!",
    "subreddit": "cleanjokes",
    "selected_at": "2025-09-07T00:43:22.586673Z"
  },
  {
    "source": "humorposts",
    "id": 1199,
    "title": "Why did the chicken cross the road",
    "self_text": "to attend the funeral of another chicken who got killed doing the same",
    "subreddit": "AntiJokes",
    "selected_at": "2025-09-07T15:58:21.066452Z"
  },
  {
    "source": "posts",
    "id": 515695,
    "title": "I had to run for the bathroom and I barely made it.",
    "self_text": "It was my “crowning” achievement.",
    "subreddit": "Jokes",
    "selected_at": "2025-09-07T16:51:34.517068Z"
  },
  {
    "source": "humorposts",
    "id": 170,
    "title": "Why do programmers prefer coding in dark mode?",
    "self_text": "Because light attracts bugs.",
    "subreddit": "dadjokes",
    "selected_at": "2025-09-07T18:21:02.019337Z"
  },
  {
    "source": "posts",
    "id": 580083,
    "title": "Did you know browsers in some counties can sing?",
    "self_text": "I especially like Edge Iran",
    "subreddit": "dadjokes",
    "selected_at": "2025-09-07T18:22:50.434516Z"
  },
  {
    "source": "posts",
    "id": 750899,
    "title": "PSA - if your dog is anything like mine, don’t waste your money on the Yeti dog bowl",
    "self_text": "He doesn’t care that it keeps water cooler for longer or how expensive it is. The toilet bowl is still is preferred utensil for water consumption.",
    "subreddit": "dogs",
    "selected_at": "2025-09-07T21:21:48.092205Z"
  },
  {
    "source": "posts",
    "id": 907747,
    "title": "The FBI never fails...",
    "self_text": "The phone rings at the FBI headquarters:  - “Hello? I’m calling to report my neighbor, Clifford. He is hiding marijuana inside his firewood!”  - “Thank you very much for the call, sir.”  The next day, FBI agents descend on the neighbor’s house.  They search the shed where the firewood is kept.  Using axes, they bust open every piece of wood but find no marijuana.  They swear at the neighbors and leave.  The phone rings at the neighbor's house.  - \"Hey, Clifford, did the FBI come?”  - “Yep.”  - “Did they chop your firewood?”  - “Yep.”  - “Great, now it’s your turn to call.  - \"I need my garden plowed.”",
    "subreddit": "Jokes",
    "selected_at": "2025-09-07T22:09:21.163377Z"
  }
]