[
  {
    "source": "posts",
    "id": 533153,
    "title": "Willow",
    "self_text": "First time paying any attention to anyone in the Smith family, saw Willow as musical guest on SNL. First impression is that her voice is quite good. Agree, disagree and tell me more",
    "subreddit": "Music",
    "selected_at": "2025-09-06T23:35:45.055170Z"
  },
  {
    "source": "posts",
    "id": 531320,
    "title": "A Parallel Universe",
    "self_text": "Today I thought that I were in a parallel universe. A universe where a second chance for us was something to think about, where your disdain look on me vanished and you opened a place in your warm heart for me where I could live again.  A universe where I wake up every morning before you and watch you sleep like a baby, just like the old times. I wake you up with a kiss and spend the entire weekend together, and listen to your beautiful voice talking about your day on our long late calls at the middle of the week  A universe where we concretize all of our plans, where we vague through the world as we always talked about, with our hands together, where I see a smile on your face and be certain that I'm the cause of it, as you were the cause of mine.  But then the alarm starts ringing. I wish I didn't woke up.",
    "subreddit": "UnsentLetters",
    "selected_at": "2025-09-06T23:54:08.081704Z"
  },
  {
    "source": "posts",
    "id": 550814,
    "title": "I decided to download a chat-bot to help me cope with the death of my friend",
    "self_text": "But the thing that concerns me is how the bot knows all the details of his death.",
    "subreddit": "TwoSentenceHorror",
    "selected_at": "2025-09-07T00:10:36.380571Z"
  },
  {
    "source": "posts",
    "id": 261062,
    "title": "The year is 2100, and the Pioneer plaques were finally found by alien life.",
    "self_text": "We know this because we got a transmission roughly translated to \"we found you, slaves.\"",
    "subreddit": "TwoSentenceHorror",
    "selected_at": "2025-09-07T00:39:36.486113Z"
  },
  {
    "source": "posts",
    "id": 878235,
    "title": "[NOV22] Eight billion human lives sacrificed in the blink of an eye, a gift of tribute to our lord, Ra.",
    "self_text": "We shall sing his praises and convert new followers on the next planet we burn, knowing all along that Earth was just the first of many.",
    "subreddit": "TwoSentenceHorror",
    "selected_at": "2025-09-07T00:41:56.529484Z"
  },
  {
    "source": "posts",
    "id": 570124,
    "title": "The story stops as soon as I write",
    "self_text": "I have a huge issue and I'm hoping someone could help me. I've always been an imaginative person and I come up with stories all the time. However, the moment I start writing, whether that be planning or just trying to get a scene out, the story in my brain stops working. It's like someone turned off the television and I can no longer see the movie. And sometimes, it doesn't come back. And, if I AM able to get the scene out, it lost all of its magic and integrity that made it so wonderful. Details go missing, I stumble on major and minor plot moments, etc. It's so frustrating! I have two amazing stories I'm  excited to write about but I'm scared I'm going to lose them. I even tried dictating my stories but it does the same thing.   Help!",
    "subreddit": "writing",
    "selected_at": "2025-09-07T15:36:45.794759Z"
  },
  {
    "source": "posts",
    "id": 284996,
    "title": "I wait for the day's last question to appear on my terminal so I can answer it and leave the office.",
    "self_text": "\"How far underground are you?\"",
    "subreddit": "TwoSentenceHorror",
    "selected_at": "2025-09-07T15:51:54.506083Z"
  }
]