[
  {
    "source": "posts",
    "id": 920144,
    "title": "What are my exit opportunities in Tax Compliance? (U.K.)",
    "self_text": "Hi all,  I work for a top 10 firm in the tax compliance department. I have 1 year audit experience, and will have 2.5 years tax compliance experience once I am ACA qualified.   I’m not sure tax is where I want to stay after, but I’m not sure how limited my current role makes my exit opportunities so I’m looking for some general advice on post ACA jobs that I’d be able to go for, e.g management accountant, corporate finance etc.   Thank you.",
    "subreddit": "Accounting",
    "selected_at": "2025-09-06T23:08:32.136027Z"
  },
  {
    "source": "posts",
    "id": 289287,
    "title": "Creating a fitness dropshipping store. Too saturated? Or is there still room for a niche?",
    "self_text": "I know dropshipping from Aliexpress has a bad reputation, but I don't quite have a new or innovating piece of exercise equipment in my head.  What I can do is bundle a set of equipment (from multiple sellers on Aliexpress) that can be for beginners. Either for weight loss, bodybuilding/powerlifting, or Yoga. Specifically, my 20+ years of knowledge is in bodybuilding/powerlifting (some olympic weightlifting), but have enough knowledge to fill in the gaps of my knowledge for other areas of fitness too. I can put up some free beginner guides on my Shopify, and provide basic / beginner (or intermediate) exercise programs (for free or for a small price).  Any thoughts on if this will be enough to differentiate? Or do I have to approach this differently?",
    "subreddit": "smallbusiness",
    "selected_at": "2025-09-06T23:08:41.720943Z"
  },
  {
    "source": "posts",
    "id": 666819,
    "title": "Quick question or maybe some advice?",
    "self_text": "Hi everyone I need your advice on something.  I used to be a great web developer and designer with an amazing portfolio but, I got stuck into stocks and crypto which made me literally depressed and stressed and left my freelancing work behind. Now I've started again but I don't see the pace that I had before nor I'm getting clients also, been lazy a lot and procrastinating too. What things should I follow so I can be productive again?  P.S: Inspirational quotes on IG and youtube made me more dump than ever tbh.",
    "subreddit": "Entrepreneur",
    "selected_at": "2025-09-06T23:15:49.816476Z"
  },
  {
    "source": "posts",
    "id": 655704,
    "title": "I own a small tile business and sometimes me or the other owner have to purchase materials for a job. How do I account for and track getting reimbursed for the purchased materials?",
    "self_text": "For example, let's say I invoice a client $1,100. $1,000 for labor, $100 for materials (cost of materials + tax). I should only bear the tax burden for the $1,000 of labor, and I should be able to pass the $100 through to the client. So, on my invoice, I will simply label two separate lines: Labor and Materials. Then, when tax season comes along, I will only report the $1,000 as income, and I will simply treat the $100 as a reimbursement. As long as I have properly saved proof of this purchase being a material acquisition for said job, I should be good right? Am I missing something?  EDIT: I ask a simple question and people start shredding my personal decision to use software that works for me and apparently doesn't work for them. I wasn't asking for software advice, and no one has shared anything about quickbooks that I didn't already know. Thank you to the couple of people who stayed on topic.",
    "subreddit": "smallbusiness",
    "selected_at": "2025-09-06T23:23:13.663891Z"
  },
  {
    "source": "posts",
    "id": 407709,
    "title": "Considering selling house after ~1.5 years and looking for advice",
    "self_text": "Looking for advice on whether it makes sense to sell our house after ~1.5 years  TL;DR: bought an expensive house 1.5 years ago; want to refocus life and finances towards some sort of FIRE or early retirement in 3-5 years after experiencing huge career changes that altered my general happiness and outlook; looking for advice on whether this plan makes any sense.  -–  My wife and I bought a house in early 2021. At the time, I was in a role I really enjoyed with a great (and very stable) income. I had some equity in the company I worked at that was worth a decent chunk of change in theory. We decided to splurge and got a nice house on the outskirts of the city for about $1.1M. It’s bigger and nicer than we needed, but it made sense at the time, and we could afford it. The appeal was having a home gym, game room, guest room, etc. That’s what we ended up getting and it is indeed great. The total carrying cost of the house is about $6500/month. We got it at just under 3% interest.  A lot has changed since then, and I’m not actually referring to the macro-economic environment. The company I was at ended up getting acquired literally a few months after we bought the house, whereas I (naively) thought we were years away from that event. The equity I had immediately got transformed into cash – not as much as I was expecting, but still a nice payday. The two founders retired and I got a major promotion up into executive leadership. Shepherding the integration of the company has in many ways fallen on my shoulders, a task that has weighed me down in ways that will take me a long time to recover from.  I’m not happy in my new role under the parent organization, yet I can’t walk away because I have some golden handcuffs and it’s once-in-a-lifetime experience. I’ve done this role over a year now, and I’m tired and burnt out and want a break after the golden handcuff period is up (3 more years). I find myself having a very different mindset on finances. 2 years ago, I felt like I had 10-20 years of working runway left in me. Now I find myself wanting to optimize towards either early retirement in the next 3-5 years or at least getting to a point where I can take a substantial multi-year break. The problem is this plan is not compatible with the house we have and its $6500/month carrying cost. The payout I’m going to get from the “golden handcuffs” is substantial, but not enough to retire early with that kind of monthly housing expense.  I’d be more than happy downsizing to something smaller and less nice if it meant I could get out of the grind in a few years. My wife has seen the effect this has all had on me and is very sympathetic and supportive too. We’ve looked around and have sound some modest 2br apartments or 3br townhomes that we could rent for $2k-$3k/month – less than half of the $6500/month we’re currently spending. Plus, of course, we wouldn’t be on the hook for maintaining a large high-end home.  Now this is where the macro environment comes in. Interest rates are now ~7%. In theory, our home has appreciated a good bit since we bought it (its current Zestimate is $1.45M, and Reddit says $1.35M). However, my sober assessment is it wouldn’t sell for anywhere near $1.45M at current interest rates. An exact replica of our house which is 5 years older did sell 1 month ago for $1.295M.  I’ve contacted a realtor and asked them to get me a realistic market analysis. They think the house would sell for $1.2M-1.25M based on other comps actively on the market right now. If that’s true, it’s enough to sell the house with either no loss or a pretty minor loss. But let’s say there’s be a minor loss involved.  What I’m looking for is advice on whether any of this makes sense. Does it actually make sense to give up a 3% mortgage on this house to rent something much cheaper, even if we take a loss in doing so? Does this plan seem to support the goal of reaching some kind of early retirement state in 3-5 years?  There are alternative options:  •\tOne alternate would be to do nothing – stick around in the house for 3-5 years, then sell and downsize at that point into something that I could sustain in early retirement. The risk here is that the housing market could enter a major slump or even crash in that time period. Even if it stagnates and the house merely maintains its value, that’s a long time to pay $6500/month vs less than half that (even if some of that is going towards principal) considering we could invest the difference to help fund early retirement after that period. •\tAnother alternative would be to rent the house out. I’m unsure if we’d be able to make an expensive high-end home cashflow by renting it, though. •\tA third alternative would be to sell and buy again, but this time buy in the $300k-$400k range. However, it’s unclear if this makes sense at today’s high interest rates.   -–  TL;DR: bought an expensive house 1.5 years ago; want to refocus life and finances towards some sort of FIRE or early retirement in 3-5 years after experiencing huge career changes that altered my general happiness and outlook; looking for advice on whether this plan makes any sense.  Thanks in advance!",
    "subreddit": "RealEstate",
    "selected_at": "2025-09-06T23:23:54.780130Z"
  },
  {
    "source": "posts",
    "id": 432429,
    "title": "Rent to own",
    "self_text": "I’ll give a brief explanation of the deal I’m looking at. Open to questions and any opinions on the topic.   I am m(32) married with four kids renting a home in NH for 1600 plus utilities. Our lease is coming to an end and have option to sign another for the same amount. We have about i make about 40000 + around 3000 in bonus’s each year. We started a small food truck business that does about the same this year but is growing quickly. 1/2 to 2/3 of our business is cash. We have very little debt mainly credit card (4000) which we are actively paying off. At this point we don’t show a ton of income and there isn’t really a hope in the next 5 years to get a mortgage. But we recently came across a rent to own situation. A man that I met at the lumber yard I work at offered it to us. Right now the deal stays at: we rent from him for two years @ 1500/mo everything included. And he is going to foot the bill to do some upgrades while we are there. He had it on the market but banks wouldn’t finance it because there are some things that need to be finished. Mainly a section of floor/stairs that is painted plywood. The bones of the house are good and he doesn’t have a mortgage he built it himself him being in the trades. 2 acres of land 3 bedroom 2 bath, 3 car garage, tool shed and wood stove. He wants 400,000 for it which is a little steep for us. But we would avoid banks and have if to change our business model from a cash business. After the two years rental we would renegotiate our contract from rental to rent to own. Because he is fully responsible for utilities he wasn’t willing to put a portion of our rent towards paying down the price of house which I think is fair until after the two years. Thank you for taking the time to read this all input is welcome.",
    "subreddit": "RealEstate",
    "selected_at": "2025-09-06T23:25:12.927849Z"
  },
  {
    "source": "posts",
    "id": 441637,
    "title": "Basic rate tax payer ISA vs SIPP query?",
    "self_text": "Hi folks this is likely going to have a basic answer but when googling some differences are outlined and the summary always seems to be \"just get both\".  My specific query is as someone who's basic rate and will likely be until retirement..  So as I understand it the ISA isn't taxed on withdrawal, the sipp is in the same way as usual taxable income. So let's say state pension + workplace pension is already putting you into the taxable bracket, the SIPP is going to get taxed on withdrawal at 20% (bar 25% lump sum if that's decided).  In this case what is the advantage of the SIPP over the ISA? You get the tax relief but will get taxed later. Is it because the tax relief going in will allow your fund to grow larger than the same contribution into an ISA? So getting taxed on the way out is worth it?  Just trying to understand my options after filling up my LISA allowance.",
    "subreddit": "UKPersonalFinance",
    "selected_at": "2025-09-06T23:37:36.113229Z"
  },
  {
    "source": "posts",
    "id": 557416,
    "title": "What is the best way to raise funds when you are not in the US or Europe?",
    "self_text": "To be clear, I do have a job. Two, actually. It just happens that my salaries are not enough to pay for a surgery at my country and my mother needs one, urgently.  With no family and my mother unable to work it is impossible for me to help her and that is why I decided to create a campaign, but it isn’t working at all and l've been told so many things that I don't even know how to make things right anymore.",
    "subreddit": "ask",
    "selected_at": "2025-09-06T23:39:03.774501Z"
  },
  {
    "source": "posts",
    "id": 739474,
    "title": "Pay question",
    "self_text": "Just completed my first dash today 🎉 I got 7 in 3 hours but my app was being glitchy, but I was wondering when does the money process through?? My bank already is approved and such but I just was curious 🤷",
    "subreddit": "doordash_drivers",
    "selected_at": "2025-09-06T23:39:08.236479Z"
  },
  {
    "source": "posts",
    "id": 881633,
    "title": "Career opportunities as an accountant in an Investment bank",
    "self_text": "Graduated recently and first job I got is to work as a junior accountant in an investment bank. Any ideas what opportunities would be open for me? I've always been interested in works related to financial analysis but I'm not sure if staying here would help me gain the skills required for that. But any idea what can other expectations i can have from my current kind of job?",
    "subreddit": "Accounting",
    "selected_at": "2025-09-06T23:40:18.351718Z"
  },
  {
    "source": "posts",
    "id": 600731,
    "title": "GameStop wallet secret phrase is associated with multiple accounts?",
    "self_text": "I’m trying to transfer my wallet to a new computer and after entering my secret phrase, it asked me which accounts to import. It came up with something like 2000+ accounts, all with zero balance. Has anyone else encountered this?  GME 🌎 🚀 🚀 🌚 🌝   Buy hold DRS  Buy hold DRS  Buy hold DRS  Buy hold DRS  Buy hold DRS  Buy hold DRS",
    "subreddit": "Superstonk",
    "selected_at": "2025-09-06T23:49:16.673505Z"
  },
  {
    "source": "posts",
    "id": 313271,
    "title": "AITA for wanting to know what my husband spends when he asked to double his allowance?",
    "self_text": "When my husband and I got married we merged finances, so that his paycheck gets deposited into our joint account and about 60% of mine goes into the same account. The other 40% of mine goes into an account that pays the mortgage and is used to make our monthly contributions to our brokerage account.  The reason we have it set up that way is I bought my apartment right when we started dating, and so I pay for it all with my earnings out of an account where I get a discount on the mortgage rate, and that’s why part of my paycheck is directly deposited into it.  When we got married my husband didn’t want to transition to joint credit cards, so we each have our own cards, and his is paid from his checking account and mine are paid from the joint account. All of our bills are paid from the joint account or via my credit cards, which are paid from the joint account. Since all of our bills (car, apartment maintenance, garage, utilities, cleaning person, etc.) and pretty much all of our joint meals, groceries, travel, discretionary spending, etc. are all paid from the joint account or on my credit cards, what I’ve been doing is transferring a set amount to his checking account every month, which was an amount he said would be enough for his expenses.  I just checked his checking account though, and his credit card bills are more than the amount of the allowance I deposit every month. I asked him if he needs more, and he told me that he needs double what he is currently getting. He has access to our joint account and can use it for any spending or to take cash out at any time. I think if he wants to double the amount of spending money he’s getting it would be nice to know what he is spending it on.   AITA for wanting to know how much he is spending and on what? (I doubled the monthly transfer amount already, so it’s more a matter of curiosity, not a condition of him getting more).",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:55:41.911755Z"
  },
  {
    "source": "posts",
    "id": 619336,
    "title": "Journal Entry help",
    "self_text": "Hello!  I'm trying to understand an \"equity\" account and what will happen at the end.  Here's my hypothetical situation: A vehicle (personal sedan) is GIFTED to a business (lets say a corporation), for whatever reason. As I understand, the journal entry for this would be something like:  DR Vehicle (asset) CR Capital Account (equity)  As I own and use the vehicle, I will depreciate the depreciable asset: DR Depreciation Expense (expense) CR Accumulated Depreciation (contra-asset account)  Finally, when I either sell or dispose of the vehicle: DR Cash (asset) DR Accumulated depreciation DR or CR Gain/loss on disposal CR Vehicle (asset)  My question is: what will/should happen to that \"CR Capital Account (equity)\" that I created when I first received the vehicle? Will it ever go away? Does it need to be reduced at some point? What's the journal entry to remove/reduce it?  A bit of a hypothetical, so please just entertain the scenario.",
    "subreddit": "Accounting",
    "selected_at": "2025-09-06T23:58:12.789223Z"
  },
  {
    "source": "posts",
    "id": 727608,
    "title": "The one thing that pissed me off the most, from a first time home buyer",
    "self_text": "Closed on a house yesterday, first time purchasing/investing in real estate.  I've wanted to for years but never found the right deal or had the cash at the time to make a move.  Everything went smoothly, I really got a verryyy decent deal in today's market, got almost $11k in closing costs from seller because the inspection had about $4k in  very tiny  jobs.  Think \"$100 to change this lightbulb, $200 to fix this leaky sink\" shit like that that I will be taking on.  Shout-out to my realtor and mortgage broker.  I'm closing in like 18 days from going under contract, broker did an absolutely amazing job getting me everything I needed ASAP and passing off to underwriters.   Realtor did a great job negotiating on my behalf.  So, what pissed me off?  Fucking $15 fee to get a cashier's check.   It took all but 8 minutes at the bank.  I have to pay $15 to access  my  money, that the bank has been making $$$ off while it's been sitting in my account.  I'm frugal, not cheap, but definitely very frugal, and that just absolutely pissed me off.  I pleaded with the bank to waive the fee, but no luck.  All said and done $15 is nothing when you're spending a down payment on a house, just the idea of it really rubbed me the wrong way.  Super excited, long time lurker of this sub, have learned a ton doing a bunch of searches and reading advice.   Cheers for everybody who contributes.   I'm gonna go sit in my empty house and have a beer now before spending all weekend moving in ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
    "subreddit": "RealEstate",
    "selected_at": "2025-09-06T23:58:58.126574Z"
  },
  {
    "source": "posts",
    "id": 746759,
    "title": "Namshi cashback",
    "self_text": "Hi,  I'm seeing this offer of 100% cashback on Namshi. Has anyone tried using this offer? Is it legit? Anything i should know before using it?  Thank you!",
    "subreddit": "dubai",
    "selected_at": "2025-09-07T00:07:01.339031Z"
  },
  {
    "source": "posts",
    "id": 590700,
    "title": "Some info on Caroline Ellison and SBF I found online (take it with a grain of salt )",
    "self_text": "SEC Chair Gary Gensler’s old boss at MIT was Glenn Ellison. His daughter Caroline Ellison is the CEO of FTX sister-company Alameda Research (and Sam Bankman-Fried’s lover apparently). The GC of FTX used to be lead counsel to Gary Gensler when he was CFTC Chair. Sam Bankman-Fried’s mother was Hilary Clinton’s lawyer. Gabe Bankman-Fried, brother to Sam (also a former Jane Street trader), is founder of “Guarding Against Pandemics”. He was a Legislative Correspondent for the US House of Representatives and an advisor to large political donors in the Democrat party. The family Aunt Linda Fried is a WEF member on the Global Agenda Council on Aging. The father, Joseph Bankman, is a Stanford professor who has lobbied on behalf of Hedge Fund managers before Congress before (film records exist). FTX Head of Ventures & Commercial at FTX Ventures, Amy Wu, started with the Clinton Foundation years ago. Nishad Singh FTX Director of Engineering has spent over 8 million for Dem candidates. Obama's Commodity Futures Trading Commissioner, Mark Wetjen, was the head of FTX Policy & Regulation. Chief regulatory officer of FTX is Dan Friedberg was previously a lawyer at Ultimate bet (a site where they basically cheated against players). Stuart Hoegner General Counselor at Bitfinex/Tether was previously Director of Compliance at Excapsa which was responsible for the Ultimate bet poker software.",
    "subreddit": "wallstreetbets",
    "selected_at": "2025-09-07T00:07:18.015886Z"
  },
  {
    "source": "posts",
    "id": 658228,
    "title": "Greedy when others are fearful or just plain stupid?",
    "self_text": "So we just had FTX go bankrupt, that seemingly didn't affect anything outside of the crypto market, but now we have block fi going bankrupt as well.  If that weren't enough threats of war have broken out today around 10 am pst. Now there's a potential nato meeting in the works. Who knows where that's leading to.   As selfish as this sounds to be worrying about this when others have much bigger problems, where does this leave us? The market completely stopped dead in its tracks after a morning bull run across the board and started retracting after this news.   For the guys with calls are you cutting them off tomorrow until further news breaks out? The guys with puts are you excited at the prospect of a crash?   What's the concensus, are you personally feeling greedy or fearful ?",
    "subreddit": "wallstreetbets",
    "selected_at": "2025-09-07T00:07:19.677922Z"
  },
  {
    "source": "posts",
    "id": 571945,
    "title": "Overpayments of mortgage or open a new savings account?",
    "self_text": "Just looking for some advice really as I'm not very knowledgeable when it comes to this sort of thing.  My wife (30F) and I (32M) bought our first house in May this year, and after Christmas we will hopefully be in a position where we can start making overpayments to the mortgage as all the big jobs in the house will be complete.  We're currently on a 30 year mortgage, with a loan amount of £207,000 at 1.89% fixed over 3 years. Our monthly repayments are £677.34/month, and we think we could still manage fine if we upped it to £800/month which is about an 18% overpayment.   Aside from paying the mortgage off early are there any other benefits to doing this, or would we be better off opening some kind of savings account to gain interest on that money instead? I've seen one with Halifax offering 3.4%.",
    "subreddit": "UKPersonalFinance",
    "selected_at": "2025-09-07T00:07:53.383426Z"
  },
  {
    "source": "posts",
    "id": 492273,
    "title": "I can't seem to file for short form-ca LLC? I am in California.",
    "self_text": "I filed for my LLC earlier this year, and I am looking to dissolve my LLC to start another business venture. Also, I need to request access. They are asking for a PIN, and I don't know if I ever created a PIN with bizfile. I asked to request a PIN, but I believe they would be mailing the pain number to my address. I am just really confused here.",
    "subreddit": "smallbusiness",
    "selected_at": "2025-09-07T00:09:31.342708Z"
  },
  {
    "source": "posts",
    "id": 542354,
    "title": "Need a car at the worst possible time.",
    "self_text": "Currently living in Rural NH where work is ~45 mins away on the highway. I've been driving around a beater for years now waiting for it to poop the bed. I've wanted a new car, but have been waiting as my girlfriend is currently interviewing for medical school, and I plan to follow her. We are not yet sure where she will be going. So far she is actively interviewing at large cities (where I dont want a car) and got into a rural area in colorado (where I do). She will know exactly where she will be going in March/April.  So fast forward to last Wednesday, I hit a deer on the freeway and total my car. So now Im in a weird situation where I don't want to commit to a car Im unsure if I will need in 9 months, but also need a car within the next month or so. Whats the most reasonable option both financially and practically?  Financially I'm not strained (within reason). I've been preping or this moment and have $20k in cash ready to deploy as needed. Short term leases look appealing, but sound expensive  EDIT: Photo for reference:https://imgur.com/a/WMoBTVN  &#x200B;",
    "subreddit": "personalfinance",
    "selected_at": "2025-09-07T00:10:13.674184Z"
  },
  {
    "source": "posts",
    "id": 346987,
    "title": "Desperate for promotion?",
    "self_text": "I'm currently working as a remote employee and I have ambitious goals. At this point, I'd like to move from an individual contributor to a managerial role. I talked to my manager about it and they said \"just be good at your current role\", and \"we will check\" to see how we can move you up a couple of months ago. Not sure how many times I've heard this in the past, only to be ultimately left hanging. Not saying that I will have the same outcomes as my previous managers who told me the exact same thing, but probably I have a tough time trusting these lines anymore without any immediate action/progress to my goals.  Now I'm thinking to message one of the company's exec who appears to be approachable (I've exchanged some emails with them when I was completing a project), to see their perspective as they have more influence. For context, the exec is 2-3 lines higher than my manager. Maybe somewhere along the lines of - to ask if they offer a \"leadership rotational program\" or plan to offer one in the future, or an internship to an open role where I can move up to a role with more influence. Will it do bad more than good for me in this scenario? Any peeps who had done the same and had quite some success rate?",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T00:13:51.259539Z"
  },
  {
    "source": "posts",
    "id": 1041169,
    "title": "Chase Freedom unlimited - my one-for-everything?",
    "self_text": "Current cards: Amazon rewards (NOT prime); an old BoA card that gives $25/quarter    FICO Score: 770s    Oldest account age: 13y    Income: Call it $85-95k    Purpose of card: one-for-everything card. Ok to use several but almost all of my CC spending goes into \"other\" or \"restaurant\" or \"grocery\".     My biggest spending categories- restaurants, \"other\". Coffee is my big hobby and I buy lots of random coffee shit.     Little spent on Travel, Amazon.    Zero spent Gas, drug stores.     Prefer no annual fee, don't think I spend enough to justify that.   I'm thinking freedom unlimited may be the best card due to 3% at restaurants, 1.5% for all other purchases. I have just been using the Amazon card for nearly everything, which is clearly worse.  But I wonder if there are better options because I see folks saying freedom unlimited is only best for use with sapphire.",
    "subreddit": "CreditCards",
    "selected_at": "2025-09-07T00:15:44.778754Z"
  },
  {
    "source": "posts",
    "id": 876064,
    "title": "My dad’s friend wants to sell his house to my dad for £300k below market value. Is this allowed?",
    "self_text": "For context, my dad’s friend recently sold his home for 1.5 million. He then bought a house for £650k, and basically instantly regretted the purchase. He’s discovered parts of the home that he just hates. It is maybe relevant that this person is 92 years old, but very much “with it”. My dad is 79.   The friend is now on the hunt for another house to purchase, but potentially willing to sell the home to my dad for $350k. I just wondered if that would even be legal. Essentially this person would be gifting my dad £300k I suppose. Any thoughts or insights would be much appreciated.",
    "subreddit": "UKPersonalFinance",
    "selected_at": "2025-09-07T00:24:42.341117Z"
  },
  {
    "source": "posts",
    "id": 673761,
    "title": "This is how Titans win. Building in the bear 🚀🚀🚀",
    "self_text": "SteadyStack have been working hard to build a better NFT trading experience. That's why they've partnered with AlphaSharksNFT, the premier choice for NFT traders.    You'll now have access to AlphaSharksNFT's V2 NFT analytics tool, which makes it easier than ever to spot trends and pick stocks that are on the rise. This is an especially exciting addition because the Sharks provide exceptional utility, including:    Better NFT trading experience with everything you need in one place    An orderbook from major marketplaces including Sudoswap and Blur10x faster sweeps than Gem/Blur    Top tier charting system    Realtime data aggregation    This is how Titans win. Building in the bear 🚀🚀🚀    In  the midst of the dip, it's a very good idea to stack up more Titans.   Sustainable and steady growth is something you find with    SteadyStack!🚀🔥    https://twitter(.)com/SteadyStackNFT   r/steadystack    Remove () to access links!",
    "subreddit": "cryptostreetbets",
    "selected_at": "2025-09-07T00:29:50.517622Z"
  },
  {
    "source": "posts",
    "id": 806666,
    "title": "401k plan options my company offers",
    "self_text": "Hey all. I had a question on my 401k options to invest into. I had 100% of my 401k going into my 2065 retirement fund. But I wanted to change this and put it into something like SPY or VOO something like that.   I went to my broker that my company uses for my 401k and noticed they don’t offer SPY or VOO or VTI. The only options that they offer for Large U.S. Equity stocks are AULDX, DODGX, and VINIX. Out of these three, which would you recommend I invest into? I have never even heard of these and kind of annoyed at the fact VOO isn’t an option. Thank you in advance.",
    "subreddit": "personalfinance",
    "selected_at": "2025-09-07T00:34:53.579681Z"
  },
  {
    "source": "posts",
    "id": 486247,
    "title": "Where to learn about banking",
    "self_text": "Where to learn banking like how to's ?  Like transferring money net banking and stuff",
    "subreddit": "personalfinance",
    "selected_at": "2025-09-07T00:39:15.883442Z"
  },
  {
    "source": "posts",
    "id": 596677,
    "title": "looking for advice on putting money into LISA for buying a house",
    "self_text": "I opened a life time ISA with moneybox mid this year with a £1 deposit. I'm hoping to start looking for a house mid-late next year depending on house prices/interest rates. I have 5k in a 5% saver 1.5k in a 5% current and around 5k in a 2%. I don't think I'll want to use the Lisa for retirement so I've been reluctant to put anything in there in case I don't use it to buy my first home. Interest in moneybox is now 3.3% + the bonus so I'm not sure if I should move 4k from the 2% to the Lisa now... What are people's experiences using funds in a LISA to buy their home? Would having savings for a deposit split between different accounts make things more difficult or not make much of a difference?",
    "subreddit": "UKPersonalFinance",
    "selected_at": "2025-09-07T00:41:42.449499Z"
  },
  {
    "source": "posts",
    "id": 363927,
    "title": "Should I take out a 401k loan to payoff credit cards?",
    "self_text": "Just what the title says.  Is it smart to use a 401k loan to pay off my credit card debt?  I have about $100k in 401k and owe about $25k in credit cards.  I am paying down the cards by putting all extra money to them,  but I’m thinking of doing a one time loan to knock them out.  The only downside I see is I can’t pay my 401k aggressively.  In other words,  I can’t pay them extra each paycheck like I do to the credit cards.  Any advice?  And does it matter what the market is doing right now?",
    "subreddit": "personalfinance",
    "selected_at": "2025-09-07T00:44:26.806267Z"
  },
  {
    "source": "posts",
    "id": 710099,
    "title": "This guy is trying to make me pay him back",
    "self_text": "I was a small streamer, and started struggling. This guy was a viewer of mine and he started sending me lunch money and things like that to eat and helped me move in. He said “you won’t need to pay this back” and after a while since I haven’t talked to him he wont leave me alone. He keeps sending me invoices from PayPal saying his financial advisor said he needs to get his money back and that “it’s the real world you need to pay me back” but there was never ANY written or agreement on paying back and is sending invoices through PayPal and if it’s late I have to pay $30 is he allowed to take any legal action if I say no? He literally lives across the United States and idk what to do. He kept a whole entire spreadsheet of everything I “owe” him. Idk what to do I don’t have enough to pay him back",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-07T00:44:29.656172Z"
  },
  {
    "source": "posts",
    "id": 365138,
    "title": "can i make up any amount on annual net income when applying for amazon store card to get approved?",
    "self_text": "Im not working rn but would like to get the Amazon store card to get access to the 0% apr and of course that 40 bucks amazon credit. I clicked on check now to see if i can qualify i put in 1k annually and got rejected, now im wondering if its safe to put any numbers just to get approved like 40k or 50k.",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T00:45:39.200446Z"
  },
  {
    "source": "posts",
    "id": 422915,
    "title": "Rideshare vs food delivery earnings",
    "self_text": "I’m in a decent sized market average city market I would say (Pittsburgh).  I’ve always done food delivery, but wondering if rideshare is better or worse for earnings.  I mainly drive the dinner shift, which I would thing pays the most.   Curious how everyone’s earnings are doing rideshare if you are in a similar city type area.  If you want to make good money doing rideshare, what are the best hours to work?",
    "subreddit": "uberdrivers",
    "selected_at": "2025-09-07T14:01:48.624795Z"
  },
  {
    "source": "posts",
    "id": 658379,
    "title": "How does tax work if I am a university student on placement",
    "self_text": "Hello so I am a university student who is on a year long placement. I started in June and I get paid 19,000 for the year. I get taxed around £200 (income and NI tax) , I know I am entitled to £12,570 tax free income so this means the remaining  £6430 gets taxed.  My question is : How does this work? I have been getting taxed since I started so shouldn't I be getting my monthly pay checks tax free until 8 months into my job as this is when I pass the 12570 tax free income threshold?  Am I able to call up HMRC and get this tax money and change it to where I get taxed once I pass the  tax free income threshold or do I have to call them up at the end of the tac year?",
    "subreddit": "UKPersonalFinance",
    "selected_at": "2025-09-07T15:33:01.815851Z"
  },
  {
    "source": "posts",
    "id": 849242,
    "title": "If any of you could have/have a personal assistant, what do you typically have them do for you that makes your life easier?",
    "self_text": "So things have gotten pretty busy in my life: I run an educational nonprofit (where I have to make video content for my students - very, very much like running a small business), work a day job as a senior software engineer, and am interested in starting a venture on the side next year with some 3D modeling stuff. Managing all of it has become such a hassle that I've been recommended several times to get a personal assistant. But while I know one would be game-changing for me, I'm kind of at a loss for what I could even ask them to do (I suuuuuck at delegating tasks, but I'm trying to learn).  As a business owner (or just generally super busy person) what tasks would you have a personal assistant handle for you? I hear there are personal assistants that can even copywrite or video edit too, but I'm trying to remember that I may not be able to find someone that can do it all.  I'm asking this questions in a few subreddits related to the tasks that I have in the hopes of coming up with a comprehensive list so I can pick and choose whats most important to me, and settle on a list of tasks to assign them when I do find a good one.  If you guys have an ideas for what they could do, it'd be super helpful!",
    "subreddit": "smallbusiness",
    "selected_at": "2025-09-07T15:34:51.095812Z"
  },
  {
    "source": "posts",
    "id": 868814,
    "title": "How is it legal to charge a cancelation fee that totals the rest of the yearly subscription?",
    "self_text": "I was made to purchase an Adobe creative cloud subscription for some of my classes this semester. I ended up never using the adobe programs and am looking to cancel the year long subscription I had to buy. I have been making monthly payments and now that I'm trying to cancel, Adobe is trying to charge me what would be the rest of the years monthly payments, as an \"early cancellation fee\" how is this legal and how can I get out of it? I am a college student and those $90 dollars could be used elsewhere much more important.",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-07T15:35:34.847742Z"
  },
  {
    "source": "posts",
    "id": 1045926,
    "title": "What Would You Pay For A Hoodie Or T-Shirt?",
    "self_text": "I've been debating starting a website or business that sells anime-related hoodies or t-shirts and I would sell the hoodies for about $40-$50 with free shipping of course and t-shirts I would probably sell for anywhere between $20-$30 but I'm not quite set on the pricing yet. In your honest opinion, what would you pay for a hoodie or t-shirt with a design of your liking?",
    "subreddit": "Entrepreneur",
    "selected_at": "2025-09-07T15:39:59.893768Z"
  },
  {
    "source": "posts",
    "id": 656941,
    "title": "Are there any alternatives to buying a health insurance plan on the marketplace if you don't get coverage through your employer? (USA)",
    "self_text": "My state marketplace only offers a handful of options which are all very pricy \"gold\" or better plans that I don't need. I don't want to skip out on insurance just in case something horrible happens, but the premiums are so expensive. Is there some other way to get coverage?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T15:42:54.334867Z"
  },
  {
    "source": "posts",
    "id": 1040514,
    "title": "Does anyone trade with leverage here?",
    "self_text": "I'm a guy who likes taking risks, and firmly believes in high risk high return (so basically a gambler). And whenever I trade leverage I feel scared and exited at the same time. The moment I enter a position and watch the chart draw out its graph I'm at an immense state of nervousness. As the price fluctuates I feel like my heart beat also fluctuates. Mind you, I only trade with 25x or above, no pussy scaredy cat trading. Everytime I see that +50% profit after entering a position for 10 minutes, I feel like passing out due to overwhelming joy. Even A 1% price change to me is like having an insane bull run, or a bear run. The more trades I do I sense myself getting number to profits and losses. Do I need to stop? Should I stay away from crypto at this point? I've only lost 2 grand so far but I'm scared I might lose more",
    "subreddit": "CryptoCurrency",
    "selected_at": "2025-09-07T16:14:16.561614Z"
  },
  {
    "source": "posts",
    "id": 803862,
    "title": "$AMZN, good trade and bade trade, but still in profit.",
    "self_text": "$AMZN  The stock opened with a small gap down, my first idea was to take the stock from a resistance level created in the last few days at $94 together with the descending trend line with a target at $92.3.  The trade was unsuccessful, and the stock took me out with a stop after twenty seconds of my entry.  I knew it was not the right timing and my idea was still valid so I continued to follow the stock, after a few minutes the stock stopped at the $95 resistance level and continued to fall to $94, broke the level, and consolidated below it, I entered orders:  Entry: $94  Stop loss - $94.37  Take Profit Point - $93.27 (2:1 RRR) I identified a level after the losing trade from the pre-market and that is why $92.3 was not the take profit point.  https://preview.redd.it/s6f1tordtb1a1.png?width=2205&format=png&auto=webp&s=3ad2061c734b94ba59f2a124bdba6698025d97b8  https://preview.redd.it/nexkrordtb1a1.png?width=2205&format=png&auto=webp&s=9f52b13f52b0fb8b6b14e5916ac99fc6febd674a",
    "subreddit": "wallstreetbets",
    "selected_at": "2025-09-07T16:49:21.282963Z"
  },
  {
    "source": "posts",
    "id": 431490,
    "title": "My plays for the week.",
    "self_text": "Puts on AMC, despite its current stock price, amc in my opinion is an overvalued shit company that is headed to 1 dollar. That being said wallstreet will probably pump the stock upon earnings. Fear not, my puts expire mid December and I predict the company will fall to 4 dollars by that point.   Calls on LYFT then puts, my thinking here is that uber did well on earnings. I think the stock will spike and then slowly fall later on.   Calls on DO, do is a small oil company. Oxy earnings, plus midterms will probably make oil go up.   Puts or Calls on RBLX, haven't really decided here but im leaning towards puts.   Im overall down 50% for the year, so don't mistake my regarded investment ideas for good advice. Goodluck lads.",
    "subreddit": "wallstreetbets",
    "selected_at": "2025-09-07T18:17:47.035382Z"
  },
  {
    "source": "posts",
    "id": 837362,
    "title": "Thinking about accepting a lower maternity cover position after being laid off. Will that mess up my future earnings based on lowering my pay?",
    "self_text": "So I was recently laid off from an executive position at my company. I’ll be able to receive my current salary through most of Jan WARN act) and I’m going to get some severance which is great. My spouse  also works and if we cut our expenses some we can probably cover our family expenses through summer before needing to dip into our emergency fund (if no additional emergencies arise).   I have a really great opportunity come up in a similar niche industry for a maternity cover position but it’s for a position lower than my current position and the company is known for paying less than my previous employer. I like the idea of a temp position because I feel very competent I can do the position and I’ve been working 15 years in an industry with grueling hours and a bit of break with an option to be hired on if a full time position becomes available sounds like a nice less stressful option. Should I take this lower position and salary instead of holding out for a better opportunity for potentially more money? If an opportunity does open up at this new company I think I will have lowered the rate I could negotiate which would suck. I’ve made it a point to try to negotiate every job I’ve ever had and for the most part have been able to get more money and I feel like I’m going to lose that pay history and leverage by taking this new temp job. The new environment sounds less stressful and the team sounds great but I hate the idea of lowering my pay history which I’ve worked really hard to establish. Thoughts?",
    "subreddit": "personalfinance",
    "selected_at": "2025-09-07T18:23:29.324118Z"
  },
  {
    "source": "posts",
    "id": 434855,
    "title": "Is it better do buy USDT on Binance and send it to KuCoin since the prices aren't the same?",
    "self_text": "Hey guys, I'm new to this Cryptoworld so I need some help to decide exactly what to do. I recently opened an account at Kucoin exchange but they are charging me 5.23 BRL for each USDT on my current quotation, but when I search the USDT/BRL on Binance it's 5.09. Is it right? Because that's a lot of money for me since it's like I'm giving up of a USDT every 250BRL I deposit. If yes, that means it's worth it to do arbitrage between those exchanges?  Am I being dumb and not reading the right prices? Lol  &#x200B;  TYIA, I appreciate you help",
    "subreddit": "CryptoCurrency",
    "selected_at": "2025-09-07T18:23:41.649900Z"
  },
  {
    "source": "posts",
    "id": 960892,
    "title": "Security deposit",
    "self_text": "I moved into my apartment in July of this year and signed a year long lease. I put down two months worth of security ($2,400). However, shortly into my new lease I found out that I FINALLY got accepted into public housing (after years of waiting) I gave my landlord 2 months of notice that I would be leaving.  My landlord is threatening to keep all of my security deposit. Is this legal?  There has been no damage to the apartment and I’m having it cleaned before moving.   Thanks for the input!",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-07T18:29:48.412643Z"
  }
]