[
  {
    "source": "posts",
    "id": 1032570,
    "title": "Frying Fish",
    "self_text": "Hi Everyone! I just bought a stainless steel skillet and everytime I use it something is always getting stuck on it :( specifically when it’s time to fry something.   I wait until the pan is hot, splash water on it to make sure the water bounces instead of fizzles, add my oil, and then the fish - but when I try to turn the fish the bottom of the fish sticks to the pan. (The temp is on 5 and it begins to fry btw).  What on earth am I doing wrong? :(",
    "subreddit": "Cooking",
    "selected_at": "2025-09-06T23:23:19.784838Z"
  },
  {
    "source": "posts",
    "id": 301621,
    "title": "I'm a part time scientist and have no idea how to cook and I started blog of clueless experimental cooking.",
    "self_text": "I min maxed all my points into academia and video games.  When my Gran passed away, I had to learn how to cook, but I don't have a clue, just the scientific method, lets see how the clueless experiments turn out:  https://www.youtube.com/watch?v=q0Dij8DGDjI",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T00:35:26.091511Z"
  },
  {
    "source": "posts",
    "id": 548746,
    "title": "Bechamel in potato gratin?",
    "self_text": "Hello hello! So im planning on making a potato gratin for Thanksgiving, and I know the typical recipe uses a heavy cream mixture. But if I were to want to \"jazz it up\" using a bechamel instead of cream, would that be good or would that be too heavy? Also if there are any other ways to spice it up or just any adjustments you guys like, I would love to know and potentially try em! Thank you guys",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T18:47:09.183319Z"
  },
  {
    "source": "posts",
    "id": 313649,
    "title": "Balancing Sweetness of Dates",
    "self_text": "Whenever I make a savory dish that includes dates, they end up overwhelmingly sweet and nearly inedible. Dishes I'm referring to are Middle Eastern inspired dishes like a lamb tagine. Are there ways to counteract the sweetness like adding acidity or a bitter element? I'm not of Middle Eastern decent, so I'd love some advice from someone who is more familiar with the cuisine. Thanks!",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T19:18:23.302363Z"
  },
  {
    "source": "posts",
    "id": 513008,
    "title": "pasta salad sweetened",
    "self_text": "I have to know why and when we began to sweeten pasta salads",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T20:01:39.720858Z"
  },
  {
    "source": "posts",
    "id": 469200,
    "title": "Please I need help I’m 19!!!",
    "self_text": "I recentely went to sams clubs and picked up some tyson frozen nuggets from the store. mind you i did this right before i had school so i had no choice but to the leave the bag of nuggets in my trunk. Once i got finished with class i got caught up hanging with my friends from about 12:30pm to at least 12am and totally forgot all about the chicken. After i got done hanging with my friends i instantly remeber that i left them in my trunk. I went back to go get them then safely refroze it back in my dorm freezer. since it’s november during the afternoon it was around 63 to 70 degress i believe then during the evening/night it dropped down to at least 45 degrees. I really need help guys because i dont know if i should consume these nuggets.",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T22:40:18.463616Z"
  },
  {
    "source": "posts",
    "id": 272496,
    "title": "I need a Chrons friendly, gluten free, and only hard cheeses recipe.",
    "self_text": "A buddy of mine has a lot of digestive issues and he's never really had anyone cook for him so I wanted to treat him. I want something fancy as hell and I'm not worried about price of ingredients at all. I want something that's really gonna blow him away and impress him. I know he can eat chicken and any seafood but like selfish do give him a minor reaction. Red meat is completely off the table.",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T23:08:40.192643Z"
  },
  {
    "source": "posts",
    "id": 579623,
    "title": "Better than Bouillon Garlic.....Mashed Potatoes?",
    "self_text": "Anyone ever incorporate \"Better than Bouillon Roasted Garlic\" into their mashed potatoes, and if so, how?",
    "subreddit": "Cooking",
    "selected_at": "2025-09-08T13:41:08.483848Z"
  },
  {
    "source": "posts",
    "id": 973088,
    "title": "Can I add powdered milk to browning butter to get more 'browned flavor'",
    "self_text": "If browned milk solids are what makes browned butter taste so fucking good, can I add powdered milk to butter that I am Browning to get more flavor?",
    "subreddit": "Cooking",
    "selected_at": "2025-09-08T13:44:20.798575Z"
  },
  {
    "source": "posts",
    "id": 839459,
    "title": "Tweezers",
    "self_text": "Anyone here use tweezers when making hearty pan sauce pastas? I've seen a number of youtubers use them and I want to ask for a pair for the holidays that can stand up to making cacio e pepe or any other pan sauce. Any that you use or prefer? Thinking about these:   https://dalstrong.com/products/dalstrong-high-precision-black-titanium-coated-professional-tweezers  I know they're on the pricy side but looking for a nice gift for myself.",
    "subreddit": "Cooking",
    "selected_at": "2025-09-08T14:41:33.263680Z"
  }
]