[
  {
    "source": "posts",
    "id": 1032570,
    "title": "Frying Fish",
    "self_text": "Hi Everyone! I just bought a stainless steel skillet and everytime I use it something is always getting stuck on it :( specifically when it’s time to fry something.   I wait until the pan is hot, splash water on it to make sure the water bounces instead of fizzles, add my oil, and then the fish - but when I try to turn the fish the bottom of the fish sticks to the pan. (The temp is on 5 and it begins to fry btw).  What on earth am I doing wrong? :(",
    "subreddit": "Cooking",
    "selected_at": "2025-09-06T23:23:19.784838Z"
  },
  {
    "source": "posts",
    "id": 301621,
    "title": "I'm a part time scientist and have no idea how to cook and I started blog of clueless experimental cooking.",
    "self_text": "I min maxed all my points into academia and video games.  When my Gran passed away, I had to learn how to cook, but I don't have a clue, just the scientific method, lets see how the clueless experiments turn out:  https://www.youtube.com/watch?v=q0Dij8DGDjI",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T00:35:26.091511Z"
  },
  {
    "source": "posts",
    "id": 548746,
    "title": "Bechamel in potato gratin?",
    "self_text": "Hello hello! So im planning on making a potato gratin for Thanksgiving, and I know the typical recipe uses a heavy cream mixture. But if I were to want to \"jazz it up\" using a bechamel instead of cream, would that be good or would that be too heavy? Also if there are any other ways to spice it up or just any adjustments you guys like, I would love to know and potentially try em! Thank you guys",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T18:47:09.183319Z"
  },
  {
    "source": "posts",
    "id": 313649,
    "title": "Balancing Sweetness of Dates",
    "self_text": "Whenever I make a savory dish that includes dates, they end up overwhelmingly sweet and nearly inedible. Dishes I'm referring to are Middle Eastern inspired dishes like a lamb tagine. Are there ways to counteract the sweetness like adding acidity or a bitter element? I'm not of Middle Eastern decent, so I'd love some advice from someone who is more familiar with the cuisine. Thanks!",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T19:18:23.302363Z"
  },
  {
    "source": "posts",
    "id": 513008,
    "title": "pasta salad sweetened",
    "self_text": "I have to know why and when we began to sweeten pasta salads",
    "subreddit": "Cooking",
    "selected_at": "2025-09-07T20:01:39.720858Z"
  }
]