[
  {
    "source": "posts",
    "id": 807426,
    "title": "ELI5: Why medicines can't give you a longer relief time?",
    "self_text": "When I was a kid, I got Diclofenac injected on my butt and the relief I had was good even if it's a short while. Then afterwards I become a miserable piece of sadness again because of the pain. And they don't inject this very frequently. Overdose? Mayhaps.",
    "subreddit": "explainlikeimfive",
    "selected_at": "2025-09-06T23:12:58.404880Z"
  },
  {
    "source": "posts",
    "id": 941844,
    "title": "Is there an app or software I could put a cropped picture and it looks it up for me? Like where was it used across all social media?",
    "self_text": "A guy been threatening me and he has a cropped photo of himself in the profile, I want to find out everything about him",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-06T23:16:34.026421Z"
  },
  {
    "source": "posts",
    "id": 1028271,
    "title": "Orange discolouration on nails",
    "self_text": "I(22F) have been noticing a weird feeling in my nails and fingers for past few days. Today, after removing my nailpaint, I noticed a bit of orange discolouration on the tips of my nails. I had been diagnosed with herpes a month ago. What can be the probable reasons of this discolouration?",
    "subreddit": "AskDocs",
    "selected_at": "2025-09-06T23:16:46.598150Z"
  },
  {
    "source": "posts",
    "id": 871435,
    "title": "Tooth implant",
    "self_text": "I had two implants molars. According to my order the bone of one of my tooth was soft, he had difficulty. What does that mean? If my implant going to fail",
    "subreddit": "askdentists",
    "selected_at": "2025-09-06T23:21:20.421587Z"
  },
  {
    "source": "posts",
    "id": 523299,
    "title": "smell in dreams",
    "self_text": "I have had a hand full of dreams where I have smelled the same putrid smell. It is never associated with the same source and I can't recall ever smelling it in the real world. Has this happened to anybody else and do you k ow why it happens?",
    "subreddit": "Dreams",
    "selected_at": "2025-09-06T23:23:17.403069Z"
  },
  {
    "source": "posts",
    "id": 537896,
    "title": "thoughts on toothpaste tabs",
    "self_text": "looking for dentists’ opinions on toothpaste tablets as opposed to traditional tubes of toothpaste. i want to use bite toothpaste tabs because they have an option with fluoride but i’m also just afraid that it won’t be affective enough. i’m not willing to sacrifice my health for living plastic-free. what do you guys think?  (almost never drink, don’t smoke, should probably floss more, teeth are otherwise healthy)",
    "subreddit": "askdentists",
    "selected_at": "2025-09-06T23:26:50.551543Z"
  },
  {
    "source": "posts",
    "id": 402183,
    "title": "Could my dentist have closed a tooth with an open nerve?",
    "self_text": "Two weeks ago I went to the dentist. He had to fix and close a cavity. I was told that the operation was very urgent because the cavities were deep and I would have risked devitalizing the tooth.  The problem is that I think the dentist, while removing the cavities, went too deep and under covered/hit the nerve of the tooth. While operating I could feel that feeling of \"nakedness\" and pain, but I was not sure it was my nerve discovered. But the dentist didn’t say anything and proceeded to close my tooth. I have had an infernal pain in my tooth for two weeks now, it’s the same feeling as a dental abscess but without any noticeable swelling. I suppose the reason is the one I just described, but I don’t know if I’m right, or the dentist did everything in order and the pain is caused by some other problem of mine.  Now, I wanted to know if it is possible that a dentist could have made such a mistake without realizing it, what would be the consequences of such an action and what should I do to fix it?  &#x200B;  16, AFAB, no smoke, no alchol, 5'5, around 155 pounds, don't take any particular medication",
    "subreddit": "AskDocs",
    "selected_at": "2025-09-06T23:32:58.527729Z"
  },
  {
    "source": "posts",
    "id": 588415,
    "title": "What's the shortest word in Spanish that means something like \"appreciate\"?",
    "self_text": "I'm making something and I'm tight on room, I need the smallest word possible.   4 letters would be ideal.  &#x200B;  I don't know any Spanish.",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-06T23:34:30.357066Z"
  },
  {
    "source": "posts",
    "id": 490951,
    "title": "Job interview",
    "self_text": "Hey I’ve just finished my job interview. It was at a local supermarket in my area, I think the interview went well, he was asking me about my experience and work values.   During the end of the interview he asks me if I have any questions for him… I’m not sure why, but I asked him his thoughts on existentialism…   I didn’t even understand the reason why I asked that. It just came out! He then said he didn’t want to get political and it’s not appropriate to ask this during a job interview. Did I fuck it up? I can’t tell, I’ll give an update anyway to see if I get the job….",
    "subreddit": "antiwork",
    "selected_at": "2025-09-06T23:38:09.189370Z"
  },
  {
    "source": "posts",
    "id": 573313,
    "title": "What are the origins of insulin not being free or subsidised?",
    "self_text": "Seems odd considering it's a basic need for many people",
    "subreddit": "ask",
    "selected_at": "2025-09-06T23:41:18.655355Z"
  },
  {
    "source": "posts",
    "id": 627028,
    "title": "Is it possible for a sealed bottle of 70% isopropyl alcohol to evaporate overtime?",
    "self_text": "How does the alcohol evaporate if the bottle is never opened? Is it possible for it to evaporate slightly through the atoms of the plastic?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-06T23:42:49.724388Z"
  },
  {
    "source": "posts",
    "id": 380814,
    "title": "Why do I hate water in the morning?",
    "self_text": "This seems SO stupid. But I’ve googled and can’t find an actual answer. I love water. Drink it all day. But first thing, even if it’s bottled water, I hate it. Makes me feel a bit sick even. Can anyone explain?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T00:16:19.144264Z"
  },
  {
    "source": "posts",
    "id": 463947,
    "title": "Does pre workout make you gain weight if you don't exercise",
    "self_text": "I have started drinking pre workout to wake up early in the morning when I don't sleep well. I know it's not a good choice but it really helps me. One thing I notice is that I always look bloated after taking it and not exercising. Is this related or is it something else",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T00:16:50.028737Z"
  },
  {
    "source": "posts",
    "id": 424953,
    "title": "How can you tell you’re getting sick? What are your signs?",
    "self_text": "Usually when I know I’m going to deal with a flu or something my ears tend to clog up.",
    "subreddit": "ask",
    "selected_at": "2025-09-07T00:22:49.046055Z"
  },
  {
    "source": "posts",
    "id": 554235,
    "title": "Is it rudenot to talk to your hair dresser, uber driver, the person doing your manicure, ETC?",
    "self_text": "Hi friends.   I have social anxiety and don't like talking much, especially to strangers. But I always feel bad about not talking when I'm getting my hair cut, a massage or whatever, I hope they don't think I'm being rude",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T00:23:27.580744Z"
  },
  {
    "source": "posts",
    "id": 569991,
    "title": "Can flightless birds evolve to fly?",
    "self_text": "If I had the resources could I breed flight ability back into chickens, penguins, or ostriches?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T00:24:29.491590Z"
  },
  {
    "source": "posts",
    "id": 317262,
    "title": "is swimming a similar activity to running, do swimmers usually like to run?",
    "self_text": "Swimming is a lot like running but in the water, do people usually enjoy both?",
    "subreddit": "ask",
    "selected_at": "2025-09-07T00:30:42.517965Z"
  },
  {
    "source": "posts",
    "id": 708018,
    "title": "is Elon Musk even that well known to the general Public?",
    "self_text": "Everybody knows Beyonce, Kanye West, Dwayne Johnson,  Tom Cruise, i dont think people that arent internet Denizens know tf Elon Musk is lmao",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T15:42:15.036428Z"
  },
  {
    "source": "posts",
    "id": 742172,
    "title": "would you take the pill or not, if no, would you protest, or would you sell the pill (description for info)",
    "self_text": "Scientists have made a pill that, when consumed, causes the user's mind to go into a sort of a blank box, almost like a dream, that scientists can control how long they are out in, essentially work breaks in a pill form, but you wake up exactly as when the pill took effect. So 20 minutes of break = 5 seconds in real life  If you choose to sell the pill, you  can  make the pill very addictive. You can make a lot of money, but there is a 0.001% chance that the user gets trapped in the blank box for a very long time, scientist report that this amount of time is around 6 times the length of all of time itself. You know this is torture, but the amount of money is astounding, and the pill is sold under the same name as the company who first produced the pill, so there is no way of getting caught.  TLDR: earn lots of money off of an addictive pill you sell to others, but the pill can make you get trapped in your own head, for 6x the total length of time(not the length of time of the pill, the lengthbof all of time in the universe, so millions and billions of years of just yoyr consciousness). Also you wont get caught  View Poll",
    "subreddit": "WouldYouRather",
    "selected_at": "2025-09-07T15:57:41.842758Z"
  },
  {
    "source": "posts",
    "id": 562694,
    "title": "Donating to children's hospitals at the register",
    "self_text": "Why don't taxes go towards children's hospitals? Why must charities ask for money at the checkout? A third of my money is taken out of my check and I'd like that money to go towards helping kids with cancer. Why isn't this discussed more?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T16:46:20.101833Z"
  },
  {
    "source": "posts",
    "id": 871148,
    "title": "How do I eat mochi",
    "self_text": "I know this is definitely a stupid question even if this is nostupidquestions but how do I eat mochi.   I bought some sober and am now very not sober and I realized I don't know if it needs to be cooked. And if I google \"how to eat mochi\" it just says \"Take a bite, plop the entire mochi ice cream ball into your mouth, cut them into pieces—the possibilities are endless. One of the most popular ways to eat mochi ice cream is on the go! Grab a mochi ice cream treat and head out the door.\" Which tells me that mochi can be bit, cut and grabbed not if it needs to be cooked.   It looks like ice cream with a squishy powdery outside that looks like it would be good under the  blow torch, but I'm not sober enough for that. Does it need to be toasted, put in the oven, deep fried, or heated in any way or can I eat them now.",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T16:51:13.613365Z"
  },
  {
    "source": "posts",
    "id": 575044,
    "title": "I realize this is incredibly specific, but... Where can I find a plain pillowcase that is 33\" long and 15\" wide?",
    "self_text": "I have no clue where to look or even what better place to ask this. Any google search results just lead to decorative pillows with the weird dimensions or plain pilowcases (which I'm looking for) with the wrong dimensions (NOT what I'm looking for).   I just have two slightly longer than usual pillows I've had for years and can't for the life of me, find a new pillowcase that fits them.  Edit: Solved! I ordered standard King sized pillowcases and they fit well! They're slightly oversized but nothing crazy long. Thanks for all the suggestions.",
    "subreddit": "ask",
    "selected_at": "2025-09-07T18:15:04.443287Z"
  },
  {
    "source": "posts",
    "id": 1049195,
    "title": "What would happen if someone swallowed an SD card?",
    "self_text": "Would stomach acid dissolve it? Would it remain half in-tact? Would it be painful going through the digestive track if it didn't dissolve?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T18:22:38.455879Z"
  },
  {
    "source": "posts",
    "id": 763088,
    "title": "Show me your arguments against video games",
    "self_text": "I wanna see your arguments against video games, anything about them! Do your worst/best.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T18:31:58.652136Z"
  },
  {
    "source": "posts",
    "id": 425125,
    "title": "what are some weird things that you do while packing/working",
    "self_text": "Personally I like to count every package so ik my own rate w/o having to ask, and I also have to squish a jelly bean every time a come across a bag while packing",
    "subreddit": "AmazonFC",
    "selected_at": "2025-09-07T18:32:12.635667Z"
  },
  {
    "source": "posts",
    "id": 335001,
    "title": "Am I the only one who finds the McDonalds UK adverts annoying?",
    "self_text": "I find the overly-familiar, somewhat working class  \"Jack the lad\"/\"cheeky chappy\" tone of the voice actor really quite irritating, in terms of I instantly change the radio or TV station when he comes on.  In a way I think it's a bit presumptuous about the demographic/mentality of the typical McDonalds customer so quite condescending actually. They're clearly targeting the \"chav\"/working class male demographic in my opinion, for lack of a better term.  The voice has grated on me for years, but I've only just really analysed why. They've kept the same voice actor for years and years so they must think his schtick works, but for me it just reinforces my perception of McDonalds being a really down market place.",
    "subreddit": "AskUK",
    "selected_at": "2025-09-07T18:32:19.371080Z"
  },
  {
    "source": "posts",
    "id": 294640,
    "title": "Can you stab a blue whale with a regular kitchen knife?",
    "self_text": "I'm not talking about winning a fight, but more like, is a blue whale's skin tough enough to protect from a knife, or will it still make a cut? Furthermore, which animals have stab proof skin? Are there even any?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T19:15:45.540994Z"
  },
  {
    "source": "posts",
    "id": 955851,
    "title": "Can providers give a range of mobile connectivity?",
    "self_text": "I live in Australia (if that affects the answer) but was wondering if I can request from my mobile provider for a range of internet speed and connectivity? I live in an area that has 4g coverage and regularly travel to 5g locations but often experience extremely slow speeds. I have asked them about my speeds and have been given the troubleshoot option to reset network connectivity to increase my speed but when I asked if there was a range on speeds in my area I should be getting I was told my speeds depend on the phone I use and if there was maintenance in my area. I have a samsung 21 ultra so speeds through my device shouldn't be an issue and have was told there was no maintenance for my area so I was just wondering when/if/how I can press the issue of my slow speeds, I am paying for a 500g a month plan and don't get to use as much as I otherwise would due to internet going slow/dropping out but don't really know if there are standards they should be held to.",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T19:18:50.503924Z"
  },
  {
    "source": "posts",
    "id": 433830,
    "title": "Some Type Of Understanding",
    "self_text": "Why as a customer you do not tip? People really think people are gonna drive 5.5 miles away or 14 miles away for a order of $3.50 y’all be wondering why half these restaurants have so many doordash orders just sitting around piling up because y’all cannot tip don’t purchase food if you can’t tip it’s super easy that’s just like you going to a restaurant and not tipping your waiter it’s pure ignorance. And doordash she have a cap on tipping you shouldn’t be able to order food without a genuine tip",
    "subreddit": "doordash",
    "selected_at": "2025-09-07T19:28:20.203668Z"
  },
  {
    "source": "posts",
    "id": 435770,
    "title": "At what age do you stop calling people mr. or miss/ma'am?",
    "self_text": "edit: at what age do you become an adult? I am a college student who still calls people mr/ma'am.",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T19:47:22.753432Z"
  },
  {
    "source": "posts",
    "id": 888147,
    "title": "What do you think about people who say that Christmas is only for little kids?",
    "self_text": "I keep hearing people say this, even people in my family. I’m not talking about gifts, they actually say the whole holiday is only for children and some people even say that once you are an adult you should not celebrate or do things on Christmas. They also say that the only joy and purpose on Christmas is getting children gifts and watching them open presents. How do you feel about this?",
    "subreddit": "childfree",
    "selected_at": "2025-09-07T19:49:32.246996Z"
  },
  {
    "source": "posts",
    "id": 698580,
    "title": "If anyone knows: How long do valley fever spores persist on inanimate surfaces?",
    "self_text": "Probably an extremely silly thing to ask but I live in an endemic area and accidentally fell asleep during a recent dust storm with my window open (whoops) and now basically every object and surface in the room is coated with fine, gritty dust.   I have some immune system issues so I was concerned whether this could potentially be a risk as I know people often contract valley fever / coccidioidomycosis through dust exposure— and if it is, whether the spores can just ‘die off’/be nonviable after a bit or if I have to do some thorough cleaning or disinfecting in here to prevent the risk of me contracting it",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T20:01:17.246821Z"
  },
  {
    "source": "posts",
    "id": 571704,
    "title": "last night i had a scary dream",
    "self_text": "there was a solar eclipse and my mom said her friend knew this was gonna be different so she was driving me somewhere else, i saw the eclipse and it was huge, then there was a second one and then i saw about 5 other giant planets at the horizon,they were really big and were all. some shade of light blue. could anyone tell me what this means? ive had it before",
    "subreddit": "Dreams",
    "selected_at": "2025-09-07T22:11:50.749939Z"
  },
  {
    "source": "posts",
    "id": 400687,
    "title": "my sad and sweet dream last night..",
    "self_text": "last night i had a dream i bought a little shop in a mall to turn in to a juice and tea spot. i fixed it up with my family’s help. i was selling 2 different sandwiches and organic drinks, juices and teas. for some reason, i decided to build behind the counter a door leading to two bedrooms and two bathrooms. there was a big parade happening in the mall on opening night where people were dressed up and there were bands. my grandfather was there and brought a ham and was making pulled pork sandwiches. everyone was lined up to have one and papa was so happy. he died the next day. i couldn’t remember how to properly make the ham how to flavor it which made me sad because i was unable to ask him how to make it anymore.   i had another girl working there with me that i hired and she ended up changing my juice recipe without me knowing and two people were digusted by it. they also saw that we were using tap water to make the juice and mentioned that it was contaminated and needed to be filtered or boiled before using. i told them to come back for free juice as i would fix the issues. they both said no in their own way. i went the older lady who was horrified and told her that if she ever needed anything, if she was ever hungry or thirsty and needed help to come to me as i grabbed her hands.   i closed up shop that night and saw that there was a homeless man sleeping in the outdoor eating bench. i told him he should wash and sleep here for the night in one of the rooms and i made him a sandwich. he had a kid but the kid was not with him. i remember being worried he would think it was a permanent situation. i offered  that maybe he can help around shop for food and shelter until he was able to find a job and home.  irl my grandfathers health & memory is degrading fast and i am living away from him. he is a huge people person & very kind, and i learned it from him. he also loves pork lol. i have been drinking the tap water here for a while too and oddly it tasted funny today i didn’t even make the correlation until right now.   can’t really piece the dream together for meaning so i just thought i’d share if anyone was bored & wanted a read or to help interpret 💗",
    "subreddit": "Dreams",
    "selected_at": "2025-09-07T22:12:10.099686Z"
  },
  {
    "source": "posts",
    "id": 536920,
    "title": "Have you ever felt pain in a dream?",
    "self_text": "It’s happened to me a few times now, but this last one… I think I need help y’all. Please tell me I’m not the only one.   I can’t really write it off as just a headache or something after the dream I had/pain I felt last night. It was so real.   I’m genuinely shook and scared to sleep. Also concerned I unlocked a repressed memory 😭 so side question, do you believe in repressed memories?",
    "subreddit": "Dreams",
    "selected_at": "2025-09-07T22:13:31.865931Z"
  }
]