[
  {
    "source": "posts",
    "id": 262654,
    "title": "How to confront my professor?",
    "self_text": "Hello I'm applying for a master's. I had communicated prior with my Prof, prepared the reference letter's text, and everything. He had agreed on multiple occasions. I have him the deadline, including the scholarship, and he confirmed he would send the letter by then. I lost the opportunity due to his laziness; I'm very angry. I contacted him afterward, politely please submit this damn letter which would take 10 minutes. He has seen my messages but does not answer. I live in a different country, so calling is not a viable option. I have messaged on Whatsapp and emailed. What to do now?",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-06T23:09:34.809350Z"
  },
  {
    "source": "posts",
    "id": 917194,
    "title": "walking",
    "self_text": "unlive",
    "subreddit": "thewalkingdead",
    "selected_at": "2025-09-06T23:10:29.047950Z"
  },
  {
    "source": "posts",
    "id": 276373,
    "title": "GF on a dating website",
    "self_text": "Just your inputs or what you think, not really advice. So my (M24) gf (F23) has been on bumble even after we came into a relationship. On being asked, she told me she didn't text anyone and the app was still there to look at profiles of pretty women. I have since, found out that she did in fact swipe right on 2 guys after the above encounter, one being her ex crush. They didn't talk there weren't texts but would it make me a horrible person if I considered that cheating? Honest inputs are appreciated",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:10:43.729005Z"
  },
  {
    "source": "posts",
    "id": 336791,
    "title": "New TA: How to respond to inappropriate questions?",
    "self_text": "I am new to education. I work as a TA at a special ed middle school. For context, I am young and female. My lead teacher (middle aged female) had the class working on a journaling assignment about pajamas. I walked up to a random male student and asked what they were planning to write about as helping students develop and write their ideas is part of my job.   Here’s how the conversation went:   (Also, the whole conversation was in sign language- it’s a deaf classroom- so while my teacher was in the room, her back was turned- she was busy talking to another staff person so she didn’t see the exchange).   Me: “What are you planning to write about?”   Him: “Ummm…you! (My name)”   Me: “That’s not appropriate. Find something else to write about.”   Him: …comments about me and pajamas…   Me: interrupting “No. Something else…for example,…”   Him: Interrupts and starts rapid firing questions about whether I have a girlfriend or boyfriend or am I married…   Me: “I won’t answer that.” (Glances around for my teacher and feeling unsure of what’s to do…first time dealing with this- she’s still busy and I can’t easily get her attention)…I then walk away signing “Absolutely not- find another topic” and focused on other students. Students who witnessed this joked that the male student should be spanked.   Should report this to the lead teacher and possibly administration? This student’s Dad works at our school too so I have the option of talking to him directly if needed. I know that I am naive but I don’t know what to do.   Have any advice on how to handle this?",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T00:14:24.533307Z"
  }
]