[
  {
    "source": "posts",
    "id": 895090,
    "title": "Destiny 2 Servers not available.",
    "self_text": "Any idea why this is happening? I check Bungie Help Twitter page and there is nothing posted there.",
    "subreddit": "destiny2",
    "selected_at": "2025-09-06T23:06:20.775656Z"
  },
  {
    "source": "posts",
    "id": 662906,
    "title": "Is anybody else extremely disappointed with how GoW Ragnarök played out?",
    "self_text": "Major Spoilers  All through GoW ‘18 we hear about how bloody and sadistic Thor is, meanwhile Baldr, Magni and Modi are psychotic. They build up that Asgard is basically a bastion for violence and debauchery. The writers made it seem like we were going to be going up against a pantheon of mad men.   Then, they all become sympathetic villains… even Odin. Unlike ‘18, this game is filled with one sappy event after another. Thor has a sweet family, he changes his mind in the end. Greta fully forgives Kratos. Midgardians take in Thors family. Freya even forgives Odin in the end… I guess they didn’t want to do GoW 3 all over again (even though they built up that story in ‘18).  I’m just so incredibly disappointed with how they went with it. I thought it was such a lousy dynamic. Everyone was kind of a good guy. It felt like there were no stakes at all. I know Atreus is Loki, but it just felt so out of place for him to come and go from Asgard as he pleased.  It all felt so PG too, which is fucking insane to me because this is Kratos we’re talking about… not saying he needed to be a bloodthirsty maniac, but SOMEBODY did! It was just one harmless character after the next. I got so incredibly bored halfway through, but I was holding out hope that Odin was going to kidnap Atreus and Kratos would have to go psycho to get him back. So something would happen.   But we just got this sappy ass lukewarm story the entire way through. I’m so depressed.",
    "subreddit": "gaming",
    "selected_at": "2025-09-06T23:06:32.491747Z"
  },
  {
    "source": "posts",
    "id": 944939,
    "title": "Suitable GPU for a 12700K?",
    "self_text": "I’ve recently upgraded my pc to DDR5/12700k etc from a DDR3 4790k.  I’ve got a 1070ti but this is the same from my own build, what would be a suitable upgrade to support the 12700k - ideally for Blender rendering, Vray and a side of gaming.  Not looking for anything that absolutely breaks the bank, ideally around the $800NZD range.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-06T23:06:36.253883Z"
  },
  {
    "source": "posts",
    "id": 1015664,
    "title": "Custom Cooling on a GPU",
    "self_text": "Hey guys, I'm researching for a buget build and I found this thing for sale. Is it unusual or smth? Do you guys think this has better cooling as the owner claims?   https://preview.redd.it/98n94ovvkw2a1.jpg?width=933&format=pjpg&auto=webp&s=69bb3b63ee1625df09d45ae3dcf84c2539fdff97",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-06T23:06:41.100242Z"
  },
  {
    "source": "posts",
    "id": 488672,
    "title": "The Golden Knight Hates me.",
    "self_text": "Does anyone here know enough about statistics to calculate the odds that I haven't opened a golden knight yet. I know the odds are technically 0 because I opened 2 Mighty Miners in the executioner's kitchen, but let's just assume I didn't. I opened 5 champions prior to this update. 4 before the Mighty Miner was released and 1 after he was released. I got 3 Skeleton kings, 1 archer queen before the Mighty Miner released and 1 Mighty Miner after he was released. Them after this new update I opened a Skeleton King and 2 Mighty Miner's.  So, does anyone happen to know the odds of this insanely specific example?",
    "subreddit": "ClashRoyale",
    "selected_at": "2025-09-06T23:07:21.359835Z"
  },
  {
    "source": "posts",
    "id": 623805,
    "title": "Error to open the game after launcher update",
    "self_text": "I cant open the game anymore after an launcher update. Someone knows how to fix this?",
    "subreddit": "starcitizen",
    "selected_at": "2025-09-06T23:07:55.653520Z"
  },
  {
    "source": "posts",
    "id": 674014,
    "title": "Need help upgrading",
    "self_text": "I'm in a predicament and I cannot seem to decide what to do. Here is some context before I ask my question I managed to sell some parts of my exisitng PC (items sold: Asus x570 Tuf plus, 3900 (OEM), Klevv 32GB DDR4 3200Mhz Ram)  I now need to replace these items. I have roughly $730 (had to convert from my currency) which I would like to use as budget. However I don't mind adding a bit more to get later tech if it's worth it. I'm also waiting for black Friday to see if there are any good deals  I play games mainly, but use my PC for web dev, a bit of graphics design and video editing. I also occasionally runs VMs.  After shopping around I have a few options but can't decide which is best (I'm also abit picky about looks). I enjoy using Asus as the Aura sync is pretty cool, I have an Asus RTX 3060ti and a bunch of RGB fans and lighting strips My options are   Option 1: $816 CPU: 13600k MB: Asus B660-G Gaming Rog strix (DDR5) (matx) RAM: Corsair Vengeance RGB DDR5 32GB 5200Mhz Cpu Cooler: have to buy one due to new socket   Option 2: $790 CPU: 13600k MB: Asus B660-A Gaming Rog strix (DDR4)(atx) RAM: G.Skill Trident Z NEO Series 32GB 3600 CL18 Cpu Cooler: have to buy one due to new socket  Option 3: $690 CPU: Ryzen 5800x (non X3D) MB: Asus ASUS ROG Strix B550-A Gaming (DDR4) RAM: G.Skill Trident Z NEO Series 32GB 3600 CL16 Cpu Cooler: currently have a cryorig R1  I did consider getting a MSI or Gigabyte motherboard that are slightly cheaper, however I don't know if I want to move away from aurasync because it works well and I do like the look of Asus boards and have read good things about the Strix range.  Send help please.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:07:57.715435Z"
  },
  {
    "source": "posts",
    "id": 416170,
    "title": "What's the best way to switch between roles?",
    "self_text": "I want to try out tanking but keep my DPS bashing through the PvE questlines. Is it best to start getting a medium/heavy set of gear and level up a weapon that fits \"tank\"?     Then, do I need to stash that somewhere and swap between gear sets when I switch between the two? I don't think they have loadouts so I'm guessing I just keep this in inventory, or put it in storage somewhere?",
    "subreddit": "newworldgame",
    "selected_at": "2025-09-06T23:09:13.513143Z"
  },
  {
    "source": "posts",
    "id": 508449,
    "title": "Looking to help push my Worldfire deck further",
    "self_text": "Here's the link to the deck.  I added a primer in hopes to explain the ideas behind what I have at the moment.   The whole idea of it really is to play Worldfire and then Jeska right after doing at least 1 damage to everyone at the table. If I can't do it immediately, then I play against the table with the one card draw shenanigans. I have low cost creatures to help me win after the Worldfire if necessary.   Starting with getting Tevesh out for the card draw and the possibility of doing the ultimate ability. I only cast Jeska after the Worldfire.   I don't have any swamps to avoid getting stuck after a worldfire. The Black mana I need usually either comes from treasures or dual lands (and the once in a while Phyrexian Altar).  I would like to make the deck faster and more reliable. Any thoughts or ideas are more than welcome. Thanks!",
    "subreddit": "EDH",
    "selected_at": "2025-09-06T23:10:04.183128Z"
  },
  {
    "source": "posts",
    "id": 533784,
    "title": "Is there a better way to get cheese?",
    "self_text": "I have been raiding almost every house in Skyrim for my cheese cravings but I’m still running too low for comfort is there a way to get a infinite amount of cheese that isn’t a exploit",
    "subreddit": "skyrim",
    "selected_at": "2025-09-06T23:12:50.147922Z"
  },
  {
    "source": "posts",
    "id": 305479,
    "title": "Game Force-Closes When Logging In",
    "self_text": "I updated my game today after the new update. I managed to do one battleground and after finishing it, the game crashed. After that, it did not let me log in, whenever I try to log in to a character the game force closes. I have disabled all the add-ons (I only use 4 anyway) but it did not help. I have checked my internet connection but everything seems to be up and up. Help?",
    "subreddit": "elderscrollsonline",
    "selected_at": "2025-09-06T23:13:37.306792Z"
  },
  {
    "source": "posts",
    "id": 975381,
    "title": "Anyone else load up the game and find themselves unable to play even if you really want too?",
    "self_text": "This is me.  Hi, I'm suffering from Skyrim withdrawal/unable to commit issues.  I want to play my Brenton Two-handed conjuration destruction specialist but it's hard to get into it.  I could watch videos on it all day.  It's a strange place to be.  Ps.  FOR THE IMPERIUM!!",
    "subreddit": "skyrim",
    "selected_at": "2025-09-06T23:14:01.147291Z"
  },
  {
    "source": "posts",
    "id": 931816,
    "title": "Suggestions from a returning player",
    "self_text": "The game is becoming stale   I believe that after a few wipes there is very little content in the game to keep me interested. Battlestate Games have tackled this by implementing wipes and daily quests which are good addition to this, but not enough. For me, when I look back the most enjoyable aspect was learning the game, I believe that for the game to emulate this it would need to have major changes between wipes.  A few examples of this could be to change locations of: loot spawns, marked rooms, scav spawns, barter trades etc. Basically add some randomness that requires to relearn certain aspects of the game.  Also quests could change, instead of having the same quests Battlestate Games could create hundreds that alternate between each wipe. Or they could have a more personal approach and have a main theme or story each wipe which reflect on unique quests.  &#x200B;   Lobby for hackers   Hackers are clearly present in the game, which is natural due to the economic nature of the game. Although Battlestate Game has been doing a large amount of work to tackle them, they keep appearing. Clearly this approach doesn't seem to be working as the main problem is that the developers have to spend time dealing with hackers rather than adding content and improving the game.  The Cycle: Frontier, a looter shooter, has addressed the issue in a unique way. They use a system called trusted matchmaking, once a player becomes trusted they get matched to other trusted players. Cheaters are also pooled into their own lobbies. There are multiple factors that go into determining when you are trusted such as: numbers of hours played, lifetime of the steam account, stats in-game etc. Also if you get killed by a hacker the items you brought into the raid are returned back to you.  Although Battlestate Games may be hesitant to introduce any sort of \"matchmaking\" system, I believe this may be necessary to combat hackers.  &#x200B;   Reminders in main menu before joining raids   Currently if your health is low you when starting a raid you get a warning. I believe this is beneficial but should also be applied to other areas as well such as: low durability in armour, mags not filled, bags not empty, food and fluid is low.  I understand that EFT is a hardcore game and has little to no hand holding. However I don't believe forgetting to do something in the lobby is reflective of your in-game skill. Furthermore loading into a raid with the above negative effects detracts from the overall experience, it simply leaves you angry and frustrated. Games are primarily meant to be fun.  New players in particular are already having to learn a lot and will naturally forget some things, informing them of mistakes before they are made will increase player retention and enjoyment. Although I'm sure this also affects experienced players, the number of times I have died for forgetting to eat a drink is more than I can count over the course of several wipes.  &#x200B;   Filtering   The filtering in the game menu currently highlights items in set categories, however I don't think this is really helpful.  I believe instead a more useful approach would be to display an inventory with just the filtered items at the top, including anything in containers being brought out and shown.",
    "subreddit": "EscapefromTarkov",
    "selected_at": "2025-09-06T23:14:51.002261Z"
  },
  {
    "source": "posts",
    "id": 345849,
    "title": "Defensive assist setting myplayer",
    "self_text": "Is there a setting on current gen under controller settings for myplayer? I can’t find it anywhere in mycareer controller settings unless it only needs to be adjusted at the main menu options before you load in to mycareer.",
    "subreddit": "NBA2k",
    "selected_at": "2025-09-06T23:14:55.362593Z"
  },
  {
    "source": "posts",
    "id": 959741,
    "title": "Idk what to do.",
    "self_text": "I restarted my console and I when I try opening the game, it brings me to a previous play-through. Is there any way to fix this?",
    "subreddit": "reddeadredemption",
    "selected_at": "2025-09-06T23:15:14.322458Z"
  },
  {
    "source": "posts",
    "id": 1037049,
    "title": "low fps on gaming rig",
    "self_text": "Back once again with the bottleneck!   Same question as before...   I've got a new GPU a while back and i notice some huge bottlenecks. Im not getting enough fps.    I just want to be able to game on 120fps with the newest games on high settings and a bit of VR gaming.     Last time someone on here told me i should upgrade my ram, now i did this with a new qvl approved kit but still my fps are shit. I also dont seem to get my ram in dual channel mode so something definitely seems off.   My chipset, windows, bios and everything seems to be up to date and xmp 2.0 is enabled.   With my ryzen 7 2700x, and 3070ti im getting 60fps on mid settings on warzone???   I did notice that my ram is always around 80-90% usage while idle so this might be a problem aswel.   My processor and gpu are  while gaming  not at full usage at all, see the screenshots below for task manager playing gaming cod.  Also included the specs of the ram and screenshots of cpuz on the memory tab and the overall specs of the rig on speccy.   I really hope someone can help me out with this, did i buy the wrong ram??   https://imgur.com/gallery/UxvWf2h",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:15:16.066056Z"
  },
  {
    "source": "posts",
    "id": 488971,
    "title": "Recommend me a manga where character stereotypes or story stereotypes of different genres are mixed together?",
    "self_text": "Just as the title says, I want a manga where multiple genre stereotypes are mixed together.",
    "subreddit": "manga",
    "selected_at": "2025-09-06T23:15:25.239472Z"
  },
  {
    "source": "posts",
    "id": 441361,
    "title": "we thought we were so smart",
    "self_text": "killer ended up having retribution as well as haunted grounds 💀 we really thought we were so slick",
    "subreddit": "deadbydaylight",
    "selected_at": "2025-09-06T23:15:31.140868Z"
  },
  {
    "source": "posts",
    "id": 390914,
    "title": "Viola parry idea",
    "self_text": "Since we all know violas parry isn't great and moon of MK is better wouldn't combining that with evil harvest rosary be a good idea, then it doesn't matter how long you parry for, you still get a biot of damage off and can use moon for actual long witch times.",
    "subreddit": "Bayonetta",
    "selected_at": "2025-09-06T23:15:33.810133Z"
  },
  {
    "source": "posts",
    "id": 756816,
    "title": "Question about Levelling",
    "self_text": "Hello everyone, I'm a returning player from Mists of Pandaria and recently found out about the Shadowlands level squish. I read on wowhead that 'leveling progresses about 60-70% faster for 1-50, compared to the time it used to take to get from 1-120'.   When I used to play wow my favourite part was the questing, and even back in the old days I always found this went by so fast (I started questing in Outland at lvl 60, but reached 80 by the time I completed it and then pwned everything in Northrend). I'm concerned that the level squish won't let me get the same enjoyment out of questing.   Do others (who enjoy questing, I know that isn't everyone lol) find that they are able to play through vanilla, then burning crusade, then wotlk, etc. at a steady pace since the level squish? Or do you just reach the next expansion at a very high level and lose all the challenge?  Sorry if this question has been asked before!",
    "subreddit": "wow",
    "selected_at": "2025-09-06T23:16:13.778705Z"
  },
  {
    "source": "posts",
    "id": 398398,
    "title": "Just reached rank 5 german tanks!",
    "self_text": "Anyone has any recommendations on which tank i should get? I can research the Marder A1, M48 patton, Leopard 1 and Kugelblitz. I've seen many people who'd recommend getting the leopard 1 first, but i just want to know what your dude's opinions are.",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-06T23:16:19.424247Z"
  },
  {
    "source": "posts",
    "id": 545079,
    "title": "[Spoilers Extended] Shireen \"Bright Reborn\"",
    "self_text": "Shireen's name may be a clue in favor of the theory that she will be sacrificed to R'llor. I think there is some wordplay going on here.  Separated into the two syllables \"Shir\" and \"Reen\" the name can be read as \"Bright-Reborn\" using Old English (which George very commonly uses) and French.  >Shere or Shire is derived from the Old English \"scir\", meaning  \"fair, bright, shining\" .  >René meaning  born again or reborn  in French is derived from the Latin name Renatus.  Why think French? Because the name Shireen or \"Shereen\" is also a French name from the word \"chéri\"  (Listen to Google translate French to English say chéri. The pronunciation is almost exactly the same) . Also George likes French and the history of France as he motioned when discussing the book  Les Rois Maudits  which was an inspiration for ASOIAF.  This reading of the name very closely matches the language used when a follower of R'llor discusses fire sacrifice or death.  >\"Let these girls be reborn in light. - Victarion  >Better that they be reborn into the light.\" - Selyse   The name \"Shireen\" is a play on words.  Within the \"darling\" Shireen or \"chérie\"  hides a more sinister meaning related to R'llor worship.",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-06T23:16:25.862229Z"
  },
  {
    "source": "posts",
    "id": 853084,
    "title": "The Phoenix nerf",
    "self_text": "Why they just don't make the card 5 elixir and call it a day this nerf is just an indirect log buff which they were complaining about for a long time tf is this balance team doing",
    "subreddit": "ClashRoyale",
    "selected_at": "2025-09-06T23:16:42.404272Z"
  },
  {
    "source": "posts",
    "id": 893361,
    "title": "Are all of the GOW games connected?",
    "self_text": "I’m trying to figure out what order I should watch or play all the games. Are all the god of war games connected? Does Kratos travel through different realms to fight different gods? I just need an explanation in simple terms.",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-06T23:17:11.268676Z"
  },
  {
    "source": "posts",
    "id": 373591,
    "title": "When you think about it, bloons players are the real anti-fascists",
    "self_text": "When I quit bloons after battles 2 came out and kept crashing, that was basically me becoming a fascist",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:18:19.575521Z"
  },
  {
    "source": "posts",
    "id": 852307,
    "title": "Emperors Children",
    "self_text": "Does anyone else think it’d be interesting to see the 3rd legion return to the imperium with clone Fulgrim in charge and Fabious Bile as the lieutenant commander? It was hinted at in Fabious’ second book, that he strongly considered it. The option is still there just take clone Fulgrim back and use the hidden cache of gene seed to remake a pure 3rd legion.",
    "subreddit": "Warhammer40k",
    "selected_at": "2025-09-06T23:18:33.979009Z"
  },
  {
    "source": "posts",
    "id": 605606,
    "title": "Master Inkeeper saved Aoi as a child Kakuriyo?",
    "self_text": "Did the ogre god save Aoi as a child after her mother abandoned her? Also, was the large det her grandfather created a ploy by the two of them so he had a reason to bring Aoi to the hidden realm? It seems like they hit that that's the case very heavily, but it's never said.",
    "subreddit": "anime",
    "selected_at": "2025-09-06T23:18:38.115283Z"
  },
  {
    "source": "posts",
    "id": 562593,
    "title": "Do you think the prices for graphic cards will fall after AMD releases the RX7900 XT &amp; RX 7900 XTX?",
    "self_text": "I want to buy me a new pc, but i think i will wait till amd brings out there new cards on december 13th this year. Because i hope the other cards prices will fall. Am i hoping for nothing?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:19:06.687374Z"
  },
  {
    "source": "posts",
    "id": 530682,
    "title": "Why isn't there a ranked game mode?",
    "self_text": "Killer or survivor, no matter the enemy side everyone just tryhards so much whenever I play it's ridiculous. It's clear there is a demand for such a game mode why haven't they made it yet?",
    "subreddit": "deadbydaylight",
    "selected_at": "2025-09-06T23:20:06.344519Z"
  },
  {
    "source": "posts",
    "id": 629012,
    "title": "How to know if an item is H2S",
    "self_text": "How to know if an item is Hard To sell? I sold a purple octane for a grey 20xx and it's really hard to sell. So I want to know for future trades how to avoid it.",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-06T23:20:14.125946Z"
  },
  {
    "source": "posts",
    "id": 716946,
    "title": "Same nintendo account for 2 switches?",
    "self_text": "So I’m getting the double pack tomorrow. I just bought the new oled and I have my old switch. If I want to join and play both games simultaneously will it work of they are both on the same nintendo account?   I want to trade between and join and play with both at the same time. I havent set up my oled yet.",
    "subreddit": "pokemon",
    "selected_at": "2025-09-06T23:20:32.474681Z"
  },
  {
    "source": "posts",
    "id": 854209,
    "title": "Yaks vs La's",
    "self_text": "Which one of the lines is better? I have a visual preference for Yaks but don't know if the La's are any better.",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-06T23:20:36.231773Z"
  },
  {
    "source": "posts",
    "id": 354528,
    "title": "Vertical (Ergo) Mouse - Wired/Wireless/BT/2.4 GHz, no grip coating - Do they make such a thing?",
    "self_text": "So I am looking for a vertical mouse for better ergonomics, but one that can be used both wired and wireless, that has BT also.  Would be a plus to also have 2.4GHz support but not necessary.  Another thing I'm looking for is none of that rubber coating that rubs off.  I'd prefer a matte plastic finish that won't shine after use (or I can use grip tape to avoid it).  A rubber padding that doesn't rub off would be fine also.  Does anyone know if they make such a thing?  I currently have a Fantech Aria XD7, which fits the bill in every way, even comes with grip tape, except for the vertical/ergo part.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:20:46.242542Z"
  },
  {
    "source": "posts",
    "id": 400343,
    "title": "a tragedy",
    "self_text": "I have move out of my house but due to complications i still dont have wifi (im writing this outside on my phone) the problem here is that i got gow with ps plus but it won't let me play due to the lack of WiFi and i was so close to getting the platinum before Ragnarok and also it would be my firs ever platinum ever😭",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-06T23:21:22.499552Z"
  },
  {
    "source": "posts",
    "id": 377506,
    "title": "New Challenge: Ambean Addict",
    "self_text": "You can only recruit your army from Ambean",
    "subreddit": "mountandblade",
    "selected_at": "2025-09-06T23:21:24.535145Z"
  },
  {
    "source": "posts",
    "id": 371391,
    "title": "What happens to muggle-borns who don’t go to Hogwarts?",
    "self_text": "Let’s use Hermione as an example because we know she became a powerful witch. What if Hermione chose not to go to Hogwarts? Could she have studied magic on her own later in life? Could she have performed wandless magic? Made potions?  Considering both potential magical ability and what the Ministry of Magic allows, what do you think becomes of muggle-borns who don’t go to Hogwarts?  Edit: If you think attending Hogwarts is mandatory, how is it enforced for people who don’t want to go?",
    "subreddit": "harrypotter",
    "selected_at": "2025-09-06T23:21:31.737040Z"
  },
  {
    "source": "posts",
    "id": 1045510,
    "title": "No Golden Egg?",
    "self_text": "The event says I collected 2 golden eggs but I don't see them and can't open them from my inventory. My brother got one and it's in his inventory. Anyone have any ideas?",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-06T23:21:47.010325Z"
  },
  {
    "source": "posts",
    "id": 486349,
    "title": "Ideas for quests where the townspeople(quest givers) are trying to kill the PCs?",
    "self_text": "They're currently entering a town under the grip of a green dragon, the idea is that the townspeople are trying to get their possessions to appease the dragon and be shown a little bit of mercy.  Edit: I want ways where even if the players survive it wouldn't be immediately obvious the townspeople wanted them dead.",
    "subreddit": "DMAcademy",
    "selected_at": "2025-09-06T23:23:11.325277Z"
  },
  {
    "source": "posts",
    "id": 859548,
    "title": "Space combat - ship parts damage while shielded",
    "self_text": "Hi, could someone explain to me how does getting your ship parts damaged in combat works? I noticed that sometimes some parts of my ship get damaged in combat even though my shields are up. Is it due to how I use them (like letting them overheat or something), or is there always a small chance of things getting damaged that depends on your shield %?",
    "subreddit": "NoMansSkyTheGame",
    "selected_at": "2025-09-06T23:23:27.513169Z"
  },
  {
    "source": "posts",
    "id": 984205,
    "title": "My thoughts on Bleach as a first time viewer",
    "self_text": "I'm at episode 155 right now, here's what I've noticed:  Social:   Whenever Ichigo reunites with Rukia, she hits him for some reason because expressing emotion takes away from her self-procalimed coolness  Inoue was given a great power because something had to offset her simping for Ichigo  Ishida is smart because his glasses shine   Fights:    Main character strikes a huge blow, opponent hasn't moved a bit, just lifted up their finger to block him    Whenever Ichigo is losing and almost dead, he's suddenly in his own head with Zangetsu, learns something, and suddenly powers up with something insane    Whener their group goes to a new place, they'll always fight the strongest but also befriend some of the weaker ones    NO ONE EVER DIES. If the villain has almost killed the hero, they won't finish him off because its beneath them. Whenever the hero almost kills the villain, they won't finish him off because reasons.    These people have more blood to spare per person than a hospital which received an infeted batch of donations. Everyone's always bleeding like a faucet but no worries bro, I have will power    Physics:   As long as there's funny music, all injuries are minor, including getting kicked in the head, having a brick drop on your head, or falling down a deep hole. Funny music = immortality + its a joke bro  People jumping around on buildings and trees like they're in Naruto, but during a fight they're suddenly restricted  When the fuck did they all gain the ability to fly while fighting? Why would anyone walk after they realized they can fly??   Characters if they were real people:   Ichigo: In jail for domestic abuse, cellmate is his dad  Inoue: Conjugal visits to Ichigo  The eyepatch captain that Ichigo beat: Running an underground fight club  Ishida: Class topper with a side hobby of building chemical weapons   All in all, 8/10 show. I'll definitely watch till the end.",
    "subreddit": "bleach",
    "selected_at": "2025-09-06T23:23:43.165520Z"
  },
  {
    "source": "posts",
    "id": 451064,
    "title": "What’s y’all’s favorite meme skins?",
    "self_text": "I thought this would be a cool question, mine is meow skulls or bun bun",
    "subreddit": "FortNiteBR",
    "selected_at": "2025-09-06T23:24:30.156611Z"
  },
  {
    "source": "posts",
    "id": 918914,
    "title": "I'm looking for people to to hangout with in a PS party",
    "self_text": "I normally play both multi-player and single player games on console all the time, but it seems that I like to have other people to chill with while I'm fuckin shit up in skyrim or cruising around in gta. I smoke weed so if that bothers you don't even try, I have a dark sense of humor so again if you don't like that then move along. I just want some casual people to chill out with and talk while I'm doing other things. Psn name is yourmom733 HMU if your trying to hangout",
    "subreddit": "playstation",
    "selected_at": "2025-09-06T23:26:40.470412Z"
  },
  {
    "source": "posts",
    "id": 1036803,
    "title": "School Bus Base",
    "self_text": "Is there a way to take the bus seats up inside of the actual bus, not through the vehicle mechanics? I have the required skills using the \"pick up\" option and if shows the loading bar, but when my character goes over to pick it up nothing happens.",
    "subreddit": "projectzomboid",
    "selected_at": "2025-09-06T23:27:17.576387Z"
  },
  {
    "source": "posts",
    "id": 299625,
    "title": "ban for disconnecting???",
    "self_text": "&#x200B;  why do i get a ban for disconnecting and then trying to join back???",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-06T23:27:36.504105Z"
  },
  {
    "source": "posts",
    "id": 616160,
    "title": "Would a quadruple XP half-day be a good idea?",
    "self_text": "Like, instead of a double weekend XP, the XP is multiplied by 4 instead of 2, and the duration is just 12 hours instead of 2 days  Would this be a good idea, or would it break the game in some way?",
    "subreddit": "fo76",
    "selected_at": "2025-09-06T23:28:22.745347Z"
  },
  {
    "source": "posts",
    "id": 720627,
    "title": "Looking for a tool that displays personal data about matchups",
    "self_text": "I am mostly an OTP and have been looking for a tool that displays your winrate (and ideally other stats) in certain matchups, mostly to see which matchups i need to work on. I know u.gg atleast has the winrate part on paper, but it only shows me 3 matches out of a hundred for those statistics. Would be very grateful if anyone knows one so i dont need to start tracking stuff myself.",
    "subreddit": "leagueoflegends",
    "selected_at": "2025-09-06T23:28:40.936260Z"
  },
  {
    "source": "posts",
    "id": 682704,
    "title": "Am noob tank. How do I improve?",
    "self_text": "I'm playing a prot paladin. I tried following guides online but even the beginner ones are a bit overwhelming. Can someone answer some questions for me, please?  These are for dungeons and raids alike but let me know if the answer changes based on whether it is a raid.   Do I focus on the highest or lowest health mob of a group? Or are there some other criteria?  Do I focus on the same mob until it dies, or do I cycle to keep all mobs' aggro on me?  Is my responsibility to keep the most powerful mob's aggro on me, or all of them?  Do I watch everyone's health and do something when someone is about to die?  What blessings do I cast on who and when? How do I decide?  I understand that you get aggro from a mob when you damage them. DPSs naturally do the most damage. How come a tank can keep more aggro in comparison? How does that work?  Do I do anything other than attacking and using \"hand of reckoning\" to keep aggro on me?   Thanks a lot in advance.",
    "subreddit": "wow",
    "selected_at": "2025-09-06T23:28:53.102917Z"
  },
  {
    "source": "posts",
    "id": 353185,
    "title": "6700XT or 7700XT?",
    "self_text": "So, I've wanted to upgrade my GPU in a while. I ended up deciding to go with the 6700XT, but since the prices were too high, I decided to wait for new AMD RDNA3 GPUs to drop in order to find the 6700XT cheaper. However, AMD dropped their prices below the expectations I saw on the internet and now the 7700XT is estimated to be around the same price as the 6700XT but later. You can see my PC specs next to my username. I am not sure whether or not I should buy the 6700XT (as my motherboard supports up to PCIE Gen 4) over the 7700XT (which will probably will be over 600$ and will have PCIE Gen 5). What do you think?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-06T23:32:35.850659Z"
  },
  {
    "source": "posts",
    "id": 1001356,
    "title": "What I want out of the final fight",
    "self_text": "We have heard that the Roger Pirates' co-operation and teamwork made them unstoppable.  With majority of the Strawhats' fights, they have been either separated or fighting another enemy elsewhere. We haven't seen them all together fighting and assisting one another, at least not in any major fights.  So what I want for the final fight is for the Strawhats to fight in one big group, instead of splitting off to do 1v1s.",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-06T23:33:39.051010Z"
  },
  {
    "source": "posts",
    "id": 462069,
    "title": "Do we know anything about the December DLC?",
    "self_text": "Any creditable leaks? Or is Rockstar staying silent like always…",
    "subreddit": "gtaonline",
    "selected_at": "2025-09-06T23:34:34.905974Z"
  },
  {
    "source": "posts",
    "id": 418528,
    "title": "Naming your character",
    "self_text": "How do you go about deciding what to name your character?",
    "subreddit": "skyrim",
    "selected_at": "2025-09-06T23:37:38.953486Z"
  },
  {
    "source": "posts",
    "id": 976615,
    "title": "why are death troopers always treated like cannon fodder?",
    "self_text": "When Death troopers were first introduced along with their accompanying lore, I thought they were awesome. But it makes me sad seeing that these towering and “terrifying” soldiers cloaked in black custom armor sporting the name “Death Troopers” rumored that they were undead (according to what galactic citizens believe) are just being constantly whacked like common foot soldiers.",
    "subreddit": "StarWars",
    "selected_at": "2025-09-06T23:38:39.152563Z"
  },
  {
    "source": "posts",
    "id": 650686,
    "title": "Rocket GO Leaders",
    "self_text": "I completed the first event research where you had to catch shadow Pokémon and beat grunts. Then I beat a leader from a rocket radar but I can’t encounter any others. I’m not getting any mysterious components when I beat the grunts. Does anyone know what to do?",
    "subreddit": "pokemongo",
    "selected_at": "2025-09-06T23:40:11.678628Z"
  },
  {
    "source": "posts",
    "id": 904882,
    "title": "Are Sanguophages always infertile?",
    "self_text": "Or is it because I made mine 800 years old? In which case, that sucks. They also don't seem to be doing any lovin'.. Is it because they sleep so little?",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-06T23:40:17.207039Z"
  },
  {
    "source": "posts",
    "id": 473293,
    "title": "Cross progression for new console?",
    "self_text": "I'm getting my friend a new Xbox for Christmas. They currently have an Xbox one S and I'm getting them an Xbox Series X.   Does DBDs cross progression work for new consoles? Will they still have all their progress on their new console?",
    "subreddit": "deadbydaylight",
    "selected_at": "2025-09-06T23:40:25.284479Z"
  },
  {
    "source": "posts",
    "id": 679872,
    "title": "Looking for game music end 2021",
    "self_text": "I think around the time the  Mothman season  came out, some incredible music came out as well in the game, but it's  not  part of the Mothman OST (at least I can't find it, and it's less \"agressive\" than that OST). The music really sounded like  movie music , with piano and other low synthetic instruments. Kinda like covert/stealth sequences in action movies, as best as I can describe it...  I tried recreating the melody (what I remember at least) in my DAW, I don't know if it''s any help. I'm sure I started hearing it around november 2021 and wasn't in the game before... I could mainly hear it during the main menu or during low combat sequences... I can't spare more detail unfortunately, anybody know what I'm refering to ? Thanks !",
    "subreddit": "fo76",
    "selected_at": "2025-09-06T23:40:37.871400Z"
  },
  {
    "source": "posts",
    "id": 547799,
    "title": "Is the bioshock collection worth it for 10$ on the Nintendo switch",
    "self_text": "I’ve never played the game idek if I would like but many people have recommended it to me",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:41:00.058999Z"
  },
  {
    "source": "posts",
    "id": 1036717,
    "title": "Please help me find manga",
    "self_text": "Hello, I've been looking for a manga I read a while back. It's about a floor boss(?) Taurus/ox that gained awareness and after beating adventurers, it tries to escape the dungeon. During his efforts, the monster kills a famous hero.   It also tried to pick up loots from killing adventurers but the items disppaeared and it got pissed.   Please help!  Solved! King of the labyrinth",
    "subreddit": "manga",
    "selected_at": "2025-09-06T23:41:51.676667Z"
  },
  {
    "source": "posts",
    "id": 904560,
    "title": "Cool base mods",
    "self_text": "I wanna make a cool base. Does anyone know some mods for that?",
    "subreddit": "feedthebeast",
    "selected_at": "2025-09-06T23:48:31.440986Z"
  },
  {
    "source": "posts",
    "id": 273978,
    "title": "Can anyone recommend me some PC games to play?",
    "self_text": "Can you please recommend based on the games I played so far:    Dragon Age  Bioshock  Sims (LOL)  Life is Strange  The Journey  GTA   Thank you!",
    "subreddit": "gaming",
    "selected_at": "2025-09-06T23:50:14.733720Z"
  },
  {
    "source": "posts",
    "id": 976357,
    "title": "No dungeon?",
    "self_text": "Trying a drunk world for the first time and there’s no dungeon, is this normal or is it hidden?",
    "subreddit": "Terraria",
    "selected_at": "2025-09-06T23:50:27.622778Z"
  },
  {
    "source": "posts",
    "id": 475361,
    "title": "Something in my PC first died, then I killed the PSU. A repair dwindle boogaloo. A man versus technology narration that will move all rationale you've got left into computer repair. A simple ... ;;; Perchance ;;;.",
    "self_text": "Hello Redditors! Very,  very  funny story happened today. Well, not for me, but that's not the point.  &nbsp;  It had been a beautiful morning of Eight of November. A young, yet aspiring man hath riseth from his bed, waddled to his seat, and henceforth the story fully began. He awoke his computer from sleep as always, and frittered away the time. Seconds felt like pure blissful eons, as he scrolled through the endless internet. He decided to start a long dead game called Evolve, and start it he did, indeed. 10 minutes into a thousandth match of his life, his PC  suddenly   shut down . This has happened before.     \"A power outage it must've been!\"  , - he thinks to himself. But, as swiftly as he came to that conclusion, he just as quickly noticed the contradiction in front of him, as well as above him. Ceiling lights remained on, and router remained on as well. By this time - the computer has already started turning itself back on. He waits 15 seconds for the splash image to arrive - but it never does. So, he resets the computer. Still nothing.  Coincidentally, he notices that the mouse and keyboard lights aren't coming on either, so he grabs his pluggable USB voltage meter and plugs it into his USB ports - it reads 3.5V. 1.5V lower than intended. Instantly, frightened of data loss, he turns off the computer and removes all drives. Then, he grabs his voltmeter and measures 12V, 5V and 3.3V rails of the PSU. He reads 9.5V, 3.5V and 2.7V. All lower. Not good. He thinks it's a bad PSU when he notices that his motherboard has LED debugging LEDs. He reads what the LED says - the \"CPU FAULT\" LED is on. What could it be?   The introduction has been pretty simple so far.   Sudden shutdown  Won't post, but fans spin  Low voltage on all rails, but...  IS IT?   the story continues     He decides to remove the GPU as well, to prevent the damage to it, as he remembers the GPU has very sensitive MOSFETs that operate in a specific voltage saturation region and low voltage could kill them. Besides, the computer has integrated graphics, so that's not a problem.  &nbsp;  Correcting steps, commence!  &nbsp;    With only PSU, Motherboard, RAM and CPU remaining in the case, he decides to clear the BIOS via BIOS jumper as well as remove the BIOS battery for 30 minutes. He does it, no change.    He decides to shuffle ram, no change.    Voltage gets measured again, and this time..  SURPRISE!  Voltages are good and within spec! 12V, 4.98V and 3.3V!    He decides to take out PSU completely and to the paperclip test - it works great! So..  is it not the psu after all?      What do we know so far?   Voltages seem to be fine now  Still no post  Paperclip PSU test works ok   What happened next?    Stupidest moment of the story begins!   Next loical step in diagnostic would be reseating the CPU, possibly a new one and trying a second motherboard. As motherboards are more expensive than cheapest compatible CPU, he decides to get a CPU. However, the seller said it will have to wait until tomorrow, so he grows impatient. He searches the internet a bit about the problem a Youtube video about an user facing the exact same issue and solving it! And the comment section is FULL or positive replies. So he decides to try it!  &nbsp;   How is it done?   Simple, turn on your PC that won't post, and then quickly shift your ON/OFF switch on the PSU back and forth, quickly as in crazy fast.  I did that once, nothing happened. Second time, nothing. I guessed I was too slow. Third time I'll try it super fast, I thought to myself. So I do it and - woo! Power outage for real!! Wait - that's my breakers popping. Wait hold on did my PSU just blo-----.   Yes.    Yes it did.    So all in all my beloved Redditors, now I'm stuck with a dead PSU and either a dead motherboard or CPU. I'm out of ideas or any thoughts at all, so I hoped that you'd have something to share in the comments.  &nbsp;  Thanks for reading, love you all.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:50:37.173873Z"
  },
  {
    "source": "posts",
    "id": 641387,
    "title": "Need a new colony idea? Share your stories and be inspired by others!",
    "self_text": "Hi, I've been lurking here for some time and I often see people with really good ideas for their colonies stories, and other that would like to try something new. I've seen people with 400%+ age growth for a multi generational colony, a mad mechanitor trying to clone her dead daughter and much, much more. So let's share ideas and be inspired by others !  I'll start : I've started with a goody two shoes rich explorer named Huabuka, with a wholesome ideologion. Everything was nice and all, up until the archonexus quest. Huabuka wanted the Archonexus. She had given up her colony for the first part of the map, and arrived to a new, barren place. She researched the monument, but soon realised she needed more funds, so she enslaved raiders and built tons of clothing and managed, after some years, to get her hands on the second part of the map. But it wasn't enough, and going more and more against her ideologion, she attacked allied caravans, enslaved as much people as she could and began an enormous flake farm to finance her research. Her longtime friends and husband were against it, but her speaking talent got her free from them rebelling. And flake. Tons of it. When she got the last part, she burnt everything to the ground, killed all the slave and when to the final Archonexus monolith. After a tough battle, and blinded by greed, she killed her last standing companions and took it all for herself. Would this downward spiral from her convictions, aggravating her mood, enslaving innocent and killing everybody really worth it? Only she can tell, but she isn't there any more to tell us.   TL;DR  : a kind person with a charitable ideologion turned to slowly to madness, slavery, drugs and murder to fulfil her craving for mysteries  No need for special mods for this story :)",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-06T23:51:53.122253Z"
  },
  {
    "source": "posts",
    "id": 260684,
    "title": "Just beat the game, and I miss the sense of whimsical fun from 1 and 2",
    "self_text": "I just beat the game, and while the gameplay was mostly excellent (when you actually got to play the hack and slash part...) and I don't even want to think about the story, the thing that really struck me was how grim and serious it all felt.  One of the things I liked about 1 and 2 was how vibrant and fun they were, despite the series stakes in both games, it truly felt like Bayonetta wasn't taking things  too  seriously and was genuinely having a good time, which served well to contrast the more serious moments when she did actually take things a little more seriously. By contrast, Bayonetta's attitude felt almost forced in this game and I only felt that whimsical fun in during the intro but with the apocalyptic backdrop (the other games had bright and sunny stages to contrast the literal hellscapes, something sorely lacking in Bayo 3) and constant death/destruction, the overall mood of the game was bleak, leaving Bayonetta's sassy quips falling flat.  Discussion of the story and gameplay has been done to death so I won't say anything on that, now that I've beaten the game the drastic tonal shift had me kinda bummed and I wanted to vent.",
    "subreddit": "Bayonetta",
    "selected_at": "2025-09-06T23:52:23.223600Z"
  },
  {
    "source": "posts",
    "id": 761996,
    "title": "Any “doomsday gamers” here that have trouble placing much stake in modern systems and digital purchases?",
    "self_text": "I know a lot of thoughts on matters like these are  usually  worst case scenarios, but I’m just very uneasy about modern consoles/games and their potential caveats. I have more systems than I know what to do with, including a Series X and a Steam Deck. As nice as they are, my Series X is reduced to a space heater if I don’t have internet (game share with the gf, I know it’s my own decision to do that but still) and I know buying games through Valve is just as much of a “license to play” rather than actually owning something as any other digital storefront. I also just plainly don’t like digital purchases. Physical media is for me.   Things of this nature just really nag at me sometimes. They’re my games, dammit! If there’s a title out there I  truly  want to  own , I’ll usually track it down on the oldest console it’s available for. I collect a lot of PS3 games for this reason, and am about to begin grabbing some PS4 games I’m interested in too because I know neither of those systems are reliant on internet to just play things, and in the PS3’s case it’s easily jailbroken for even further preservation.   I know I’m not alone but I just wonder if any of you give it the level of thought that I do haha",
    "subreddit": "gaming",
    "selected_at": "2025-09-06T23:52:25.130676Z"
  },
  {
    "source": "posts",
    "id": 708988,
    "title": "They changed weekly challenges.",
    "self_text": "Instead of 10 team kills you now have to get 250 assists/saves.  Instead of 10 wins on 2 roles it's 3 wins on 3 roles.",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-06T23:52:38.498856Z"
  },
  {
    "source": "posts",
    "id": 295209,
    "title": "How to find an accidentally hucked weapon?",
    "self_text": "So last night I was building an outpost on the pavers bordering the upper yard. I went to relocate one of the storage chests when I accidentally hit the very ridiculously defaulted key to throw a weapon. It was a level 9 toenail scimitar. Sadly I was facing the koi pond and the thing flew off the edge of the paver and down into oblivion.   I spent over 45 minutes scouring the pond surface and depths where I estimated the weapon would have gone but to no avail. As I have upgraded my other weapons to high levels I don’t have any supreme whetstones left to get another one back to level 9.   I found that weapons sink in water but all searches came up empty. I know that dropped or thrown weapons have a proximity icon when you get close to them but that doesn’t always work. Why it doesn’t work is beyond me and clearly is not working as intended as I’ve lost arrows and other hucked items in the past but miraculously picked them back up by running over where they just happened to land but a weapon like this may as well be a needle in a haystack to find in the koi pond provided that’s where it is in the first place.   Will this weapon eventually despawn or will it be somewhere in the world waiting for me to find it by chance?  Here’s an idea for the devs: Make an item that was thrown ALWAYS show up on the HUD regardless of how far you are from it!!!!  While I know that you can remap the keys I would love to know who in the hell thought it was a great idea to default the huck key to R???",
    "subreddit": "GroundedGame",
    "selected_at": "2025-09-06T23:53:07.330599Z"
  },
  {
    "source": "posts",
    "id": 448657,
    "title": "Competitive not updating",
    "self_text": "I just played 3 comp games and got no credit for them. They were wind too which makes it hurt even more. Does anyone else have this issue or is it just a weird bug?",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-06T23:53:24.624870Z"
  },
  {
    "source": "posts",
    "id": 823341,
    "title": "How can i continue playing this game without becoming toxic or tilted?",
    "self_text": "Ive reached masters in Ow1 and im stuck in plat in ow2....this shit sucks and i try to coach my team or tell them passively \"Hey lets use such and such ults here and now\" then i get ignored and i start talking shit when is start to loose since no one listens.... i have a very short fuse for ignorance and stupidity... and this game is full of it and i cant get away from it....  Ill also have moments where i ask nicely about possibly swapping and of course....once again ill get ignored and we get rolled...How does one not get upset with that?  How does one cope with trying to continue the grind when ever other lobby is just someone butting heads/trolling/throwing are im in the mentality of \"oh this shit is way to easy\" and i loose...like i know winning isnt everything but loosing fucking sucks! I wants climb to master again with how shitty this match making is....",
    "subreddit": "overwatch2",
    "selected_at": "2025-09-06T23:53:26.626179Z"
  },
  {
    "source": "posts",
    "id": 399813,
    "title": "is better russian tech tree or USA one? (rank 5-7)",
    "self_text": "i’m asking because i want rank 6 premium and i can’t decide between F5C and su25k since i already have xp50 for USA",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-06T23:54:14.066845Z"
  },
  {
    "source": "posts",
    "id": 411969,
    "title": "Tech tree best tree?",
    "self_text": "Honestly I cant find a reason to not get at least 18 tech in every play through just to upgrade weapons. Am I the only person who feels this way?",
    "subreddit": "cyberpunkgame",
    "selected_at": "2025-09-06T23:55:35.864288Z"
  },
  {
    "source": "posts",
    "id": 907461,
    "title": "You can’t do ANYTHING in Saint Denis without getting in trouble",
    "self_text": "I was bored and did 1 Antagonize at this old lady and started following her when she was running away. Boom, disturbing the peace and there were a dozen policemen around who started shooting at me. $10 Bounty.",
    "subreddit": "reddeadredemption",
    "selected_at": "2025-09-06T23:56:06.997545Z"
  },
  {
    "source": "posts",
    "id": 271794,
    "title": "I can’t be the only one who thought of legion when they saw the knights power",
    "self_text": "This what the legion could be if reworked at least give the knight ghost bros names like the legion have.  Now that we know the tech is there in the game for legion AI to work I want it a lot. Each legion could have its own cosmetic too would be fun dressing the gang up!",
    "subreddit": "deadbydaylight",
    "selected_at": "2025-09-06T23:57:04.777146Z"
  },
  {
    "source": "posts",
    "id": 669202,
    "title": "Spooky items????? wtf",
    "self_text": "I spent 250m on spooky items because the insinuation was that they would either be deleted or a new discontinued item. Now that anyone can just grab any item from a barrel it's almost worse than either of those options, more like a slap in the face to us spooky item investors!",
    "subreddit": "2007scape",
    "selected_at": "2025-09-06T23:58:55.569072Z"
  },
  {
    "source": "posts",
    "id": 1016123,
    "title": "Amount of available pokemon",
    "self_text": "I got to thinking about how many pokemon you could catch in pokemon go compared to main entry titles, and turns out there's almost twice as many to catch. And that's for a mobile game. Obviously it's not the same situation, different type of game and different code and all that jazz but how can there be 300+ more pokemon in the game. Is it just because it's connected to the internet?",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T00:07:38.877849Z"
  },
  {
    "source": "posts",
    "id": 652450,
    "title": "Mind of madness",
    "self_text": "So I love sheogorath, like he is my favorite daedric prince next to Hiricine and nocturnal.  But bruhhhh why tf is the quest mind of madness so infuriating.  I know what I’m supposed to do in each situation. But the goddamn wabbajack isn’t doing it’s one and only job of wabbajacking…  So I’m permanently looping the dream part because it keeps restarting, even though I’m hitting the correct object/ person.  Did anyone else have this problem?  Or does Pelagius just know how to press my buttons? Fuck sake this has taken me days.",
    "subreddit": "skyrim",
    "selected_at": "2025-09-07T00:08:02.715061Z"
  },
  {
    "source": "posts",
    "id": 591965,
    "title": "Uninstalling because MTS-255 revolver can't mount a Nightforce ATACR 7-35x56 34mm Riflescope or Trijicon REAP-IR 2.5x Thermal Scope (for long range anti-AMR combat for plebians who only use the .338 Lapua)",
    "self_text": "Newton's First Law of Armaments  is that a revolver shotgun must one day leave home and mate with a 35x scope to produce baby revolvers. It's what God intended.  Not even joking every single Walmart in the USA stocks revolvers preloaded with  .50 Caliber Radfree® ©   Depleted-Uranium Slugs  and a  Nightforce   ™    NF ATACR 7-35x56 34mm Riflescope . Anything less is simply  unamerican   and sacrilegious to American Exceptionalism.    This is the very superweapon that   saved the USEC   ™    Naval Seals  ® ©  from the clutches of Axis world domination in the    Second Vietnam War.    The inability to have even 1 viable revolver shotgun mounting 35x scopes - capable of firing 12/.50 depleted uranium anti- geneva-suggestion  rounds -  is absolutely a constitutional travesty on every level.  Tarkov is clearly violating my   human rights to own a scoped revolver shotgun   of every UN member state, and a testament to the tyranny of Nikita. Literally unplayable, uninstalling.    TLDR: Add scope mounting to MTS-255 revo shotty so I can roleplay as a low tier .338 enjoyer",
    "subreddit": "EscapefromTarkov",
    "selected_at": "2025-09-07T00:10:11.188506Z"
  },
  {
    "source": "posts",
    "id": 1055663,
    "title": "More main character NPCs in the Tower",
    "self_text": "Especially given the events of this expansion year, I hope that Lightfall might see us revamp the Tower a bit. Sure, I'd love to see something like \"Surprise! With the help of House Light and the assistance of Empress Caitl, we have rebuilt the original Tower/expanded the current Tower. Happy Lightfall.\" Even if we don't get this, I'd love to see more passive and active NPC representation.  Since the City Faction leaders have been gone, the Bazaar is an empty space with Ikora Rey and Hawthorne. It'd be great to have Cabal and Eliksni NPCs filling this space, even if as passive denizens. We have some Eliksni down by the Annex vending machine and drop-point, but as of now Eliksni have joined the Vanguard's tower defense forces thanks to the community event. Hopefully we see more of them around.  This feels like a great opportunity to have NPCs like Mithrax or Lord Saladin/Valus Forge representing our allies, even if just standing there with passive dialogue.  During Seasons of the Chosen and Splicer (maybe Hunt, too?), Osiris was a non-interactable NPC wandering near Ikora by the storage boxes and giving commentary.  Eris Morn is technically stationed on the Moon, but in lore she returns often to speak with Ikora as one of her Hidden. Every few hours it would be cool to see her wandering the Bazaar or down by the Drifter. Doesn't she have a laboratory space where Savathun's corpse is on an autopsy table?  Ana Bray is \"technically\" in the Tower studying the Rasputin engram with Caitl's Psions, but I don't think we have her physically present anywhere in the current Tower. That's a shame!  A passive dialogue Eido would likely be a treat, commenting on all sorts of human things.  &#x200B;  We already have this kind of thing happening in the HELM, where Crow is standing there but only does anything when specific parts of the current plot call for it.  Some small changes like this could really upgrade the Tower ambience and fill in some of the barren spaces we have now that a bunch of the old exotic quest content and secrets were sunset.",
    "subreddit": "DestinyTheGame",
    "selected_at": "2025-09-07T00:10:27.895493Z"
  },
  {
    "source": "posts",
    "id": 830089,
    "title": "Funny story from a new player",
    "self_text": "A funny Dnd story from a first time player  Some context: This was my very first campaign and I was playing a cleric healer. I had a home brew item called a bag of holding aquarium edition. It was a bag of holding with a lot of sea creatures in it.   Story time: the DM was giving us the history of the town we were going to though a ranger we met on the road. About halfway into the history I ask if I can pull a fish out of the bag. He says sure and I rolled a nat20. He describes how I pull out a 5 foot long dog shark. Which I then proceeded to stroke like a cat periodically dunking it in the bag so it can breathe. About an hour later we are at a wizards tower and I have a great idea:  Me: “hey dm, if I roll at nat1 in religion can this dog shark evolve to have wings and breathe air because Christians don’t believe in evolution?”  Other players: “Pls allow it”  Dm: “you know what, sure why not”   I roll BOOM nat1. Ladies and gentlemen I introduce Spot the Flying dog shark.  It was a lot of fun. Spot sadly died to save another player by body blocking. The best boy:)  The Dm gave Spot his own stat block too :)  Thanks for reading!",
    "subreddit": "DnD",
    "selected_at": "2025-09-07T00:11:11.969575Z"
  },
  {
    "source": "posts",
    "id": 385180,
    "title": "Interesting one shot for an all bard party?",
    "self_text": "I'm running a level 3 one shot for an all bard party and am looking for starting ideas. I want to lean away from the cliche battle of the bands scenario but still make it feel like it needed to be bard. I'm intrigued by the idea of an oceans 11 style heist where they will need to infiltrate a large party in some way to gain access. Anyone have any good modules that sound similar or any better ideas?",
    "subreddit": "DMAcademy",
    "selected_at": "2025-09-07T00:14:32.685941Z"
  },
  {
    "source": "posts",
    "id": 707751,
    "title": "What made the big three so successful in the west compared to other shows?",
    "self_text": "I've recently been wondering, what exactly was it that made Anime like Naruto, One Piece, Bleach, Dragonball and Pokemon blow up as much as they did in the West, compared to many other titles. I know, that I've mentioned the big three in the title. However, this question in my opinion applies to all of the shows that became mainstream hits during the late 90s, early 2000s.  Was it the fact that those shows had plenty of episodes compared to other shows, especially coming out after or during the OVA craze of the 80s and 90s?  Or were they just better marketed and thus managed to reach the masses?  Or was it merely a coincidence, simply because they were aired at the perfect time for kids to watch after coming home from school?  Did they do anything so spectacularly different from other (western) shows that were airing at the time?  And most importantly, why have other (modern) Anime failed to replicate this success. Sure, we have new titles that are extremely successful like MHA, AoT or recently Chainsaw Man. But I'd argue that they are nowhere near as popular, especially outside of the Anime fandom.  What do you guys think? I would love to hear your thoughts on the matter.",
    "subreddit": "anime",
    "selected_at": "2025-09-07T00:14:37.651958Z"
  },
  {
    "source": "posts",
    "id": 996787,
    "title": "The bot problem (is still here)",
    "self_text": "so I know naval isn’t big on here, but the premium bot problem for farmers is still a giant issue in naval and plagues the servers   You’d think bots are easy kills, but they travel in packs using the USS Helena or USS Moffit premiums with abysmal reload rates, which by the time you sail out of your spawn: you’re already on fire. Worst part is these bot programs now have torpedo modes, making it impossible to blitz a pack  Tale tell signs are players who normally have the Naval accommodation with the good conduct medal only, and literally 3000 games played and 2800 deaths   I’ve been playing naval since it came out and currently trying to get the HMS Hood, but it’s getting literally unplayable   What does gaijin say about it: “we keep banning them but they keep going back 😝” - literally an instagram comment   they’re not gonna do anything, anytime soon solely because a huge market of Asian players are buying premiums and premium type on deck. my type of company that doesn’t care.   Anyways that’s my rant, bots are stacking, the programs are developing, simple players like me and my buddies can’t play, while the bot users get millions of SL",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-07T00:17:12.095997Z"
  },
  {
    "source": "posts",
    "id": 932830,
    "title": "This is going to be a longshot, but I need help finding parts to the 20th Anniversary Watch that Seiko sold in Japan in 2019.",
    "self_text": "My wife got me this watch as an anniversary gift in 2019.  Her parents live in Japan, and it was a whole ordeal, and I am so grateful for all of them and their efforts - the watch is an absolute marvel.   The only issue is the band.  It was the largest size band that Japan had to offer, but my arm size is just a little bit bigger.  I  went to a watch dealer a couple of years back to re-band it, but the band he put on wasn't a perfect fit, and one of the clasps broke in the process.  What I want is, an original replacement clasp (that is, the little trapezoidal piece that connects the band to the watch, itself), as well as a few original links (5 should do it), for it to be able to fit my arm.  I'd love nothing more than to wear this all the time.  I've already contacted SEIKO and they were not much help, saying that the watch was a limited edition, and used a specific band that is virtually impossible to get parts for.  There are some bands I've found that  may  work, but it is my absolute preference to just extend the length of the original.  So, I'm hoping to source the parts from here, as a last resort.  I'd also be willing to pay for shipment and the parts, themselves.  Just...anything short of buying a second watch would be excellent.  Thank you guys for any help you can offer.",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T00:17:17.678123Z"
  },
  {
    "source": "posts",
    "id": 972001,
    "title": "Movable Hud Elements would be a nice QoL change.",
    "self_text": "Being able to move and scale either my abilities, buffs, or health and shields depending what builds I was running would be so nice.  If your playing a buff heavy frame or you use many abilities off cooldown/100% uptime. Being able to move those to more critical locations on the screen or together would be a major improvement.  If you shield gate or heal, having your squad and your health say shrunken and below/near your reticle would allow you to avoid having to look allll the way in the corners or shrinking the whole Hud elements to the center of the screen.  Maybe its just me and maybe it's just only useful for those who run endurance. So anyone would think, \"why?\". But like I have in the title, it would be a nice QoL add on. Not needed but nice to have the option because I know I would use it!",
    "subreddit": "Warframe",
    "selected_at": "2025-09-07T00:17:20.377649Z"
  },
  {
    "source": "posts",
    "id": 738958,
    "title": "So where does everyone watch the last bit or Naruto dubbed after Hulu runs out of episodes?",
    "self_text": "I remember seeing them a long time ago but I can’t find the last bit dubbed",
    "subreddit": "anime",
    "selected_at": "2025-09-07T00:17:41.595073Z"
  },
  {
    "source": "posts",
    "id": 1039561,
    "title": "What are interesting examples of subtle chaos corruption in the lore?",
    "self_text": "Something that takes a long time, can be due to the subject of corruption having good intentions and is not noticed until it is too late.",
    "subreddit": "40kLore",
    "selected_at": "2025-09-07T00:17:53.222249Z"
  },
  {
    "source": "posts",
    "id": 456428,
    "title": "Can PC/NPC be surprised if they see the others?",
    "self_text": "So, surprise rounds.   Group A and B meet in an ally. Leader of group A rolls Deception vs. Passive Insight of group B, communicates to group A to attack B. Roll = 17, highest PI in group B is 15. Group A attacks with surprise, gets full round to do move/attack. Initiative is rolled, combat proceeds normally.   Am I wrong about this? How is this run RAW?  Thanks.",
    "subreddit": "DMAcademy",
    "selected_at": "2025-09-07T00:20:06.534142Z"
  },
  {
    "source": "posts",
    "id": 350215,
    "title": "Rags to riches anime.",
    "self_text": "Looking for an anime where protagonist works hard to acquire his power and knowledge , or something like trial and error, battle of the wits (not just brute force). Examples Classroom of the elite Re:Zero Summer time rendering No game no life Mushuko tensei Rising of the shield hero",
    "subreddit": "anime",
    "selected_at": "2025-09-07T00:20:33.964622Z"
  },
  {
    "source": "posts",
    "id": 778924,
    "title": "How cutsceney is this game",
    "self_text": "So naturally I’m big into competitive games. I just like playing and beating someone else. But sometimes after a long day I don’t feel like trying hard in a game. But I’ve never been a huge fan of story games either cause I think one thing that attracted me to competitive games is your always doing something while in story games your watching cut scenes a lot. I know  there’s management and stuff in this game but that’s fine since I’m doing something. So I was wondering how long and how often are the cut scenes in this game?",
    "subreddit": "Bannerlord",
    "selected_at": "2025-09-07T00:24:17.773147Z"
  },
  {
    "source": "posts",
    "id": 506950,
    "title": "Game is good",
    "self_text": "My friend and I were hesitant to get the game due to the amount of hate this game received. We then decided to risk it and bought the game. We found out that people hated on the game because they kept comparing it to the batman games. If you literally stop comparing batman to gotham knights, you will enjoy every bit of it. Yes, the game has its flaws but doesn’t deserve the hate it got. No game is perfect, and if people stop the hate and show some enjoyment, it may give the developers more excitement and encouragement to work and deliver more content.",
    "subreddit": "GothamKnights",
    "selected_at": "2025-09-07T00:24:59.294902Z"
  },
  {
    "source": "posts",
    "id": 1024133,
    "title": "Borderlands 3 crashing when a lot of enemies spawn",
    "self_text": "Specifically at Tannis' dig site when you have to defend it",
    "subreddit": "SteamDeck",
    "selected_at": "2025-09-07T00:26:09.123571Z"
  },
  {
    "source": "posts",
    "id": 392061,
    "title": "More than the new hero",
    "self_text": "I was hoping to get some new regarding balance changes for season two and what they are planning.  I know they have a few coming up soon but nothing to help the characters who really seem to need it like doom.  I’m primarily a support but the times I play as tank I will try and start as doom and almost always end up switching.  His block just becomes useless most of the time so you can’t power up your punch and there goes your biggest attack and damage.",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T00:27:04.845514Z"
  },
  {
    "source": "posts",
    "id": 660819,
    "title": "Soldier76 Squad",
    "self_text": "Who wants to go into an arcade 5v5 no limits match and all of us play as Soldier 76? Lol  Any takers?  Xbox player here.  Let's spam grenades...",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T00:29:32.904002Z"
  },
  {
    "source": "posts",
    "id": 654107,
    "title": "The real problem with 5v5",
    "self_text": "I’m so done. The entire focus of the game got completely changed. Tank is by far the most influential role now, at least 500 health less for your team yet no other roles got tweaked. I play support with my friend and if I don’t queue with him and I have a bad tank on my team I can’t do anything. Dps and supports were given no tools to pick up the slack of a lack luster tank.",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T00:29:57.235476Z"
  },
  {
    "source": "posts",
    "id": 1000039,
    "title": "lowest ping in south island NZ is now 190 lmao.",
    "self_text": "Will it be fixed soon? And if so will I be remembered :(",
    "subreddit": "EscapefromTarkov",
    "selected_at": "2025-09-07T00:30:47.687316Z"
  },
  {
    "source": "posts",
    "id": 1015589,
    "title": "How do you feel about Ride / Bike / Special Outfits in Pokémon?",
    "self_text": "Personally, I'm of the kind that both cringed to death, and death'ed of cringe when I saw the ride outfits in Sun/Moon and the bike outfit in Sword and Shield. When I saw that ride outfits weren't in Scarlet Violet I was absolutely ecstatic, but I am curious to know, are there people that liked the ride/bike outfits in gen 7/8? For what reason? And would people like to see them again? There's also the case of special outfits used for certain scenes, such as Challenger Uniforms in Sword and Shield. I personally thought that if the champion and gym leaders are allowed their own style, anyone should as well, and found them very silly every time I had to challenge a dungeon, and even in the final tournament. What're your takes on these?",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T00:31:01.082277Z"
  },
  {
    "source": "posts",
    "id": 429392,
    "title": "Rapid Fire stratagem + Bolter discipline clarification",
    "self_text": "Hey everyone  Over the weekend we had a couple of games with my group of friends, and playing Space Marines we had a bit of a debate concerning the Rapid fire rules:  Context: 5 man intercessor squad with rapid fire bolters, that had not moved. Target ennemy unit in half range   To me this would be correct:   - Bolter discipline replaces rapid fire range anyways, so x2 shots wether or not the target is in half range  - Rapid fire stratagem allows the intercessor squad to fire again, INCLUDING the bolter discipline bonus, so x2 shots again  In total there would then be 20 shots, and not compounding to 40. After that, the ennemy player started his turn, did not shoot, declared a charge, so I used overwatch, and we agreed that rapid fire also applied, so 10 shots again   Is our interpretation of that correct, or does rapid fire not count when doing overwatch ?",
    "subreddit": "Warhammer40k",
    "selected_at": "2025-09-07T00:31:05.196673Z"
  },
  {
    "source": "posts",
    "id": 1045119,
    "title": "Immortality In Bleach",
    "self_text": "So I understand that the Soul King, Aizen and Royal Guard are immortal but are Hollows? Also how slowly do souls age? It seems like the process is widely inconsistent. Captain Commander vs Unohana for example",
    "subreddit": "bleach",
    "selected_at": "2025-09-07T00:32:14.949679Z"
  },
  {
    "source": "posts",
    "id": 264255,
    "title": "I think 3 is the first game we see Bayonetta take a punch",
    "self_text": "Looking back at the last two games I just noticed in cutscenes we basically never see Bayo ever take a physical hit - she’s only ever touched when she decides she wants to be.  Meanwhile in 3 there’s so many offhand hits that actually hit her; alternate Bayos non with standing the main Bayo actually gets pushed around quite a lot lmao",
    "subreddit": "Bayonetta",
    "selected_at": "2025-09-07T00:32:24.818486Z"
  },
  {
    "source": "posts",
    "id": 941936,
    "title": "How many hours do you game every week?",
    "self_text": "I love gaming, but at 42 I need to make sure that it remains a hobby I can control so I can chase my dreams.  So I game on two fays, weekend - for a total of 7 hours. I have found that timing my sessions and keeling each session at 1 hour followed by a small break has really helped me stay in control of the hobby.  I usually keep 3 hours for single player games, 2 hours 30 mins multiplayer and 1 hour 30 mins for gaming with my kid.  Wondering how many hours you guys game a week, and do you feel you have a good handle on the hobby or is it out of control?",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T00:34:09.667180Z"
  },
  {
    "source": "posts",
    "id": 1006494,
    "title": "Opinions on no build",
    "self_text": "I've been playing fortnite since chapter 1 season 7  and really enjoyed the freshness of being able to build as compared to the other battle royales (BRs). As people got better building it made me practice and refine my building too which made it really fun.   &#x200B;  With the introduction of no build I thought like it was fun since it went back to the pubg style BR that most games follow but it just didn't feel like fortnite. It actually feels way too easy. I know people enjoy it but it makes the game really bland and predictable. All I do is run around and kill whoever I see without the engagement of trying to out build the other person. Even though it was fun at the beginning I think the no build game mode is just a way of appealing to the players that can't build and don't have the dedication or hands to learn how.   &#x200B;  That was my little rant.   &#x200B;  TLDR: no build is skill less and outdated. Learn how to play the game scrub.",
    "subreddit": "FortNiteBR",
    "selected_at": "2025-09-07T00:34:42.021036Z"
  },
  {
    "source": "posts",
    "id": 267574,
    "title": "Did someone already made it to Diamond with the new Challenges?",
    "self_text": "Curious how it looks like because I don't think anyone has reached it yet, now I see most are platinum or gold",
    "subreddit": "leagueoflegends",
    "selected_at": "2025-09-07T00:35:49.742437Z"
  },
  {
    "source": "posts",
    "id": 551056,
    "title": "Sugar keeping the advantage of surprise?",
    "self_text": "Could sugar potentially figure out how to use her devil fruit on herself to get other people to forget about her and therefore how her powers work in order to regain the advantage of her ability being unknown, perhaps via the expansion of powers involved with devil fruit awakening?",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T00:36:15.346534Z"
  },
  {
    "source": "posts",
    "id": 363305,
    "title": "What do the Jedi think happened to Yaddle?",
    "self_text": "Did Dooku leave a note or something? Did Yoda sense her death? Was there an investigation?",
    "subreddit": "StarWars",
    "selected_at": "2025-09-07T00:36:23.591342Z"
  },
  {
    "source": "posts",
    "id": 558728,
    "title": "Can you use anything to carry around potential buying power?",
    "self_text": "I have this issue. I have a lot of different items that are hard to get and useful. Is there one item i can trade them for that i csn use for other things?",
    "subreddit": "2007scape",
    "selected_at": "2025-09-07T00:36:46.354016Z"
  },
  {
    "source": "posts",
    "id": 312937,
    "title": "As a little Ego boost for the Mercys, It would be cool if boosted damage counted on the scoreboard",
    "self_text": "With all the supports doing a heck of a lot of damage, Mercy players do get the satisfaction of ever really seeing our numbers go into 4 figures.   It would be a cool little thing to point out to players that say all we do is heal",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T00:36:47.938450Z"
  },
  {
    "source": "posts",
    "id": 459796,
    "title": "Two new Pokémon have been revealed: Great Tusk and Iron Treads",
    "self_text": "The Scarlet Book and the Violet Book📷📷  The Scarlet Book, which will appear in  Pokémon Scarlet , and the Violet Book, which will appear in  Pokémon Violet , are records from an expedition, and they were written long, long ago. The expedition is said to have traversed an uncharted area of the Paldea region, but whether or not the accounts depicted in the books are true remains unclear. It seems Arven always carries a copy of one of the books with him.  📷📷  Photographs and sketches of unidentified creatures fill the pages of the Scarlet Book and Violet Book. While there have been sightings of similar creatures in recent years, such reports are rare, and specific details of the creatures’ biology are still a mystery.  📷📷📷  The Monster Known as Great Tusk  The book describes how this savage monster attacked the expedition team with its large body and tusks, mortally wounding one of the explorers.  📷  The Monster Known as Iron Treads  It is said that when this monster curls its body and rolls to attack, it leaves a trail gouged into the ground, as if it had scorched the earth.  Note: Great Tusk will be depicted in the Scarlet Book, and Iron Treads will be depicted in the Violet Book.     https://scarletviolet.pokemon.com/en-us/news/books/",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T00:41:26.357297Z"
  },
  {
    "source": "posts",
    "id": 841155,
    "title": "we need it back in the item shop",
    "self_text": "Please psyonix let Dan see this and give us another chance for the BMW M240i 😭😭😭",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-07T00:44:21.650868Z"
  },
  {
    "source": "posts",
    "id": 890131,
    "title": "Thinking about getting New World, but can only play on controller",
    "self_text": "Hey all, really convinced new world would be a good purchase but it's make or break on how good the steam controller works. For context I play on a really nice gaming laptop but I don't have a mouse and I've got a fucked up keyboard, so playing on controller is really my only option. I've read a bit on compatibility being decent, but I really don't wanna have to switch between controller and trackpad if I can help it. Any controller only New World players who can advise me on their experience of the game? Does lack of compatibility get in the way at all?",
    "subreddit": "newworldgame",
    "selected_at": "2025-09-07T00:45:41.758021Z"
  },
  {
    "source": "posts",
    "id": 755297,
    "title": "What is your squad “Dream Team?”",
    "self_text": "What is your squad “dream team?”  Four players you’d love to see together.  Mine:   Tfue  Ninja  Bugha  Clix   Honorable mention for Daequan… he’s been out of the game too long to bump any of the four above, but he was the best streamer of all.",
    "subreddit": "FortNiteBR",
    "selected_at": "2025-09-07T15:34:04.772511Z"
  },
  {
    "source": "posts",
    "id": 763817,
    "title": "Smurfing in Ranked",
    "self_text": "Just played a ranked match, silver 3.  Got destroyed by a team that melted my teammates instantly.  Seemed a bit sus so I spectated to see their badges.  One was a level 54 octane with a 4k and a 20 kill badge.  Kind of feel like as \"Smurfing\" is a reportable offense, that they might have some auto measures in the game that might notice when a brand new player is getting those kind of badges.  As a veteran FPS player, this game took a bit of time to get decent at.  I seriously doubt a brand new player that just started playing is able to perform that well out of the gate.  Maybe they lost access to their account and created a new one, but some how I have a hard time believing that.  Thoughts?",
    "subreddit": "apexlegends",
    "selected_at": "2025-09-07T15:35:40.426357Z"
  },
  {
    "source": "posts",
    "id": 924571,
    "title": "Infinite Loading Screen",
    "self_text": "So I managed to fix my last problem.  But now I'm having the infinite loading screen.  I'll include my modlist. Everything is sorted with LOOT without problems. I am hitting some errors with xEdit but I have no idea how to fix those or where to even locate those problems.  I installed a bunch of mods today. Almost done with everything I was going for. Maybe I'll cut back on some big quest mods. But my rig should be able to handle seperate world spaced.  Modlist  Plugins  &#x200B;  I'm at 253 ESPs, so fine on that department.  &#x200B;  Thanks a bunch for sure ! It happened again, I broke Skyrim. But this time after putting a ton of hours in.",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T15:35:43.419852Z"
  },
  {
    "source": "posts",
    "id": 393968,
    "title": "Is it normal to get the random urge to start watching anime?",
    "self_text": "I’ve never watched it before, and I can’t let myself become a weeb",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T15:36:19.342809Z"
  },
  {
    "source": "posts",
    "id": 517012,
    "title": "Best combat appearance mods?",
    "self_text": "What are your favorite mods that alter the movement, killmoves, or general appearance of combat. (Preferably ones that do not require DAR but feel free to include ones that do require it to keep in mind when it eventually updates)",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T15:39:20.926174Z"
  },
  {
    "source": "posts",
    "id": 775221,
    "title": "What can I do about this annoying guessing game of locations in turns 5-7?",
    "self_text": "I don’t have the deck knowledge to predict endgame plays so I’m just out of luck during the last turns? I always feel like it’s 50-50 despite leading with all three locations. How do I play around this randomness of snap?",
    "subreddit": "MarvelSnap",
    "selected_at": "2025-09-07T15:39:24.071178Z"
  },
  {
    "source": "posts",
    "id": 381080,
    "title": "Playing Ranked is super confusing right now. Bots on steroids??",
    "self_text": "I'm on GM5 trying to get back to legends, and there are super bots?? They just surprise you out of corners already shooting at you. They wear default camos. They don't do sweaty moves. But sometimes their flaws are evident as well. Also that automatic like on you. ☠️  I don't know what to feel. They can disadvantage either way.",
    "subreddit": "CallOfDutyMobile",
    "selected_at": "2025-09-07T15:39:56.337593Z"
  },
  {
    "source": "posts",
    "id": 903411,
    "title": "Rimedieval alternatives?",
    "self_text": "Rimedieval seems to be broken currently, research isn't being unlocked even if I research 50% of my current tech level. The settings window is completely blank, so I cant turn off the research restriction either.  I'm doing a medieval fantasy playthrough and want to know if there's another mod that limits research.",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-07T15:40:10.845302Z"
  },
  {
    "source": "posts",
    "id": 352414,
    "title": "Need help with combat. What guns should I use?",
    "self_text": "I just got to the level of resarch where you can build miniguns for the first time. Is there a reason I shouldn't outfit all of my shooters with miniguns? How useful are snipers and assault rifles?",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-07T15:41:06.815273Z"
  },
  {
    "source": "posts",
    "id": 1054631,
    "title": "This white arabian horse just disappeared",
    "self_text": "Long story short my old white arabian horse died and I thought I just get another one. This is the horse that can be found by lake isabella. I’ve seen in a video that they can be caught after it died. But now I’m in the mountains and heres no horse? I’ve been looking all over the place but I found nothing. I tried setting up camp and sleeping a day, still nothing. I left rode a bit away and its still bot there. Am doing something wrong here? Is there anything I can do? Any help is very much appreciated.",
    "subreddit": "reddeadredemption",
    "selected_at": "2025-09-07T15:43:04.827662Z"
  },
  {
    "source": "posts",
    "id": 462386,
    "title": "Can Storm guide do more than basically nothing?",
    "self_text": "I was looking at this ability and thinking about some potential uses. The texts says that it can subtly change the weather by things like stopping the rain or change the direction of wind. Would it be out of the realm or thought that it could also create fog or rain around the character? Or if the dm allows, create a static cloud that affects creatures in the affected area? I can't really see much of a use for this ability without some other form of effects it can cause. Thoughts?",
    "subreddit": "dndnext",
    "selected_at": "2025-09-07T15:43:16.240805Z"
  },
  {
    "source": "posts",
    "id": 561369,
    "title": "I'm thinking about playing the game again after a year.",
    "self_text": "Do you guys think the game is in a good state for coming back or is better to wait for some expansion etc?",
    "subreddit": "hearthstone",
    "selected_at": "2025-09-07T15:43:49.402965Z"
  },
  {
    "source": "posts",
    "id": 609011,
    "title": "Too many fiefs",
    "self_text": "I am Vlandia and married Dertherts daughter and keep being given fiefs. I do not have enough companions to governor them being a clan level 3 and having 4 castles and 1 city. Can I give away a few castles?",
    "subreddit": "Bannerlord",
    "selected_at": "2025-09-07T15:51:57.717451Z"
  },
  {
    "source": "posts",
    "id": 380671,
    "title": "This Movie made me dislike Shanks",
    "self_text": "I must say that whether you liked the film, Uta or not, I felt the whole story was super forced. Before anyone says anything to me, UTA'S MOTIVATIONS AT AN EMOTIONAL LEVEL ARE UNDERSTANDING, I mean at the story/event level:  Uta doesn't seem to have lived 7 years of her life as a pirate: A girl who doesn't like to get dirty, who loves jewellery, who is characteristically naive and spoiled... Was she brought up by a gang of drunken pirates who dress like they bathe once a week and canonically plunder ships? Even their treatment of music doesn't fit, how pirates who sing Bink's Sake end up with a mini diva, who they fawn over like a goddess when she is a 9 year old girl who never had any musical education? Even in extra material she doesn't seem to know that BM is a pirate or that what is a bounty! (Uta's Diary)  Shanks is a shitty father in every way:  The reasons for abandoning Uta while understandable in context do not justify his actions, why blame you for genocide when there is a literal demon you could blame? Why not say that anyone released the demon or that a third party did it?  Why leave her with a stranger instead of leaving her with some powerful ally who could protect her or Luffy? Considering what happened with Ace, leaving Uta (the daughter of an emperor) on her own puts her in more danger than being a pirate and innocent people as well.   Didn't anyone think that leaving Uta to study to be a singer would put her in the global public eye and only bring more trouble because it would attract unwanted people who would seek her out for her DF?   Why leave your daughter, who is the only person capable of freeing a demon on the island where that demon is?   Why did Shanks never want to meet Uta again to explain the truth or at least see if she was okay once she was an adult?  Why did Shanks forget about his daughter, especially once he became emperor and had the means to protect her better than anyone else in the world both from herself and the world?  Uta could be used to get to him, even Elegy could be attacked and she could hurt innocents again in seeking to defend herself, the responsible thing would be to take Uta and prepare her to know the truth someday and be able to bear the responsibility of her power, not abandon a traumatized super-powered child to her fate and never return. But this theme is never explored, he tries to justify Shanks but Uta has worthy reasons not to forgive her father, which is a pity because this event could make Shanks more human.  Shanks is worse off if the film is not canon:  because it means that Uta was forgotten by his father and is still isolated on her island or died at some point without any closure to his conflict, but we will never get any kind of reflection or drama from Shanks about it because the film exists and Uta will never be relevant again. This is made worse when you consider that Shanks is patronised as a protector of the younger generation when the only one he cares about is Luffy. (Ch. 1055)  Suicide: they spend the whole movie trying to sell that Shanks loves her. Maybe it's just my opinion on this, but if your child doesn't want to live (commit suicide), you don't let her act on it, especially if she wants to escape reality. Letting an extremely unstable girl (drugged) suicide with her own father allowed it. The worst thing is that the justification is poor, Uta needs to sing or die to free everyone? it contradicts what was previously established by her powers and comes out of nowhere, how does Uta know that?  Extra: A good plan   ⁠Tor music attacks  ⁠Shanks beats him, uta asleep  ⁠Gordon explains the situation  ⁠Shanks takes Uta and Gordon on his boat  ⁠Uta wakes up  ⁠Everyone tells her that an earthquake destroyed the island /or that Tot musica destroyed the island but they say they don't know what the demon was.   ⁠Shanks convinces Uta that she is not pirate material and that she would be happier being a singer, besides that being her daughter could bring her problems if she becomes famous.  ⁠They leave Gordon and Uta on an island, it could be in Fusha, so she could grow up with Luffy  ⁠Shanks leaves but on good terms and with a Uta without trauma (They could still see each other occasionally or talk on Den Den/write letters to each other)  Give me a plot hole in this plan   Or left Gordon somewhere and continue with their life’s normally",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T15:55:01.143250Z"
  },
  {
    "source": "posts",
    "id": 475788,
    "title": "How the hell do I get cavalry in Vlandia?",
    "self_text": "Im playing as a vlandian and building a vlandian army but I cant upgrade my footman into light cavalry even though I have horses. Ive tried buying so many different horses but it doesnt work at all.",
    "subreddit": "mountandblade",
    "selected_at": "2025-09-07T15:55:51.537651Z"
  },
  {
    "source": "posts",
    "id": 829322,
    "title": "How do you feel about Inklings (and Octolings) being taller in this game?",
    "self_text": "I had no idea at first but once you see it you can't unsee it. They're almost like new models in this game. I wonder if it takes a bit of the uniqueness away from them, their smaller look seemed more \"cartoony\". I know, a very minor nitpicky thing to say. What do you think? Maybe they're just older in this game.",
    "subreddit": "splatoon",
    "selected_at": "2025-09-07T16:03:41.410802Z"
  },
  {
    "source": "posts",
    "id": 926433,
    "title": "Question about Mimir's boat stories.",
    "self_text": "I love listening to Mimir's stories about the Norse Gods when exploring. But I wondered, are these stories that come directly from the Norse mythology or are they tweaked or written specifically around the plot of the games?",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-07T16:03:43.729420Z"
  },
  {
    "source": "posts",
    "id": 558931,
    "title": "Is there any other alternative to Total Character Makeover and Cathedral NPC Overhaul?",
    "self_text": "For the past year I've been using Cathedral NPC. It's amazing but I'm looking to start new. I've already used Total Character Makeover in the past so I don't want to use that. Is there any other alternative to these 2 mods? I'm looking for full NPC,player and races overhauls like what Cathedral NPC did. Suggestions?",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T16:14:11.422909Z"
  },
  {
    "source": "posts",
    "id": 935876,
    "title": "Anyone feel like this chapter has been a little short?",
    "self_text": "I feel like this chapter should have been longer, feels like a lot of wasted potential.",
    "subreddit": "FortNiteBR",
    "selected_at": "2025-09-07T16:46:35.136455Z"
  },
  {
    "source": "posts",
    "id": 994454,
    "title": "Can someone explain to me how an extra deck work nowadays",
    "self_text": "Like the title above just wondering how i could utilize a extra deck cause right now im using decks that use extrav and i just have 15 random cards for banish so i can draw 2. but for decks i want to actually not use extrav and what not how does one build an extra deck or know what to put in and what not to put in. Example Floo has no extra deck monsters while like Albaz has a ton of fusion and what not.  are their any good staples i should own at least?  P.S Sidedecking as well how does one also know what to side deck against",
    "subreddit": "Yugioh101",
    "selected_at": "2025-09-07T16:49:03.009299Z"
  },
  {
    "source": "posts",
    "id": 938433,
    "title": "Netch are just big puppies, but I opened a quest to kill them…",
    "self_text": "I don’t want to kill a netch, however I opened a quest line to retrieve five things of netch jelly and I don’t want to kill netch. They’re cute and seeing the families of them hurts my heart. So two questions, do they respawn, and can I retrieve netch jelly from vendors or theft?? Please I’m begging don’t make me kill these netch.",
    "subreddit": "skyrim",
    "selected_at": "2025-09-07T16:49:33.110127Z"
  },
  {
    "source": "posts",
    "id": 439511,
    "title": "please stop suggesting lootboxes return",
    "self_text": "This should be less an issue of wanting the old monetization system back, and more an issue of them making a system that is worse than a system that was still bad. If you protest and protest until they bring back lootboxes you will be bringing back a system that guarantees nothing and is basically a virtual slot machine in which all new content will be walled behind. Don't ask for lesser evils. Ask for a consumer friendly shop.",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T16:51:49.898234Z"
  },
  {
    "source": "posts",
    "id": 527518,
    "title": "What’s your favorite Pokémon of every type?",
    "self_text": "For Pokémon with more than one type, you can just put you favorite in one category and your second favorite in the other. (ex: Magnezone is my favorite Pokémon, so I put it down as my favorite steel type and chose my second favorite electric type, Eelektrik, for the electric type spot).  Here are mine:  Normal: Dunsparce Rock: Nosepass Poison: Gulpin Steel: Magnezone Electric: Eelektrik Ground: Palossand Fighting: Throh Bug: Wormadam (Sand Cloak) Ice: Eiscue (Noice Face) Fairy: Snubull Psychic: Chimecho Water: Starmie Dark: Guzzlord Grass: Dhelmise Dragon: Garchomp Flying: Sigilyph Ghost: Cursola Fire: Heatmor",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T16:51:59.316752Z"
  },
  {
    "source": "posts",
    "id": 830512,
    "title": "Black Friday",
    "self_text": "What's everyone Black Friday purchases? I'm on PS4 and Xbox One. Right now I'm looking at The Last of Us II and Need for Speed Payback on PS4. I'm waiting until GTA Trilogy is cheaper than $15 (I have the original uncut on PS2) and the new Horizon game to be cheaper. Give me some ideas. Not a big RPG gams, but Torchlight II was a fun game, I also like Baldur's Gate I & II and Champion of Noath I & II on PS2. Fable 3 was an OK game too. I don't play online.",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T18:15:07.257378Z"
  },
  {
    "source": "posts",
    "id": 484740,
    "title": "Lack of any real endgame or final challenges is disappointing",
    "self_text": "Hi all,  So this probably isn't an original observation, but No Man's Sky really is a great game...but I wish he actually had some teeth to it as far as the main quests.  Now I know the point of the game is \"explore, explore, explore\" and trust me I am getting my fun from that...but I really wish there was a point to getting better tools and ships or that some form of even an optional final boss or challenge existed. Either a true final confrontation with sentinels or something akin to a gauntlet that tests our resourcefulness maybe.  I don't know. I've just sunk in 90 hours into the game doing the tasks presented to me in the general gameplay and defintiely have had my fun, but without something to really \"test\" my resources and upgraded on, the end game if you will feels pretty hollow. I feel like I need to sit on my hands and wait for one of HG's next major updates for something like thus, but it looks like that isn't a direction we're going.  Just some of my thoughts. Thanks for reading.",
    "subreddit": "NoMansSkyTheGame",
    "selected_at": "2025-09-07T18:15:19.020414Z"
  },
  {
    "source": "posts",
    "id": 522531,
    "title": "Making a Slave trader build any tips?",
    "self_text": "Going to make a trader/slave trader build with an Asarei using their troops blunt weapon troops. Any tips to get more money?",
    "subreddit": "Bannerlord",
    "selected_at": "2025-09-07T18:21:38.977109Z"
  },
  {
    "source": "posts",
    "id": 656022,
    "title": "cant fully upgrade my weapons even after beating all the bosses",
    "self_text": "it’s actually just one weapon and one boss but ya know spoilers. I beat all the berserkers except the last one, did all lyndworms, and did the nocturnal predator quest and beat the story. but i don’t have my last flame from the berserker. what do i do (edit) i checked my gale sparks and i only have 5 i think i just forgot to grab my reward on one of the worms",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-07T18:21:55.546601Z"
  },
  {
    "source": "posts",
    "id": 969556,
    "title": "I have a question about CGO",
    "self_text": "I've just recently started modding Skyrim, and I'm trying to basically turn it into Dark Souls.  I got a mod for full 360 degree movement, and it noted it was compatible with a combat mod called CGO, which added dodge rolls.  \"Perfect!\" I thought, but then I noticed it hadn't been updated in 2 years, and some comments were talking about issues with the mod.  My question is this: Does anyone here use CGO, if so, have you found any issues? Is there an updated version? Is there any patches for it? I wasn't able to find any of the last two in my quick search  Thanks, and sorry if this is a stupid question",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T18:22:01.055953Z"
  },
  {
    "source": "posts",
    "id": 671729,
    "title": "Korvax Data Vault",
    "self_text": "This is my korvax survivor character's remote data-vault. Technically this is a repost from a now-deleted account I had a long time ago, but I wanted this build shared regardless.  The exterior, on a dead planet in an abandoned system within Euclid Hubspace. Suspended within a sinkhole on top of a mountain-tower.  &#x200B;  The interior, display cases for reality glitches & windows everywhere.  &#x200B;  The secret data-vault itself, only accessible by teleporter activated by a hidden switch in the entry hall.",
    "subreddit": "NoMansSkyTheGame",
    "selected_at": "2025-09-07T18:22:04.120550Z"
  },
  {
    "source": "posts",
    "id": 880740,
    "title": "Which Razor advises",
    "self_text": "Hello citizens,  I have few store credit left and I’m planning to try a racing career with the new racetracks arriving in 3.18 and I really love the razor series.  I want to use the ship for racing ofc but I like my ships to be used in other scenarios too like why not a bit of pvp or other things.  And that’s why I cannot choose the best razor for me 😅  I know the LX is the fastest and is as maneuverable as the other right now ( I think it is not intended because of the description of this ship) but it lacks some poolhp (2900hp) whereas the others got more (9000hp).  The EX version is “stealth” at least it is intended in the future but will not be as maneuverable as the Razor original. But the stealth part can be a good point for him  And now the original Razor is good but I cannot see the advantage of it ? It’s maybe a good compromise between the two variants I don’t know 🤷🏻‍♂️   So, I’d you guys could give me some advises on which one could be the perfect fit for me I will be happy Ahaha  See you o7",
    "subreddit": "starcitizen",
    "selected_at": "2025-09-07T18:22:20.118924Z"
  },
  {
    "source": "posts",
    "id": 955449,
    "title": "What do you do with 507 thrumbo meat and 324 polarbear meat?",
    "self_text": "I had rare thrumbos and my colony ran out of food, so I hunted them (rip Joe \"Psycho\" Millson), a few days later a wanderer joined. A couple days after that, about 23-30 polar bears came to my colony.    Hear are the things I can do to the meat I have:     I will sell some polar bear meat to a bulk goods.    I will all make them into packaged survival meals  (need to research though).   I can let my colonists eat them raw.    I'll update this based on how much upvotes a comment that is choosing a specific number gets.",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-07T18:22:32.667622Z"
  },
  {
    "source": "posts",
    "id": 1056252,
    "title": "What rank should I be at 100 hours played?",
    "self_text": "I'm just now approaching 100 hours in Rocket League and I definitely seem to be stuck at the Plat 2/3 level.  Is this normal rank for someone with my amount of time played?  Is this bad?  I know there are ppl who have significantly more hours, but it feels like I've played a lot.  Just curious!",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-07T18:28:25.428039Z"
  },
  {
    "source": "posts",
    "id": 876659,
    "title": "Are there any tips for D.Va?",
    "self_text": "Hi I am a D.Va main and I want to get better at the game.",
    "subreddit": "overwatch2",
    "selected_at": "2025-09-07T18:29:00.856307Z"
  },
  {
    "source": "posts",
    "id": 474797,
    "title": "Looking for players on Xbox",
    "self_text": "Hey everyone I recently started playing on Xbox and am looking for others to do official pvp. If you are interested please send me a message",
    "subreddit": "ARK",
    "selected_at": "2025-09-07T18:32:04.715085Z"
  },
  {
    "source": "posts",
    "id": 410740,
    "title": "Is the monk able to reflect a reflected fireball?",
    "self_text": "I was thinking about the mechanics of the monk, and now I'm curious about it. What I mean is:  Player A throws a fireball to the monk of player B. Player B uses the ability, so the fireball gets reflected. Then, Player A uses the ability of his own monk next to the tower where the fireball is gonna be reflected. Will he be able to reflect that fireball?",
    "subreddit": "ClashRoyale",
    "selected_at": "2025-09-07T18:42:50.287343Z"
  },
  {
    "source": "posts",
    "id": 637260,
    "title": "How strong do you think Urogue is?",
    "self_text": "Out of the supernovas Urogue is the one that we by far know the least about but also might be one of the stronger ones. He dealt with a pacifista pre timeskip which was giving everyone massive troubles, also breifly clashed with killer back then. Defeated the sweet commander snack and retired him. And also because we haven’t seen him and power creep he should be presumably stronger then a character introduced arcs earlier.  So where do you think he will end up on this list? Will he be as strong as law and Kidd, maybe on zoro or killers level? Or will he just be another disappointment like Apoo and sort of drake.   Let me know what you think?",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T18:45:40.599923Z"
  },
  {
    "source": "posts",
    "id": 373793,
    "title": "Do gear perks only apply to the gear they’re on?",
    "self_text": "Do the perks in melee/ranged gear only apply to melee/ranged gear? Like a ranged gear that has a perk to increase critical chance only applies critical chance to that ranged gear? It won’t apply that perk to a melee weapon? Just wondering! Appreciate any help or info!",
    "subreddit": "GothamKnights",
    "selected_at": "2025-09-07T18:45:48.081825Z"
  },
  {
    "source": "posts",
    "id": 874536,
    "title": "God of War: Ragnarok NOT A 10/10",
    "self_text": "SPOILER ALERT     SPOILER ALERT    I want to start by saying that I think the game is a masterpiece visually. The art direction is out of this world, and the gameplay coming straight from GOW2018 means the actual gameplay is great too (if not a bit too overly familiar). The side content of climbing the living tortoise in Svartlfeim and releasing the giant Jellyfish in Alfeim for instance were also amazing.  I am however profoundly disappointed in the main story, writing and boss fights. The story never came anywhere close to moments like rediscovering the blades of chaos, undoing Kraros’ arm bandages atop the highest peak in Jotunheim, or stepping into the Light beam in Alfeim in GOW2018.   •Odin killing Thor is lazy writing.   •Artreus destroying the mask for no reason is lazy writing (he spends the entire game seeking answers. Why not just use the mask after dealing with Odin? Because that would require actually thinking up something compelling to be inside the crack in the first place. The plot point went absolutely nowhere).   •Sif/Thrud radically going 180 and turning against Odin despite us murdering her own children is lazy writing  •Freya deciding to team up with Kratos again for no reason out of nowhere after the disguised Valkyrie fight was lazy writing.   •There’s even the token sacrifice of a character scene that’s supposed to feel emotional but because they were never developed even remotely we don’t care at all (the dude with the beard and the big sword who jumps off the boat after saving Freyr). And then there’s a stupid needless sacrifice scene where Freyr sacrifices himself FOR ABSOLUTELY NO REASON. It’s just very bad writing.   •And there’s more examples than I can cite  Second, the boss fights for Odin and Thor are so forgettable. This is Ragnarok! God of War 3 12 years ago did an apocalypse better than this. This should have been an truly epic fight like we had against Poseidon or Zeus. It just seemed so lazy. So rushed.  I do not know how on earth you could play this game and call it a 10/10. The perfect game! Games journalism is a joke. Wtf even is IGN",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T18:46:11.445915Z"
  },
  {
    "source": "posts",
    "id": 577902,
    "title": "How is Bibliophile Princess?",
    "self_text": "Just wondering what the show is like as it revolves around books, and I was curious if the show was any good.  Like what can I expect?",
    "subreddit": "anime",
    "selected_at": "2025-09-07T18:57:06.324111Z"
  },
  {
    "source": "posts",
    "id": 473528,
    "title": "Are convergent species (such as diglett and wiglett) required to be completely different types? Or can they share one of their original typings?",
    "self_text": "I'm currently in the early stages of designing convergent style pokemon for most original 151 and probably some later gens too. I'm having trouble with designing some convergent partners for flying types if I'm restricted to not using their original types. Do you think a pokemon that are convergent species can share one of the same types as each other? Or should they have to be completely different typings?",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:09:53.873851Z"
  },
  {
    "source": "posts",
    "id": 578113,
    "title": "Help with follower catch-up issue",
    "self_text": "Is there a mod out there which prevents followers from appearing literally in your face?  It's getting VERY annoying and either I am shoved backwards or pushed off a cliff. ^_^  Also I end up looking at the inside of their skull (creepy view of their mouth and eyeball meshes as I slide backwards).  And for some reason it's seems to happen at the worse possible times.  Like when I am lining up a stealth shot with my bow, then suddenly my follower gets shot in the head.",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T19:11:26.443998Z"
  },
  {
    "source": "posts",
    "id": 744196,
    "title": "Can you glitch your level up SPECIAL points?",
    "self_text": "Not sure if my game is bugged or maybe my comprehension is low tonight.  I played from level 40 to level 52 without using the level up feature to pick SPECIAL points and perk cards.  So now it's letting me pick perk cards but my SPECIAL points are stuck at 46.  I'm guessing that's the 6 points I started with plus the first 40 levels.  I know you don't earn special points after level 50 but I'm either missing 10 or the spiked eggnog has lowered my intelligence points too low for me to figure what's happening.",
    "subreddit": "fo76",
    "selected_at": "2025-09-07T19:11:56.190405Z"
  },
  {
    "source": "posts",
    "id": 954851,
    "title": "Newbie questions, also Valkyrie or Cataclyst?",
    "self_text": "I'm kinda new to the game and I hope someone can get me a better understanding of these legends,  Whats their pros and cons?  Would you recommend them to a newbie?  Which weapons you recommend for them?  Sorry if I'm being a dumass, thanks for the answers! :)",
    "subreddit": "apexlegends",
    "selected_at": "2025-09-07T19:12:00.824206Z"
  },
  {
    "source": "posts",
    "id": 839271,
    "title": "wanna get the official game on mobile",
    "self_text": "I'd like to get the game on Android but I need to know if there's any discounts coming over at the playstore app, a kind and informative response would be greatly appreciated",
    "subreddit": "Terraria",
    "selected_at": "2025-09-07T19:12:46.635580Z"
  },
  {
    "source": "posts",
    "id": 847105,
    "title": "Thank you PC Gaming Modders",
    "self_text": "I have been a lifelong console gamer and at 47 finally switched to PC from Xbox Series X......Holy $hi$ I had no idea what I was missing or how much better games could look or run.  I thought Dolby Vision was sweet but this is another level. Finally replaying Skyrim....my favorite game...the way I always wanted to play it but couldn't. Modding community you are amazing!!! Thank you for all you've done and the amazing time I'm having!!",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T19:13:14.304644Z"
  },
  {
    "source": "posts",
    "id": 416756,
    "title": "can i skip the 5 min wait for secret ending?",
    "self_text": "Can i skip the 5 min wait for secret ending with mods or commands?",
    "subreddit": "cyberpunkgame",
    "selected_at": "2025-09-07T19:14:55.528145Z"
  },
  {
    "source": "posts",
    "id": 377227,
    "title": "Is there a way/mod that would dissable military clothing ?",
    "self_text": "I am looking for a way/mod that would dissable military clothing a for rp so it would feel more authentic.",
    "subreddit": "projectzomboid",
    "selected_at": "2025-09-07T19:17:42.443391Z"
  },
  {
    "source": "posts",
    "id": 1004352,
    "title": "There's one scene I wished they could have done better in Film Red",
    "self_text": "While I enjoyed the overall film, I felt that there was one scene that they could have done better, which is the twist scene where Uta has already been known the truth regarding the destruction of Eligia overall.  Although I don't think this twist ruined the Uta's motivation in film, in fact it actually helps to explain why Uta's New Genesis plan has been way too extreme, but the way movie displayed this revelation is way too consulted and confusing that it makes the viewers, ESPECIALLY the first-time viewers, difficult to understand Uta's whole motivation without supplementary material (Like Chronicles of UTA) or rewatching the movie several time to REALLY understand the plot.  What could have done is that they could add extra few lines during the twist scene with Uta saying she has no right to hate pirates, but she had to keep going because there already way too many fans listening her fans and cries about their suffering because of the pirates, and she couldn't let her fans down, or add the scene where Shanks (or Luffy) asks her why she did it and Uta responds by saying after she realized the truth, she has been consumed with so much guilt that she believed she didn't deserved to be loved, but she has to keep going as \"Pirate-hating Uta\" because there way too much fans who follows her and she doesn't wanted to let them down. And admitting that she initiated new genesis plan as the mean for atonement for what she did as well as she wanted to see Shanks one last time.  Had this scenes or lines, it would have way easier for watchers to understand why Uta did it in film.",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T19:17:56.869179Z"
  },
  {
    "source": "posts",
    "id": 663309,
    "title": "BIDOOF! I LOVE IT!",
    "self_text": "The title says it all. Bidoof is my fave pokemon below eevee and the eeveeloutions(I count them all as 1)  I have currently caught 20 and I'm trying to get a cp 1000 bidoof by upgrading or trading. And if they put LeChonk on there then I'm gonna do the same",
    "subreddit": "pokemongo",
    "selected_at": "2025-09-07T19:18:45.970446Z"
  },
  {
    "source": "posts",
    "id": 689140,
    "title": "lvl 10 toons with over 190 ilvl gear on dungeons.",
    "self_text": "Ive run a couple dungeons from lvl 10 - 20 and Ive encounter many lvl 10 people with over 190 ilvl gear, they seem to also be multiboxing since there is usually 1 of them running 1 shoting everything in the dungeon while the other 3 are on autofollow and it is really anoying because they constantly stop the run to get their other toons to follow when they get stuck, i was recencly in a run with a paladin doing just that, all 4 where lvl 10, taking a while because he has his other toons staying behind and just after killing the 2nd boss, they kicked me from the grp for no reason, this is becoming pretty anoying.",
    "subreddit": "wow",
    "selected_at": "2025-09-07T19:19:28.028779Z"
  },
  {
    "source": "posts",
    "id": 749339,
    "title": "ny thoughts of scarlet and violet so far",
    "self_text": "Honestly I like the game so far, I had fun making my character and looking at all the zany out there options for eyes and hair. Thr starters final evos aren't all great, but skeledirge is sick, and I don't hate any of them tbh. During leaks I thought it was dumb how early we got the legendaries, but you don't really have them that early, you can't use them for anything it just kinda teases it really early on. And I honestly really like walking around the big open areas and seeing wild pokemon, auto-battling is a cool gimmick. Tera stuff feels a little dull to me so far, but I haven't really messed with it much so maybe I'll cha get my mind. Haven't gotten very far, but my performance has been fine (luck maybe?) And I love the new mons, Pawmi and paldean Whooper are some of my favorite mons so far.  Have been seeing a lot of hate and tbh, I have been enjoying the games, they aren't flawless and I have some larger gripes with the game like stores not having interiors(which isn't that big a deal but it just feels strange to walk into a door and talk to a colored void about what I want to buy), and I do wish they would be kept set/switch battle settings, but I can just hit b and stay set myself so I'm not too worried abt it",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:19:48.958789Z"
  },
  {
    "source": "posts",
    "id": 1011704,
    "title": "PS5 Triggers Are Perma Stiff Send Help",
    "self_text": "I'm playing GoW 2018 on PC for the first time with a PS5 controller and as soon as I launched the game my triggers immediately became very stiff and wont stop until I close the game. Unless I'm blind I'm not seeing an in game setting for this and I really don't wanna wear down my controller so if anyone knows how to disable this that would be great.",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-07T19:27:42.435472Z"
  },
  {
    "source": "posts",
    "id": 913171,
    "title": "Probably the wrong time to ask for this, but when are we getting the whole franchise collection on PS4 / PS5?",
    "self_text": "It seems ludicrous to not have the whole saga available for purchase on the Playstation Store. Why only make it available on PS3? Seems counter-intuitive when you have a few HD collections available like Darksiders or DMC, but not a loved PS exclusive franchise.",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-07T19:28:09.482922Z"
  },
  {
    "source": "posts",
    "id": 440509,
    "title": "Can newly revealed cards maybe include the class in the title? For colorblind people like me?",
    "self_text": "Instead of: ''New Card Revealed - Chillfallen Baron''  It would be: New [insert class[ Card Revealed - Chillfallen Baron  It's absolutely irritating that I can never tell what the card is supposed to be for. And every expansion I see tons of people complain about it, it would be a nice QOL thing if we'd do that on this subreddit.  Thanks.  EDIT: Two problems:   I am colorblind, monochrome to be exact.  Death Knight uses the same ''spikes'' to identify cards as warrior does, for some god awful reason.   The only reason why I can kind of tell is because DK is a lot darker, but these reveals are like in... ice? And now I can't see it any more, again.  But yeah spells are a whole different thing. Those are impossible to identify for me sometimes. Druid? Hunter? Warrior? No clue. Shaman or Warlock? No idea.",
    "subreddit": "hearthstone",
    "selected_at": "2025-09-07T19:40:13.070448Z"
  },
  {
    "source": "posts",
    "id": 957571,
    "title": "Are there any rp servers people like to use?",
    "self_text": "Yes I know, role-play can be cringe as fuck but I've been wanting to do some modded play with roles like police or civilians and stuff like that",
    "subreddit": "projectzomboid",
    "selected_at": "2025-09-07T19:40:55.650613Z"
  },
  {
    "source": "posts",
    "id": 327569,
    "title": "Top 3 Followers for best voice lines?",
    "self_text": "I'm looking for a few followers that have lots of unique dialog for different areas in Skyrim. Or just have interesting stories etc.   I want to take them for a long playthrough and not get bored of their lines.   Not counting the sub most suggested option of Serana of course.  Edit: Not using mods",
    "subreddit": "skyrim",
    "selected_at": "2025-09-07T19:41:04.035913Z"
  },
  {
    "source": "posts",
    "id": 307333,
    "title": "Random shower thought I had",
    "self_text": "PRESENTING:  Earth Wave (Ability)  Doubles the corresponding offensive stat of the user for Ground-, Rock-, and Steel-type moves. Guaranteed immunity to sandstorm damage and paralysis. Summons sandstorm for 8 turns on switch-in. Halved damage taken for incoming Electric-type moves (if user is Ground-type, higher offensive stat is raised by one stage instead)  Yes, this is basically Water Bubble, but primarily for Ground-types, and is even more insane.",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:42:04.329784Z"
  },
  {
    "source": "posts",
    "id": 1037835,
    "title": "Nathria Gameplay Achivements",
    "self_text": "So was it publically communicated that the patch for march of the lich king goes life a whole week before actual release? Has this always been the case? If so I would really have liked a memo refresher I was still doing some achivements from Nathria for the extra experience and now they don't give it anymore.  &#x200B;  I only needed 18 more imps from Rafaam, 3 more minions destroyed after call to the stand, 4 minions for the painting, 13 minions with Dinner Performer and the easiest 126 damage with Stoneborn General.",
    "subreddit": "hearthstone",
    "selected_at": "2025-09-07T19:42:08.067473Z"
  },
  {
    "source": "posts",
    "id": 431965,
    "title": "Is Stellaris worth my time? (serious)",
    "self_text": "Hi all,  I'll be honest, I don't game properly much - I'm super busy, but when I can, I really enjoy the gaming I can fit in. I'm a hardcore starcraft: brood war fan, and enjoyed SCII when I had time for it. I'm far more likely to play mobile games here and there, broadly in the RTS genre, with some games leaning more toward factory building, others a lot like Stellaris. When my city was locked down for COVID, I bought Anno 1800, and really enjoyed that too. Next on my list of recommendations was Stellaris, and I have to admit - it doesn't seem that fun.   I see a handful of elements which make for interesting gameplay, and a rich depth of possibilities to explore (particularly with all the DLC), but I'm just not particularly enticed by the central premises to bother continuing to dig.  Am I missing something with this game, or is it just not for me? I've got plenty more on my list of games to check out, but before I go buy something else, it's there anything I should check out first in Stellaris? I know the purchase price is probably nothing to serious gamers, but I feel like this really wasn't worth the investment.  Apologies if this seems like trolling, I'm honestly looking for suggestions.",
    "subreddit": "Stellaris",
    "selected_at": "2025-09-07T19:42:10.622383Z"
  },
  {
    "source": "posts",
    "id": 566770,
    "title": "Grand Tree Quest broken?",
    "self_text": "I think my grand tree quest is broken, and i have 0 clue how to fix it. so for context, i did the entire quest normally, got to the demon part, and then the weirdness started. There was someone else down there, which is fine i guess. but they aggroed my demon first and as such i did not get credit for the kill. I assume this broke something because i tried killing 2 more demons to no avail. I cant redo it from the stick part, the king refuses to talk to me, ive looked under every root countless times and nothing works. Anyone know how to fix this?",
    "subreddit": "2007scape",
    "selected_at": "2025-09-07T19:45:31.859824Z"
  },
  {
    "source": "posts",
    "id": 317900,
    "title": "Just finished the entirety of the game and oh my god…. (lots of spoilers ahead)",
    "self_text": "The last Palace really really hit home for me. It was so hard not to give into Maruki’s reality. I know this is just a game but man it felt like he was speaking to me.   For the past 3 years I haven’t been happy with myself or the way my life has been. I really wished things were different, I even actually thought about how life actually sucks for a lot of people out there. It’s a lot of suffering, it takes so much to get out of the it. Sometimes you can’t even get out of it and before you know it you’re dead.  To me Maruki wasn’t even a villain, I will gladly live in his reality that he makes for me. It’s honestly something I wish for the most. I wish no pain on anyone. It took a lot to not cry but here I am bawling my eyes out. It honestly sucks that something like this isn’t real 😓  I can see why this could be a bad thing but a person can only take so much…  Just sharing how this game impacted me, I almost can’t put into words how Maruki affected me.",
    "subreddit": "Persona5",
    "selected_at": "2025-09-07T19:45:39.827001Z"
  },
  {
    "source": "posts",
    "id": 448572,
    "title": "Ranked Support tips/advice?",
    "self_text": "Hi, I’m a solo support main who’s having trouble getting out of Silver.  On average I win 5-6 games without a loss, sometimes making 7 in a row, and I know “stats don’t matter” but I am usually top in heals.  I play Ana/mercy/Lucio/Moira and either go mid with my tank or pocket my dps depending on the other support.  For the 4th time in a row after 7 wins I’ve ranked “up” to silver 1, so my question is..  Besides healing, what primarily should I focus on that influences ranking into gold as support? What tips do you have to provide the most value for my team outside of healing them?",
    "subreddit": "OverwatchUniversity",
    "selected_at": "2025-09-07T19:47:14.865674Z"
  },
  {
    "source": "posts",
    "id": 731059,
    "title": "I’m begging you to use the ping system",
    "self_text": "It is a very helpful strategic tool when used correctly. As an Ashe main I’m particularly annoyed when my teammates demand I kill the Pharah quickly (that’s fair) but refuse to ping them so I have to waste time trying to spot them.",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T19:47:28.392437Z"
  },
  {
    "source": "posts",
    "id": 649425,
    "title": "How to continiue readin one piece past volume 101",
    "self_text": "I strated reading one piece back in punk hazard and got to vol 101 in two weeks and now i cant continue reading the rest beacuse they dont have them on kindle or any i have found so how do you manage reading the recent chapters?",
    "subreddit": "OnePiece",
    "selected_at": "2025-09-07T19:47:35.177353Z"
  },
  {
    "source": "posts",
    "id": 807658,
    "title": "Are all the games just looking the same to you?",
    "self_text": "A little rant. Since every developing studio uses UE5 nowadays, all games start looking and feeling exactly the same. The same grass textures, snow textures, fauna and flora, mechanics, and similar monsters. It just all suddenly got so boring to me. Will there ever be something new in story-based gaming again? Now the next witcher is also being created in UE5, I can expect it will look exactly the same as God of war or Valhalla. The only game still fairly original is the Tomb raiders, and Horizon zero dawn because they have some riddles and robots. The rest is just so repetitive. Anyone else feels this way too?",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T19:48:18.303162Z"
  },
  {
    "source": "posts",
    "id": 574345,
    "title": "Am i the only one that gets weirdly apprehensive about item/follower/quest mods?",
    "self_text": "I dont really know why, i understand perfectly that the unique weapons in base game are just as balanced as many of these, and that plenty of quests are just as good or better than base game, but it just always feels like those cheat chest mods with broken gear to me. idk just wondering if anyone shared the sentiment.",
    "subreddit": "skyrimmods",
    "selected_at": "2025-09-07T19:48:20.507753Z"
  },
  {
    "source": "posts",
    "id": 667602,
    "title": "hey does anyone remember the npcs in chapter 2 or 3 that gave u heals bc you matched there emote for 5 secs or more-",
    "self_text": "Idk if it was just me but woke up at 2am to post it though-",
    "subreddit": "FortNiteBR",
    "selected_at": "2025-09-07T19:48:28.963330Z"
  },
  {
    "source": "posts",
    "id": 564711,
    "title": "Locking freighter scanner behind teleported is a very bad idea.",
    "self_text": "Learning that freighter not only got it's own independent system scanner but it's locked behind the most useless freighter module in the game was very disappointing. Let's be honest, teleport was something you probably unlock last just to 100% your freighter. It's pretty much useless, especially for a whopping price of 5 frigate modules. I understand that being able to use ship's scanner in previous versions was kind of an exploit and has to be fixed. Yet the freighter scanner basically having a cost 9 frigate module is very painful. Those are very difficult to acquire.",
    "subreddit": "NoMansSkyTheGame",
    "selected_at": "2025-09-07T19:48:56.817376Z"
  },
  {
    "source": "posts",
    "id": 384376,
    "title": "I'm new to 40k and starting my Astra Militarum army, but really like the look of AdMech. Can they be played together? (Considering buying some Skitarii)",
    "self_text": "Struggling to get my head around how different armies interact and if it's based on lore or just general balancing rules?  As far as I can tell, both the Astra Militarum and the Adeptus Mechanicus are part of the Imperium of Man.   But does that mean they can be part of the same army?  Thanks :)",
    "subreddit": "Warhammer40k",
    "selected_at": "2025-09-07T19:48:57.620790Z"
  },
  {
    "source": "posts",
    "id": 1035061,
    "title": "Gen 9's Elite Four theme is so damn good.",
    "self_text": "I'm soooo upset I got the stupid audio glitch that only loops the first 10 seconds of the song >:(. This is literally my new favorite Elite Four theme. The drums and the sick futuristic synthwave that's used work so damn well. Definitely gonna be a song I'll listen to a lot lmao. Anyone else agree or is it just me?",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:49:46.651123Z"
  },
  {
    "source": "posts",
    "id": 639651,
    "title": "How do you play the F-4C as an air to air fighter?",
    "self_text": "I have the F8U, it’s alright but it feels a little situational and the guns feel awkward to aim since it’s essentially a flying stick. Getting the F-4C next, how does it fly and what is the best way to get player air kills in it? I’m aware it has no cms at 10.0. I’ve heard mixed opinions on it, but I have seen some players decimate 5 planes in a match and stay alive. It seems like it could have potential.",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-07T19:51:23.477310Z"
  },
  {
    "source": "posts",
    "id": 576479,
    "title": "Where can I buy Fallout 1 and 2 physical copies",
    "self_text": "I just finished Fallout 1 and it is one of the best games I have played. I have been a huge fan of the series for a while and I'm starting to collect all the games physically but I'm having trouble finding the original 2. I don't like the look of jewel boxes and I don't want to buy the collection box that comes with fallout 1, 2, and tactics I want them to all be on their own. does anyone have ideas on where i can find them?",
    "subreddit": "Fallout",
    "selected_at": "2025-09-07T19:51:25.999491Z"
  },
  {
    "source": "posts",
    "id": 548182,
    "title": "how to deal with enemy healers heal chaining as winston",
    "self_text": "Just recently got back to overwatch after a long hiatus, was diamond back in season 4 and I'm now in plat, the main issue I'm encountering is when I'm playing Winston and engaging the backline supports it virtually always ends up with the enemy healers heal chaining each other. I've done the math and it's virtually impossible to kill them and for some reason my team always gets steam rolled by the enemy tank in return even when they are cut off from their supports. Is this the correct play style? Or do I have to adjust and focus on other targets instead of the supports",
    "subreddit": "OverwatchUniversity",
    "selected_at": "2025-09-07T19:52:47.448654Z"
  },
  {
    "source": "posts",
    "id": 946100,
    "title": "Is Pokemon X worth replaying",
    "self_text": "Ever since I lost my Pokémon X cartridge years ago (and still have yet to recover it) I was really bummed out that I couldn’t recover my Pokémon, so I have been considering doing it all over again, replaying my memories and catching all the Pokémon I had (besides the mythicals :(, though I’ve heard that X and Y is a fairly boring game from some so I’m wondering if it’s worth replaying",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:54:46.069156Z"
  },
  {
    "source": "posts",
    "id": 406073,
    "title": "Is it possible to prevent Dungeon Casters (like diabolists and other things that shoot through walls)",
    "self_text": "they're pretty annoying to deal with in my artificial dungeon farm (volcano farm)",
    "subreddit": "Terraria",
    "selected_at": "2025-09-07T19:55:57.125809Z"
  },
  {
    "source": "posts",
    "id": 882546,
    "title": "Why is the pokemon following mechanic so painfully slow in SV? :(",
    "self_text": "Why GF? It completely ruins the point of walking with my pokemon, when it goes back to its pokeball every 10 meters while running.  Heck, even in some point at the game you have pokemon that are actually able follow you and catch up to your running speed.   I hope they will patch that mechanic in later updates.",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:56:23.388928Z"
  },
  {
    "source": "posts",
    "id": 985426,
    "title": "An Idea for Pokemon",
    "self_text": "I've been playing Voilet and enjoying it, but I'm seeing all the posts and concerns for the lack of scaled leveling. All the talk had me thinking.   Who has played Shadows of Mordor? That game had a unique feature that I dont understand why more games do not take from. It was a nemesis system. It had different orcs that could grow with you and become leaders. And any time an orc beat you, he promoted. It is a neat idea if you have never tried it check it out.  Anyways, I think this would work GREAT for a pokemon game. Either a main title or a legends game could us this. If a trainer beats you, they promote. Maybe to gym leader or maybe to one of the trainers inside the gym. The gyms and trainers around you would always change. It would make the worlds feel so much more real and dynamic. Feels weird that you and your rival are pretty much the only two trying to really become a pokemon master in a whole world of pokemon.",
    "subreddit": "pokemon",
    "selected_at": "2025-09-07T19:57:48.906086Z"
  },
  {
    "source": "posts",
    "id": 654268,
    "title": "Is the Aurielic Quasigriffin available?",
    "self_text": "Am waiting to start playing again when the items for the mount are available. So I wanted to ask are they yet or came back? Or do I need to wait for the December event?",
    "subreddit": "elderscrollsonline",
    "selected_at": "2025-09-07T19:58:48.450759Z"
  },
  {
    "source": "posts",
    "id": 842528,
    "title": "King’s Fall Advice",
    "self_text": "Hey, everyone. I’m running KF for the first time with some friends and we’re really struggling. We studied both Kackis and Datto’s raid guides prior to going in but those guys sure make it look easier than it is. Any advice / tips from those who have ran it in the community? Any load out suggestions? Thank you!  Edit: Massive thank you to everyone for their advice and suggestions. I’ll keep you posted on how the encounter goes tomorrow morning!",
    "subreddit": "destiny2",
    "selected_at": "2025-09-07T19:59:56.165765Z"
  },
  {
    "source": "posts",
    "id": 375109,
    "title": "Trying to find my \"main\"",
    "self_text": "I want to find someone to main at all times. Currently I have the most hours on Reinhart, but I wanna be a support. The problem is I can't find a support that's able to actually survive (unlike Mercy) in a fight. So far I found I'm decent with Moria, and working on learning Lucio.. Is there anyone else like Moria and Lucio or a mix of the two?",
    "subreddit": "Overwatch",
    "selected_at": "2025-09-07T20:01:48.240279Z"
  },
  {
    "source": "posts",
    "id": 419096,
    "title": "Can't load pre-hardmode world file?",
    "self_text": "Had saved my pre-hardmode world files from Documents/My Games/Terraria/Worlds  I start hardmode, for whatever reason the corruption is in the jungle even though I put two hellevators around it. I want to go back to pre-hardmode, but even after I put in the files I had saved in another folder, when I open the game, the world is still in hardmode.  edit: I changed steam cloud settings off and moved my world off cloud, now my world is no longer showing in game even though the world files are still in the folder. What the hell.  Also noticed I only have .bak files. If I remove the .bak, I get a world file where the corruption is in the jungle but for some reason a lot of stuff is missing such as pylons and items from chests.",
    "subreddit": "Terraria",
    "selected_at": "2025-09-07T20:01:51.736637Z"
  },
  {
    "source": "posts",
    "id": 387130,
    "title": "Blissbug in a Jar",
    "self_text": "Just updated to anniversary edition and was checking out the new homestead options, I personally love the dedicated stands for the masks and paragons and claws, etc. But it’s absolutely killing me that there is a shelf for 5 different bugs in jars- and I just was dungeon slaying and found a “Blissbug in a jar” that doesn’t have a dedicated spot!!!! And there isn’t a space for Miraak’s mask with the others. Anyone else notice this yet??",
    "subreddit": "skyrim",
    "selected_at": "2025-09-07T20:01:58.309297Z"
  },
  {
    "source": "posts",
    "id": 1056261,
    "title": "anyone to play resident evil 6 with?",
    "self_text": "hey guys I’m looking for someone to play resident evil 6 with either story mode or the extra modes! I’m from Europe, PS4 preferably with a mic, thanks.",
    "subreddit": "residentevil",
    "selected_at": "2025-09-07T20:03:03.222026Z"
  },
  {
    "source": "posts",
    "id": 440264,
    "title": "Tell me a video game and I will tell you if I played it",
    "self_text": "Totally not a way to me fishing for game recommendations",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T20:03:49.699587Z"
  },
  {
    "source": "posts",
    "id": 940995,
    "title": "I feel bad for the Zelda developers. They pour their heart and soul into their games, working tirelessly to make the best experience possible. Then you have Game Freak who don't even seem to care anymore.",
    "self_text": "It really is disgusting what Game Freak can release and people will eat up day one. It is like they are being rewarded for failing.",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T20:45:39.184107Z"
  },
  {
    "source": "posts",
    "id": 1012367,
    "title": "Omens and Incense bugged?",
    "self_text": "Hello, I simply cannot grind 5 Sweetsuckle Blooms into Incense, since I've got missing reagent for that, but I already got 5 in my inventory.  And I wonder if this is simply a bug, atleast for some players. Did anyone encounter a bug in that quest?",
    "subreddit": "wow",
    "selected_at": "2025-09-07T20:45:48.541871Z"
  },
  {
    "source": "posts",
    "id": 825856,
    "title": "Ransom prisoners in Bannerlord",
    "self_text": "If I want to sell my prisoners in the tavern, I get a much much lower price than what it said on the „ransom prisoners“ button. Anyone knows how to get the full amount of gold???",
    "subreddit": "Bannerlord",
    "selected_at": "2025-09-07T21:03:10.356125Z"
  },
  {
    "source": "posts",
    "id": 630861,
    "title": "Where is the mods folder for Mac ?",
    "self_text": "Hi, I'm testing a mod on Windows and Mac installs of RimWorld, at present the mod is not on Steam of 1.4, but the download can be applied locally, I can do this on Windows... but I cannot locate the 'Mods' folder on the MacOS.  Anyone know where the local Mods folder is for Mac OS RimWorld?  Thanks",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-07T21:04:35.425357Z"
  },
  {
    "source": "posts",
    "id": 1016146,
    "title": "Secondary colours do no show up when using no decal car",
    "self_text": "For me secondary colours do not show up whilst not using a decal, on pc, using bakkesmod, disabling bakkesmod does not fix.",
    "subreddit": "RocketLeague",
    "selected_at": "2025-09-07T21:06:52.979505Z"
  },
  {
    "source": "posts",
    "id": 989850,
    "title": "The new God of War games have the single best soundtrack of any game",
    "self_text": "Bear McCreary is a literal genius.   Baldur's theme 😫",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T21:19:38.921317Z"
  },
  {
    "source": "posts",
    "id": 825296,
    "title": "Have Nanao and Ishida ever interacted?",
    "self_text": "It just occurred to me after so many years that Nanao is basically a female Ishida.  Right down to the looks and hard-ass strict personality.",
    "subreddit": "bleach",
    "selected_at": "2025-09-07T21:21:53.295584Z"
  },
  {
    "source": "posts",
    "id": 740645,
    "title": "I wanna get into god of war and play the main line games, which ones are on PS4?",
    "self_text": "I wanna get into GoW. I have known about the franchise sense I was little, but I have never played the games. I'm hoping I can play all the mainline games, if I can't play the originals that's fine, I'm hoping there's at least remakes on the PS4.",
    "subreddit": "GodofWar",
    "selected_at": "2025-09-07T22:12:19.036174Z"
  },
  {
    "source": "posts",
    "id": 961665,
    "title": "Wanted to make a shooting specialist \"Lancer Captain\" Mechinator which leads a regiment of lancers. Shooting aura don't seem to affect mechs? In fact specialists don't seem to have any synergy and is actually bad as Mechinators?",
    "self_text": "My first idea was to make a Lancer Captain (shooting specialist) mechinator which leads a regiment of lancers. But the shooting specialist aura don't seem to work at them? Is this a tool tip aura mix-up from the devs or does mechs not count as allies?  Second I tried making a Mech obsessed craftsmen guild with production specialists. But since they can't haul this causes a lot of not only non-existent synergy. But is actually damaging. Shooting specialists had (and have) the same issue of not being able to craft too. But for roleplaying I decided to suffer through assigning and reassigning them.  It seems none of the specialists, even the leader's combat command, does anything.  It's kinda sad to see that you can't hyper specialize specialists further into mechinators.  Posted this as feedback (in hopes for change). And as a PSA so people who are into roleplaying don't fall into the same traps as me thinking this would be cool thematically and interesting from a gameplay standpoint.  It really sucks but specialists don't have any good combos to offer as mechinators.",
    "subreddit": "RimWorld",
    "selected_at": "2025-09-07T22:14:01.223292Z"
  }
]