[
  {
    "source": "posts",
    "id": 822374,
    "title": "Should I file a report (a person kicking my car as I drove by)?",
    "self_text": "I was driving on a residential street near where I live, at night. The park area next to it is the site of the highest concentration of homeless encampments in town, and there are frequently people acting strange in the area, drunk or strung out or just struggling with untreated mental illness. Anyway, there was a guy walking slowly in the middle of the oncoming lane. Long hair and a beard, I assumed he was one of the local homeless.   He wasn't crossing, just walking down the street in the middle of the oncoming lane. I remember thinking that he should be careful, as people coming the other way might not see him. As I drove past, he lunged towards my car and kicked the rear door as it went by.  I was shocked.  I looked in my rear view and he was continuing down the street like nothing had happened. I was afraid to stop and get into an altercation, so I kept going. I'm quite confident that I didn't hit him, as he kicked the rear door panel, and didn't hit my rear-view mirror. I saw him from a ways off, and he clearly lunged towards me as I approached.   Obviously, I'm pissed that he put a big dent in my door, and I'd like to report it, but two things are stopping me:   First,  I'm afraid the police might assume I was spinning the story. He  did  make contact with my car while it was moving, and I didn't stop. Could this constitute a hit-and-run?   Second, I have fuck-all for a description. Again, this area is like ground zero for disturbed street people. The cops likely wouldn't care even if I had a description, which I don't. But on the other hand, on the extremely small chance that the guy decided to report it, would it look bad if I didn't file a report?  Edit: I'm definitely buying a dash cam after this. Some friends have suggested that this might be an aborted fraud attempt, and I'm thinking they may be right.",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-06T23:06:51.782003Z"
  },
  {
    "source": "posts",
    "id": 370674,
    "title": "How to feel more connected with the people around me.",
    "self_text": "Hi! I’m trying to figure out how to feel more connected with the people in my life as I am a very isolated person and I’d like to change that.  There is a huge age gap between me and my siblings so my early years were spent playing alone (they were teens when I was just a baby).  I was also a “weird kid” so I’ve always had maybe 1-2 friends at a time. Not to mention many of my friends have stabbed me in the back so I’m a little closed off.  How do y’all feel less isolated in day to day life?",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:07:39.118881Z"
  },
  {
    "source": "posts",
    "id": 327694,
    "title": "what's a good at home/online job for a teen?",
    "self_text": "does anyone know a better place i can post stuff like this?  i basically have no useful skills or hobby's btw, and idk why but im going down different rabbit holes asking the same questions gain and again.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:07:53.951084Z"
  },
  {
    "source": "posts",
    "id": 915476,
    "title": "When reaching out to apologize after a long time, should I ask if we can talk or should I just go on with the apology?",
    "self_text": "I had a major falling out with my best friend in the beginning of the year and after a lot of time assessing everything leading up to our fight, I would like to apologize to her.   I’m not expecting anything from the apology - I just want to let her know how much I value her and her friendship and what I’ve learned through this time.   Should I ask her if she wanted to talk or should I just apologize with an open conclusion giving her the opportunity to choose whether to respond or not? I would prefer apologizing in person but it’s not really possible anymore and I fear that if I ask her about it, she might not want to talk in any form at all.",
    "subreddit": "socialskills",
    "selected_at": "2025-09-06T23:08:29.360318Z"
  },
  {
    "source": "posts",
    "id": 758160,
    "title": "bro i just can not comprehend how some guys are so beautiful. like they are so beautiful i can watch them for hours.",
    "self_text": "I am so fucking jealous tbh. Mfs look like actual angels",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:09:04.512759Z"
  },
  {
    "source": "posts",
    "id": 276373,
    "title": "GF on a dating website",
    "self_text": "Just your inputs or what you think, not really advice. So my (M24) gf (F23) has been on bumble even after we came into a relationship. On being asked, she told me she didn't text anyone and the app was still there to look at profiles of pretty women. I have since, found out that she did in fact swipe right on 2 guys after the above encounter, one being her ex crush. They didn't talk there weren't texts but would it make me a horrible person if I considered that cheating? Honest inputs are appreciated",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:10:36.652379Z"
  },
  {
    "source": "posts",
    "id": 333310,
    "title": "Our entire building is bed bug infested, the management knew about it for months, but did nothing about it. My roommates and I want to take them to housing court, but are broke and have no idea where to start. Any Advice?",
    "self_text": "I made a post about the bed bug situation in more detail in another sub, so if you're looking for more details please refer to that post. Below is a summary of what we're dealing with:  Edit: we live in BROOKLYN, NYC.   My 2 roommates and I recently discovered that we had a bedbug infestation in our New York City apt. It has been beyond hell and beyond anything we could have imagined.  To top it all off, our apt neighbor told us that she has seen a bunch of other tenants throwing out bug bed infested furniture. She told us that she reached out to management at the beginning of September to warn them about a infestation in the building. She sent pictures of infested furniture that was moved outside our apt building and complained that she'd seen a dead bed bug in her apt. She started living out of bags as a precaution because she saw the bed bug in her apt. The exterminator refused to treat her apt because he says that he has to see a bed bug to do anything.  The entire building is infested  and the management won’t do anything about it. They won’t treat your apt unless they see a bed bug, they gaslight you and belittle your struggle and take months to fix the problem. Someone had to come at-least 8 times to fix our mouse problems (it is still not resolved we saw another mouse a 2 days ago) because no one cares nor have they ever tried to do a thorough job. The only reason why they have treated our apt is because we have threatened to call 311 a number of times and actually have a few times.   We regrettable signed papers after every treatment they have given us, but we will not sign anything any longer.   This is the same building that had been leaving and dumping hundreds of garbage bags worth of trash in the court yard (which they cleaned up after we called 311). People are stealing packages and there are so many issues in the apt.  After an overwhelming amount of people suggested we go to housing court( not only on our previous post, but from 311 directly, my therapist, and other friends ) we've decided to pursue legal action if possible.   We have no idea how to go about this nor do we know what resources are afforded to us. Last night we put notes on every doorstep of the tenants in the building informing them that we were pursing legal action. We provided an email and phone number that they could call to send us picture and video evidence of an the  infestation in the apt and negligence. We also advised them to call 311 and make a compliant.   We are fighting for actual maintenance of the building, care for the residents, An actually caring thorough and good exterminator for the entire building, and financial compensation for the damaged property due to the bed bugs, mice and roaches, the time it has taken to treat this infestation and the cost of washing and drying all of our clothes, our security deposit back, and any other financial compensation that we can get.  I called 311 again and made 6 complaints today 3 for our apt and 3 for the building. I am really nervous about what they are going to do next. They have been neglecting us for over a year now and we are tired of it.   We are fighting for not only ourselves, but for the people in the building who have lived under this abusive management for years. Enough is enough. Any advice or direction to resources would be very helpful thank you so much for your support!  TLDR: Our building is infested with bed bugs, management knew about it for months and did nothing and now it has spread to our apt. We are seeking to pursue legal action and take them to housing court.",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-06T23:11:21.238296Z"
  },
  {
    "source": "posts",
    "id": 469702,
    "title": "Been together 6 years and married for almost 3 yr...",
    "self_text": "He gave an ultimatum right after our really belated honeymoon that happened a couple months ago. We had some arguments on the honeymoon (story isn’t really important). Point is, he is determined for divorce. I’m trying to find a place to live and figure life out. Can anyone provide some hope and advice? What helped you? It’s been really rough on my mental health (and honestly that’s an understatement). I’ve suffered a lot of lost family relationships, health issues, surgeries, job that ended badly, and now my husband leaving (the one person I have truly cared and trusted more then anyone); all within the past year and a half. It feels like my life is in shambles.  How do you keep going?",
    "subreddit": "Divorce",
    "selected_at": "2025-09-06T23:11:25.651350Z"
  },
  {
    "source": "posts",
    "id": 528120,
    "title": "Baby girl is here!!",
    "self_text": "She was born at 36 weeks due to me not being able to control my blood sugar via c section. I spent close to 3 weeks in the hospital for it and it was so hard.   She weighed 7.1 pounds and 20” long. She’s currently in NICU because her little lungs are under developed. She could possibly spend a few weeks in there but I’m hoping she’s a fighter and we can go home soon. She’s absolutely perfect and I’m sad she’s not in the room with us.",
    "subreddit": "pregnant",
    "selected_at": "2025-09-06T23:12:47.676918Z"
  },
  {
    "source": "posts",
    "id": 556699,
    "title": "Weird objects my toddler takes to bed, what does yours take?",
    "self_text": "So far we have taken a tooth brush, a book, fake plastic screw driver and tonight’s was a banana. He does take stuffies to bed sometimes but every few nights it’s a random object. It’s so funny and cute to me😂 Anyhow what funny object does your toddler take to bed?",
    "subreddit": "toddlers",
    "selected_at": "2025-09-06T23:13:46.266028Z"
  },
  {
    "source": "posts",
    "id": 975381,
    "title": "Anyone else load up the game and find themselves unable to play even if you really want too?",
    "self_text": "This is me.  Hi, I'm suffering from Skyrim withdrawal/unable to commit issues.  I want to play my Brenton Two-handed conjuration destruction specialist but it's hard to get into it.  I could watch videos on it all day.  It's a strange place to be.  Ps.  FOR THE IMPERIUM!!",
    "subreddit": "skyrim",
    "selected_at": "2025-09-06T23:14:15.211188Z"
  },
  {
    "source": "posts",
    "id": 864562,
    "title": "Create Placecards from Guest List?",
    "self_text": "Hi all - What's the best way to export names and table numbers from our guest list in Excel to generate placecards while retaining the fonts/design we build in a template? I'm comfortable with plenty of software including Illustrator and Indesign, if that helps. Thanks in advance!",
    "subreddit": "weddingplanning",
    "selected_at": "2025-09-06T23:14:37.928661Z"
  },
  {
    "source": "posts",
    "id": 829153,
    "title": "Feeling conflicted on this one",
    "self_text": "So my boyfriend (26m) went on his first work trip. I (26f) was happy for him to get to do this and trusted him to be responsible and respectful while away.   He was distant on this trip and I told myself it was because he was busy working and learning so I didn’t message too much and just waited for his updates.   During this time I was home and got the sniffles and was a little under the weather. The last night of the trip, was the worst with communication. He told me that he and his boss were going to a bar and I told him to be safe and have fun but careful fun with his boss as at the end of the day he is still his boss.   That was at 11pm. I didn’t hear anything else and it turned to 1am and I just sent a text making sure he was okay before I headed to bed. He said that they were still at the bar and that he was leaving soon. Cool.   Fast forward to a week later, he’s on a work call in front of me and his boss starts talking about the fun they had at a strip club. This was news to me and he immediately took the phone off of speaker and turned the volume down.   I immediately knew the night he said they were at a bar was the night that they were actually at a strip club and he refrained from telling me. He claims his boss dragged him there and they stayed for hours despite him knowing that this is something I would not totally be okay with which is why he kept it from me.   I’ve been feeling like this was a breach of trust. Maybe I am overthinking but I feel unable to trust him after that. It would’ve been different if he just told me himself… but the fact that he was trying so hard to keep it a secret and I found out the way that I did is what really is throwing me off.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:15:52.143855Z"
  },
  {
    "source": "posts",
    "id": 754183,
    "title": "Driving overnight with toddler",
    "self_text": "Anyone have good tips on how they travel overnight with a toddler? Last time we tried, our stubborn little boy stayed up the entire 7 hour drive through the night!! So any tips to help with getting them to fall asleep would be great!!",
    "subreddit": "toddlers",
    "selected_at": "2025-09-06T23:16:15.413708Z"
  },
  {
    "source": "posts",
    "id": 1028271,
    "title": "Orange discolouration on nails",
    "self_text": "I(22F) have been noticing a weird feeling in my nails and fingers for past few days. Today, after removing my nailpaint, I noticed a bit of orange discolouration on the tips of my nails. I had been diagnosed with herpes a month ago. What can be the probable reasons of this discolouration?",
    "subreddit": "AskDocs",
    "selected_at": "2025-09-06T23:16:50.198299Z"
  },
  {
    "source": "posts",
    "id": 1015460,
    "title": "Did anyone develop Chronic Bronchitis",
    "self_text": "Approximately 6 months after recovering from non-hospitalized Covid-pneumonia, I started getting phlegm development in my upper airways that has continued since then.  I'm currently seeing a doctor about it, but I'm wondering if anyone else has developed these symptoms and/or if they've developed Chronic Bronchitis after a Covid infection?",
    "subreddit": "covidlonghaulers",
    "selected_at": "2025-09-06T23:17:00.120640Z"
  },
  {
    "source": "posts",
    "id": 732019,
    "title": "You have intuition for a reason",
    "self_text": "Hey y'all, as a chronic over thinker ( something that  I've been trying to curb when it comes to dating) I just wanted to share my story and maybe it can help me and some other people out.  Just a back story on my history, I've had a interesting experience with OLD.  I'm 28(m)  have been on Hinge on and off for the better part of 4 years, which has led to one of my longest LTR of my whole life (just over 2 1/2 years) Overall not a terrible experience but not the greatest either.  I met a someone on Hinge about 2 months ago and things went well from the start, gave her my number on the app and we set up a great first date. She was immediately attracted to me and I found her to be very attractive, our chemistry was insane (first 5 dates we were complimented everytime by a stranger on how well we looked together and our energy towards one another). We set up a few more dates and I was really starting to like this girl with some healthy hesitation to guard the ol Blood pumper (heart).  I wanted to figure out her dating goals early on because I feel it sets the best precedent early on for communication and for what  both party's are looking for. On the 3rd date I asked what she was looking for and her \"dating intentions\"  She said she  was looking for something  long term and has not had many dates on hinge, just uses it to see what's out there but overall she hadn't had the best experience with OLD.  We  both seemed to be in the same spot both out of our  2 year LTR relationship's ended about 4 months prior. And the topic of exes was short clear and concise. Mine ended way before it actually ended and she expressed the same to me.  Two months go by we are seeing each other 1-3 times a week holding hands, cuddling and getting horizontal (lol). She met my closest  friends, she thought they were amazing and vice versa. Overall things were going great and moving in the right direction.  Last week I get invited by her to a double date with one of her best friends(latter told I passed the friend test they really liked me), it was a great time. When we get back to my place I  ask how she feels about what we have going on, immediately I feel the whole vibe shift. She tells me she is super into me and likes me so much but is fucked up from her past relationship and makes her question her judgment about herself and potential relationships. She asked are you over your ex? I responded \"I am Absolutely over my Ex  but I totally get the hesitation I'm down to just keep doing what we are doing and see what happens\".  We had plans set up for today (11/18/2022) with her same friend group I met the other night and overall really looking forward to it.  We go 2 days  no texting which isn't out of the normal. I'm not huge on texting all the time and neither is she. I texted her to see if she wanted to grab dinner before Friday the 18th, she responded \"yes!\" and \"I'm so excited\".  About 1 hour later I get the dreaded \"It's not you, It's me, I really need to figure my shit out before I start dating\"....absolutely shook me and caught me so off guard.  I responded with something along the lines of  \"Can I please have my belongings back at some point,  I really enjoyed our time together Thank you for being honest and  I totally get it you have to look out for what's best for you, good luck and take care\". Its been 2 days and no response and I'm counting my belongings as a loss.  For some reason this hit me harder than some of my past \"flings\" maybe because of how much we had in common and we just meshed. I came to realize  I'm sad about the \"what could have been\" rather than reality.  In reality some people think they are ready to date fresh out of a relationship until they find someone who is datable and the shit becomes real...real fast. I had so much anxiety leading up to me asking how she thought things were going, I just had a strange feeling she might not be over her ex. And was calling my friends the next day telling them I might have fucked this up. Thank god I didn't wait until 6 months down the line just to be hurt more  I'm going to keep dating and live my life, maybe in a couple months I'll make a bad decision and see what's she's up to and get let down again lmao",
    "subreddit": "dating",
    "selected_at": "2025-09-06T23:17:14.073255Z"
  },
  {
    "source": "posts",
    "id": 870665,
    "title": "No one got me a present on my birthday.",
    "self_text": "I always thought I was a good friend. Our friend group was always close, we fooled around a lot, been through band camp, AP classes, and drama together. I’ve known some of them since elementary school. I remembered all of their birthdays and got them presents that I knew they would like. I barely spend any money on myself, most of what I spend is on them. There was no drama between us. We were all chill, laughing, the type of group that everyone thinks is kinda weird but we don’t really mind. On everyone’s birthday we tell them happy birthday over on discord on midnight, and tease them about it the next day at school. We give presents, buy them snacks, we have a fun time. Sometimes they have a party and we chill at their place, playing games and eating food. But on my birthday, nothing like that happened. They shared a happy birthday over on discord, and the next day at school was chill, but there was a distinct lack of presents. Don’t get me wrong, I’m not a greedy guy. I know that birthdays are more about the spirit and the atmosphere, but I don’t know. Maybe a small part of me hoped that they would repay me what I have given them. The entire day, exactly one person told me that they couldn’t afford to get me anything, and there as not so much as a birthday card given to me. I know this is a petty thing to be upset over, but I always thought that I was a big part in their lives. That I was worth at least a card with time and effort put into it. I tried holding on hope. Maybe they forgot their presents at home? But after a few days, that turned out to not be the case. I don’t show them I’m upset about it, and they haven’t mentioned it at all. I think I need to let this out off my chest. Maybe a small part of me is hoping that one of them sees this and talks to me about it. I don’t know. I know this is a small thing to get fussed about but it meant a lot to me. Sorry, I needed to share this. Advice is appreciated.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:20:22.798166Z"
  },
  {
    "source": "posts",
    "id": 881170,
    "title": "I suspect my friend’s SO is cheating on her. How should I tell her?",
    "self_text": "So, a little backround. One of my (29F) best friends (30F, let’s call her Jane) has been in a relationship for the past 10 (?) months with Jack (40sM). Jane has been through a lot in the past years, between health, family and love problems she has had quite some issues and it has been very difficult to deal with it all. For her and everyone around her.   It is also important to know that Jane has always wanted to be in relationship, and often times does everything in her power (even bending, subjugating herself and trying too hard) to make things work. Things always ended with her heartbroken.   So after finally ending a very toxic in the begining of the year, she met and quickly fell in love with Jack and their relationship became quite serious way too soon. Nonetheless, we were all very happy for her.   Recently our group of friends has started to notice red flags. For exemple, he walk by us in a neighbour city with female company and would pretend to not see us. He also refuses to post pictures online (or even be tagged) with Jane.  Our suspcions have started to confirm themselves when a friend of Jane’s (who works in the same place as Jack) started hearing rumours and conversations about Jack with other women.  Well, Jane’s friend had told us she would spill the beans but wanted to catch Jack “in the act”, but now has said she won’t say a word because she says Jane can get suicidal or even have a regression in her disease, but also because she doesn’t want to deal with the drama.   Me and my friends feel like it is time for us to step up and talk to Jane to let her know what is happening but we don’t really know how to approach her. For many times I have relied on Reddit’s helpful insights and I am hoping to do so one more time.   Should we tell her what is going on? How should we do so?  Edit: clarity.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:20:39.044152Z"
  },
  {
    "source": "posts",
    "id": 1034906,
    "title": "2 year old and sleeping",
    "self_text": "My baby just turned 2 and ever since then she doesn’t want to sleep on her own anymore in her crib, she wants me to go next to her. She cries and cries until I give in and go. Is this a thing???? What do I do to help her go back to sleep on her own again?",
    "subreddit": "toddlers",
    "selected_at": "2025-09-06T23:21:27.165249Z"
  },
  {
    "source": "posts",
    "id": 326905,
    "title": "falling back into the dark place after being genuinely fine for about 10 days :D",
    "self_text": "why tf did i have to get attached to that mf :)",
    "subreddit": "Vent",
    "selected_at": "2025-09-06T23:23:34.414828Z"
  },
  {
    "source": "posts",
    "id": 767596,
    "title": "Baby daddy wants to move to MI (from Florida)",
    "self_text": "So we’re both 35. We’re pretty happy first time parents of a 6 month old. He has savings and wants to move (of all places) to east pointe MI.  Housing in Florida is awful. We rent from my folks currently and could stay here for awhile. Although my son will eventually need his own room. I’m currently living off my savings and dealing with my own postpartum shit. Deep down I’m fucking terrified to move. Any advice?",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:23:45.441978Z"
  },
  {
    "source": "posts",
    "id": 612666,
    "title": "Do you think it’s necessary to comprise in a confrontation?",
    "self_text": "I’ve heard advice that in confrontation it’s necessary to comprise to resolve an issue.   I think it depends on the situation. I think if the compromise infringes on someone’s personal boundaries/standards they are within their right to end the relationship (romantic/platonic).  Do you think this should always be the case? Should it be the case sometimes? If so when?",
    "subreddit": "socialskills",
    "selected_at": "2025-09-06T23:24:23.644534Z"
  },
  {
    "source": "posts",
    "id": 405608,
    "title": "Shadow People",
    "self_text": "Since I was a young teen (now 26), I’ve seen shadow people. I have 4 different “people” I see. I had always thought these ghostly things were real and, some, terrifying.   I was diagnosed with Bipolar last year (pretty sure I’ve had it since I was a teen) and over time I put together that the shadow people were manic hallucinations. Since I’ve been medicated, I haven’t seen them. Not once.   Anyways, do any others see shadow people or have similar manic hallucinations?",
    "subreddit": "bipolar",
    "selected_at": "2025-09-06T23:24:47.606081Z"
  },
  {
    "source": "posts",
    "id": 946700,
    "title": "He wants to break up because he says I’m negative",
    "self_text": "My bf’s father has Covid and we were talking about the paxlovid which I had just taken last Month when I got Covid. I was was worried at first about the medications he’s already on but the doctor said it was okay. I said I felt it helped me so I’m happy he got it too. So after a bit more talking about it I said that there is a small chance of a rebound case. He got really quiet and got off the phone with me pretty quick. He then sent me a text saying: “Any other negative thing you want to share about Covid while my dad is recovering?”  I wasn’t trying to be negative. It then degraded into a whole mess of texts about how he’s having doubts and doesn’t want to be with someone who has a negative outlook.   He compared my comment to saying to someone with cancer it Might come back.   I really thought we were having a conversation and I was just sharing information.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:25:02.976588Z"
  },
  {
    "source": "posts",
    "id": 376086,
    "title": "AITA for confronting neighbourhood ding-dong-dashers?",
    "self_text": "Just to be clear if \"ding-dong-dash\" is country specific, I am talking about when children ring doorbells and run away.  I (F29) am a SAHM with a sick toddler and a newborn at the moment. My husband (M31) took some time off work when the baby was born, but has since gone back, so it is just the babies in the house day-to-day. Safe to say, I am not particularly well-rested at the moment, and the house is a bit chaotic.  Today being Saturday, my husband said that he would help me catch up on some of the chores while I got some rest. I was really grateful, it has been a tough week. Unfortunately, some kids in the neighbourhood must have taken advantage of the good weather and thought to play ding-dong-dash.  The first incident was funny, the second time was mildly irritating, but I was downright frustrated by the sixth time. The baby and the toddler were both woken/disturbed each time, and I didn't get any of the rest that I was so looking forward to. I decided that I would help my husband with chores seeing as I was up anyway.  The seventh ding-dong-dash just so happened to be when I was vaccumming the hallway, so I got to the door before the kids were gone. There were two young boys, I would say six or seven, and they got a massive shock when I opened the door.  To be clear, I was firm but I was by no means shouting or hostile. I asked them what they thought was funny about disturbing my family, and one of them responded that I was not their mom. I said back, \"I am not, but I don't think she would want to be disturbed either.\" After that, they turned and ran away. It was a very brief interaction.  Later, a man identifying himself as the boys' dad knocked on the door and said I made the boys cry. He said that it was children being children, they weren't hurting anyone, and my comment about their mom being disturbed was uncalled for seeing as she had passed away. He said that I made them both cry all afternoon and they are afraid of playing in the neighbourhood anymore. He also said that he could not believe I \"lay in wait for them.\"  I explained that I was sick and tired of the doorbell going off, but he said that I should just disarm it if some ringing disturbs my family that much. I feel like I am entitled to a doorbell, but that I shouldn't have to deal with constant ringing.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:25:19.184715Z"
  },
  {
    "source": "posts",
    "id": 363348,
    "title": "Am I heartless or does anyone else feel like other people overreact when LO is sick?",
    "self_text": "LO’s grandparents are literally crying in tears and yelling at each other / me right now because he has pink eye.   I keep getting passive aggressive texts from people who aren’t here in person about how the daycare is probably what gave him pink eye (even though it could have easily come from them too because they don’t wash their hands…)  I feel like I’m in a soap opera. Everyone is being so dramatic. I mean yes it hurts me to see him sick, but I’m trying to find an urgent care when they’re all extremely overbooked because of cold/RSV/flu/Covid season, and everyone is just yelling and texting over a disease that’s… curable.",
    "subreddit": "beyondthebump",
    "selected_at": "2025-09-06T23:25:40.640732Z"
  },
  {
    "source": "posts",
    "id": 584697,
    "title": "Why does some people just don't care at all about following the conversation?",
    "self_text": "I am really bad at having conversations but when I get into one I don't want it to stop so I keep on asking some normal questions to get to know better that person, I think that's something normal   The problem is that the majority of people I've spoken to recently just don't give a damn about anything, I ask \"what kind of music do you like?\" And they just say \"all types\" and I understand that, I also like a lot of genres, therefore, I ask another question, \"what's the song that you heard most recently\" and they say \" I don't remember\" which in this case I'll give it a pass, and Idk if at this point it's just me being stubborn or what but I say, \"well what's the song that you have stuck in your head\" and they say nothing   I don't know if it's ok to complain about something like this, because I been on the other side, someone annoying asking me a lot of damn questions, the thing is I at least try to hide it and make it seem normal, not just say the question, I make the question to further advance on the conversation, for example if you say that your favorite genre is idk Rock, well, I can say that I know some bands and we can talk about those   Yeah, I just really want some people to talk to, it's a bit annoying when I'm just laying down and I don't have anyone to talk to or discuss, maybe or thoughts about something or someone, so I try to gain trust and make friendship and I just can't, anyways thanks for reading and sorry for any mistakes, my English is bit the best, and sorry if my way of thinking or the way I said it came out as wrong, it's not my intention to hate on people who do that because at certain point I also do it but after some days of the same thing not at the very start of getting to know each other   :D",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:26:33.472090Z"
  },
  {
    "source": "posts",
    "id": 396966,
    "title": "I think my parents ignored my coming out",
    "self_text": "Im only posting this cuz I want to try to talk to them again  A few weeks ago when my family (my creater s and one one set of grand parents+bro) we in the living room.I already came out to my brother so this doesn't involve him They were All on their phones and so was I and then I told him I wanted to tell them something and basically said hey \"I'm gay I'm attracted to women you have to deal with it\" I thought they were listening but I guess not.I didn't like you a single thing out of them they were just still on their phones. and I just kind of stepped away because like it was a weird moment of confidence and I just kind of wanted to run away afterwards. so I just ran into my room. Since then I have not mentioned it at all. But I do know that my father is in fact homophobic because like months before this he he came into my room and asked \"hey are you gay\"and I did not want to come out then so I was just like  \"maybe\" And then he basically just told me\"no you can't be gay'English is not my parents first language so they were talking in like like their first language but directly translated that was basically what it was. and then he just got(pressured) me to nod and and then he left it was a very uncomfortable interaction   I don't know about the rest of my family but I'd assume they're homophobic as well. I remember the small reaction when we went to a friend's house and in the movie I'm not sure if the character was gay but he was at least acting gay and my mother just looks so disgusted   it just made me so scared to come out but yeah and my grandparents are like old and the ones that taught my father to think like that soo  They might think I was joking cuz they don't know what s*** about me my parents barely  remember or acknowledge my birthday",
    "subreddit": "lgbt",
    "selected_at": "2025-09-06T23:27:22.515670Z"
  },
  {
    "source": "posts",
    "id": 668643,
    "title": "College is great",
    "self_text": "I've developed 10 new insecurities and discovered a new lack of self worth.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:27:49.164389Z"
  },
  {
    "source": "posts",
    "id": 455865,
    "title": "Broken up for 4 years already",
    "self_text": "So I just found myself sobbing like crazy. I can’t breathe and just can’t stop crying. He’s my first love and damn, I loved him hard. It was an unhealthy additive love too. Now looking back I was such a possessive and passive aggressive person and hating myself for it. I don’t know what to do right now, I just want to be okay. Just okay not thinking about him anymore. He is happy now with his girlfriend of 2 years. Yes I know how long they’ve been together because we kept in touch , we were good friends (like I was with him whenever he’s in a dark place) but I cut him off last year only for universe to make fun of us and let us meet and talk again on this anon site. When we spoke that time, he confessed that sometimes he wishes that it was me who’s with him blah blah but he also told me that I am the best and worst for him. And I actually agree to the latter. Right now, he is still the love of my life maybe because he’s the only person I’ve loved (family excluded ofc). I’m really just venting right now to help me unload all these feelings I have.   Typing this while my eyes are hurting from all the crying. I managed to stop crying now but everything just feels so heavy.",
    "subreddit": "BreakUps",
    "selected_at": "2025-09-06T23:28:24.255637Z"
  },
  {
    "source": "posts",
    "id": 857852,
    "title": "I tried selling feet pics to make extra money but I think I got scammed.",
    "self_text": "I tried to sell feet pics to make extra money. I texted the client and his accountant. The money went through but his accountant keeps wanting me send money to random people. The client paid $3000 but I paid $2000 of it back. I just worried if they come back and sue me for fraud but I block both phone numbers.This not what I sign up for and I know they where scammers. I need and advice and afraid they will sue me for fraud.",
    "subreddit": "legaladvice",
    "selected_at": "2025-09-06T23:33:48.341614Z"
  },
  {
    "source": "posts",
    "id": 293386,
    "title": "Does long hours of headphone use cause male hairloss?",
    "self_text": "As the title states, I've heard a lot of people say it doesn't and that it's just a myth and that there are no evidence, whilst others claim that it can cause \"traction alopecia\". Which results in hair loss  In regards to the argument that long uses of headphones can cause \"traction alopecia\", how does this apply if the headphones are not pulling your hair, rather they are just pushing your hair down (due to some guys having long hair), are is headphones pushing down on your hair also considered a form of traction alopecia",
    "subreddit": "tressless",
    "selected_at": "2025-09-06T23:34:50.704586Z"
  },
  {
    "source": "posts",
    "id": 938552,
    "title": "Getting hurt in relationships",
    "self_text": "I have trouble with relationships and trusting people. I grew up in a dysfunctional family and I have attributed my difficulties to that. Now I'm wondering if it's adhd.  Does anyone else feel like they are bothered by things others just let go? Or have a negative reel of thoughts in their head? Or feel like people are just going to hurt you so what's the point?",
    "subreddit": "adhdwomen",
    "selected_at": "2025-09-06T23:34:56.694289Z"
  },
  {
    "source": "posts",
    "id": 608225,
    "title": "I just need someone to talk to.",
    "self_text": "My girlfriend (who was my best and only real friend) cheated on me and left me a few months ago, I’ve started to get better which is good but I’m lonely asf, my ‘friends’ only talk to me if i start the conversation so i’ve gotten the hint that they don’t really want to talk to me. I don’t get tired anymore, probably due to a bunch of mental health issues that we won’t go into but anyway i find it very hard to sleep and so here i am asking online strangers for someone to talk to about literally anything :)",
    "subreddit": "lonely",
    "selected_at": "2025-09-06T23:37:33.630331Z"
  },
  {
    "source": "posts",
    "id": 490951,
    "title": "Job interview",
    "self_text": "Hey I’ve just finished my job interview. It was at a local supermarket in my area, I think the interview went well, he was asking me about my experience and work values.   During the end of the interview he asks me if I have any questions for him… I’m not sure why, but I asked him his thoughts on existentialism…   I didn’t even understand the reason why I asked that. It just came out! He then said he didn’t want to get political and it’s not appropriate to ask this during a job interview. Did I fuck it up? I can’t tell, I’ll give an update anyway to see if I get the job….",
    "subreddit": "antiwork",
    "selected_at": "2025-09-06T23:38:05.792770Z"
  },
  {
    "source": "posts",
    "id": 848357,
    "title": "AITA for telling my easily nauseous wife that she can just drive herself?",
    "self_text": "My wife gets car sick easily, one time she even accidentally puked on some friends in the back seat on the way home one night but you get the picture. Well she noticed recently that when I am driving us everywhere(I use that word intentionally) that she feels better when I always have 2 hands on the wheel. I am not opposed to driving with both hands on the wheel but also my first car ever was an '89 Jeep Wrangler manual and I drove a manual all throughout college so I admit it's gonna take some behavior modification to fix. I drove us back from the lake this weekend 2 1/2 hours and I did try but old habits die hard and my wife was back seat driving the entire way home. I mean literally anytime I took my hands off from taking a drink or itching something it was \"two hands on the wheel\" 😑 So tonight I am driving us home from an awesome date night and 5 mins from home I'm making a turn when she harshly says two hands on the wheel. I said I was turning and started to get frustrated when she basically blamed me for feeling sick when I drive her. I say fine simple solution, we can drive separately or you can drive me. Problem Solved. Absolutely Not because she hates driving herself.  A huge argument that I feel is ridiculous. I don't mind driving all the time but who likes a back seat driver. And her solution is asking me how I would like to receive the criticism. I said I don't really think it's up to me to figure that out but if she must say something, be gentle, be cautious of your tone and what you say??? But in her head the way she is doing it is the only way to fix \"my problem\". I said well you can't figure out a way to address my driving in a way that doesn't make me feel attacked, then I can't drive you. And now just tears and it's somehow my fault. AITA?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:38:26.093196Z"
  },
  {
    "source": "posts",
    "id": 959780,
    "title": "WIBTA if I refuse to have Christmas at my brother’s house?",
    "self_text": "Burner account. My brother (M36) moved away about an hour drive, he lives there with his wife and kids (3,1). His entire family works from home. I (F32) work in healthcare and have to commute 15+hrs a week. My husband has also been having health issues over the past 18 months which have been very difficult, physically and emotionally for us to deal with.  We’ve been having arguments about family visits- my brother would like me to go over every week or every other week which is difficult for us to do that regularly. I’ve asked if we could have it so that we drive over once a month and they drive down once a month but my brother says it’s too difficult with the kids to be in the car.   He has said some mean things to me when I’ve been unable to go for several weeks in the past (we had a 6 week streak of covid and other issues getting in the way) and he basically stated he was telling his kids they don’t have an aunt because I don’t care to see them.  For months we had agreed I was hosting Christmas this year. In my culture we celebrate on Christmas Eve. He asked that we have Christmas at his house because of the drive. I’ve taken time off work before the 24th to be able to prep the turkey and get things ready, I’ve decorated quite a bit because last Christmas was shitty with what my husband was going through and the ones before were covid, so I was pumped to have a great time this year. I should also mention that I have space for them to sleep over if they prefer. He said that when I have kids, we’ll spend Christmas at my house and that since his kids would be older they’ll visit more frequently. But I know that my brother can be lazy and will come up with something then (as teens, he would make me go buy him McDonald’s in winter while he stayed in the house for example).  So WIBTA if I tell my brother off and insist we have Christmas at my house? I don’t have kids atm, so I’m sure I don’t grasp how difficult the drive can be.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:38:47.320321Z"
  },
  {
    "source": "posts",
    "id": 512121,
    "title": "What would u rate urself?",
    "self_text": "I would rate myself a 3 or 4",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:39:12.799484Z"
  },
  {
    "source": "posts",
    "id": 445912,
    "title": "I Just lost my job today",
    "self_text": "I knew it was coming. We have been slow for 2 months, about as long as I have been on workers comp for an injury. They completely removed my position. I have about 2 months in my savings. This is not helping my anxiety or depression. Send me your love that I make it through. It took me 2 months to find a job last time. I'm just hoping I don't spiral deeper into depression, or have my anxiety keep me up for days sparking mania. I hope I just get more stable. Idk. Any advice on how to manage this level of stress?",
    "subreddit": "bipolar",
    "selected_at": "2025-09-06T23:40:40.790702Z"
  },
  {
    "source": "posts",
    "id": 487053,
    "title": "I need some help",
    "self_text": "So I can only really wear tights due to sensory issues with wearing anything else on my legs (I can also wear pjs and joggers) but the problem is they aren’t very thick because thick ones cause me to overstimulate. But it’s getting cold and I want to be able to keep my legs warm. My husband suggested that I get slightly thicker, velvety or softer tights to wear. I want to but I’m worried about it. Does anyone have any tips that might be able to help me get through this? He suggested I wear them at home first to try and get used to them before I go out in them and risk not being able to take them off quickly",
    "subreddit": "AutismInWomen",
    "selected_at": "2025-09-06T23:41:11.798653Z"
  },
  {
    "source": "posts",
    "id": 501287,
    "title": "Friends and Mental Health",
    "self_text": "I dont know what to do. I (F20) live in a big house with my friends and two (F20,F,21)of my closest friends are severely depressed. one is waiting to see a therapist and the other one completely refuses. I recently began feeling happy for the first time in a while because i’ve struggled with depression myself.   i want to be there for them and i’ve always allowed them to rant and i know it helps them and it’s what they need especially since our other friends in the house aren’t really good at that type of thing but holy shit it’s becoming almost constant. I can’t go a day without someone telling me how much life sucks and how depressed they are and i listen and offer advice and support but i’m starting to feel like it’s taking a toll on my own mental health. i can’t go back to feeling that way.   I wake up sooo happy every morning for the first time in my life and i feel like the constant reminder of how bad it can get again is going to make it get bad but i can’t not support them. especially because we live together.   side note it’s kind of weird now being not depressed bc i can’t even see things thru their view point for some reason even tho i’ve experienced it.  Like yes, i do know the feeling of hoping i don’t want up tomorrow but also how could you not want to wake up tomorrow?! and they can’t see things they mine. it’s like i’ve been on both sides and i would always get so annoyed when i was depressed that people couldn’t understand what i felt  edit: it kind of makes me feel guilty for some reason. like im a bad person for feeling good while they’re struggling? also my friends didn’t know me when i was really struggling so everytime they talk about how they won’t get better and i try to mention that it’s possible- i know from experience - one of them kind of acts like i could have NEVER felt as terrible as she does / was never depressed  tldr; im worried my friends/roommates poor mental health is going to take a toll on my mental health",
    "subreddit": "relationships",
    "selected_at": "2025-09-06T23:41:31.321970Z"
  },
  {
    "source": "posts",
    "id": 910647,
    "title": "It’s never the right person",
    "self_text": "I’m kinda just convinced that I’m the problem. I don’t like anyone. I don’t enjoy being alone, but I don’t enjoy being around other people either. I guess it’s depression. I don’t know what to do about it. It’s not good.",
    "subreddit": "lonely",
    "selected_at": "2025-09-06T23:41:38.761118Z"
  },
  {
    "source": "posts",
    "id": 506059,
    "title": "I have just asked out my 6th lesbian. What am i doing wrong?",
    "self_text": "Hi, I'm currently in college and have expended my horizons quite a bit. It's been a while and I think I've found my type. Unfortunately my type is lesbians/ace which as a straight male, Is kind of counterintuitive. Recently I've hit a bit of a bad streak where I've gotten to know a woman. Seen that she is level headed, funny, and smart. I decide to give it a shot and ask them out for the shocking truth that they are a lesbian. Back away from dating scene for a bit then try again for same result. How do I find someone that I truly love and live with but is also attracted to me?",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:42:35.543485Z"
  },
  {
    "source": "posts",
    "id": 692565,
    "title": "what makes someone come up on quick add on snapchat?",
    "self_text": "my boyfriend mentioned a few weeks ago his ex tried adding him on snapchat but he deleted, i was just then scrolling through quick add and she came up as “recently joined”. why would she come up on my quick add? we 100% would have no mutual friends i only have my closest family and friends on snapchat, or is it just a coincidence?",
    "subreddit": "ask",
    "selected_at": "2025-09-06T23:48:43.084936Z"
  },
  {
    "source": "posts",
    "id": 507205,
    "title": "any advice?",
    "self_text": "So I'm a 17 year old due I graduated a year and a half ago from a military type school and I've moved more Tom's than I can count I love fitness working out and alot of nerdy shot like manga but I can't talk to people like I have crippling fear even text or internet stuff I just get too scared ig and I dunno how to fix my anxiety or nervousness",
    "subreddit": "socialanxiety",
    "selected_at": "2025-09-06T23:50:06.681905Z"
  },
  {
    "source": "posts",
    "id": 727574,
    "title": "Feeling a little anxious, could use someone to chat with.",
    "self_text": "I’ve been feeling very anxious and sad today. (Please don’t ask me about it).  I’d like some positive people to chat with, just no one over 21 please as I’m only 16.",
    "subreddit": "lonely",
    "selected_at": "2025-09-06T23:51:29.217537Z"
  },
  {
    "source": "posts",
    "id": 492325,
    "title": "Felt lonely",
    "self_text": "I was feeling really lonely and depressed so I wanted to talk to people. But since no one speaks to me mostly irl, I made a discord server to do the same. If anyone wants to join please dm me for the link.",
    "subreddit": "venting",
    "selected_at": "2025-09-06T23:51:57.675848Z"
  },
  {
    "source": "posts",
    "id": 672269,
    "title": "Cut meat out of my diet",
    "self_text": "Not sure if this is the right place to put this, but I recently cut meat out of my diet, and I’m starving all of the time, I feel like I did when I was binge eating, I still try to prioritize animal Protien (eggs, milk, cheese, occasionally fish) but I’m still starving. I’m worried I’ll gain the weight back. Any suggestions on how to curb the hunger?",
    "subreddit": "WeightLossAdvice",
    "selected_at": "2025-09-06T23:52:13.927702Z"
  },
  {
    "source": "posts",
    "id": 795184,
    "title": "My autistic friend doesn't ask questions about me",
    "self_text": "I have an autistic  online  friend. They are very kind, supportive and funny, and I love chatting with them. I want to get to know them better and that's why I ask them many questions about themselves, but they never do the same in return. And due to it, I feel like they are not interested in me, but I'm just being annoying and intrusive.  I tried to hint to them that I want them to ask me questions, but after a while, I learned that autistic people may not understand hints. So I tried to tell them about it more directly (something like \"It is important to me to ask each other questions in our friendship\"), but they still didn't ask me any.  Yes, they tell me a lot about how much they love and value me as a friend, and I know that an autistic brain works differently, but I still don't know what to do.  Do I have to tell them directly \"I want you to ask questions about me\" and explain why it is important to me? Or just randomly write stuff about me even if they don't ask for it?",
    "subreddit": "autism",
    "selected_at": "2025-09-06T23:52:32.855516Z"
  },
  {
    "source": "posts",
    "id": 457760,
    "title": "I got drunk and pissed on my girlfriend’s rug. I need some help with how to deal with this. I don’t know why I did it.",
    "self_text": "I don’t really know what to say. I don’t remember much of it but I’m very embarrassed.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:52:34.969670Z"
  },
  {
    "source": "posts",
    "id": 781796,
    "title": "AITA for refusing to go on my boyfriend’s birthday trip because his friends want me to be his present?",
    "self_text": "It’s my boyfriend’s birthday soon and his friends are planning a trip to celebrate. I wasn’t originally invited which was fine with me as they’re going to party and gamble which isn’t my thing but now they want me to come because they think I’d make a great surprise present for him.  The way it was sold to me was that I would be alone for a few days before they revealed the surprise and that I couldn’t tell my boyfriend or anybody else I would be there. I said no because it honestly makes me feel gross that they want me to go only to sleep with him and to pretend I’m not there for the rest of the time.  They’ve offered to change the plan around if I’d agree to go and his best friend has been guilting me by saying my boyfriend would want to see me on his birthday so I should do it for him. Another friend has also made unfunny jokes about how they would have to find a replacement gift if I didn’t go.  AITA for refusing to go?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:52:42.493602Z"
  },
  {
    "source": "posts",
    "id": 926430,
    "title": "22f, 21m, do i tell my s/o about my thoughts of breaking up with them? how do i do it?",
    "self_text": "tldr: i have thoughts of breaking up but i dont want to. how do i bring up these issues w my s/o without hurting their feelings and showing that i want to make this work? we've been dating for half a year.  weve been dating for half a year and were best friends for like a year before that, been doing ld for a few months now. things have been great even though there has been a handful of disagreements - i think weve always been able to reach a conclusion and forgive each other/make a plan to change.  their job takes up more time than mine and they always say how tolling it is to visit me because of the drive. the thing is, i make the same drive. but i WANT to visit, i love seeing my s/o. and even tho ik they love me, them constantly telling me they dont want to visit - or even when they visit they dont seem to be enjoying themselves - its really tolling on me. ever since they told me how much of a burden it is to travel to me (a few hour drive), ive been very understanding and have been visiting them alot.  additionally, because of how busy they are, even though they do make me a priority and is see the effort, it doesnt seem enough. idk if im expecting too much. they seem to be in their own world bc of how much they have going on w their own life. i def have my own separate life too but little things like they dont rmr things i said, or they dont seem to be listening propoerly.  were going to be long distance for atleast 1.5more years if not more. i dont know if i can do this anymore. i love my s/o and theyre my best friend but im young and i dont want to sit here and be sad or expect more. ive briefly talked to them about it and plan on talking to them again.  this time, i want to bring up that ive been having doubts abt long term and basically say everything ive said on this post. how do i say it nicely and word it in a way where i want to show i want to make this work but that i just want to see change from their side?",
    "subreddit": "BreakUps",
    "selected_at": "2025-09-06T23:54:05.170188Z"
  },
  {
    "source": "posts",
    "id": 660761,
    "title": "My (M32) BF (M27) always disagree with me and it makes me angry.",
    "self_text": "So my BF does this thing where he needs to disagree with me on the most mundane conversations. Sometime he’ll even use negative stance to agree with me.   He is not the most educated, nor the most political, or cultivated person. But sometime he talks like he studied psychology for 15 years and it makes me loose my mind. I have a very impulsive personality, and I can get angry real fast (working on it with a therapist). I don’t like when he talks like he know something, when I obviously know he doesn’t l, or at least doesn’t know more than me. It just pisses me off.   I don’t even know how to describe clearly his behaviour since it is so subtle sometimes. The thing is I repressed thoughts or conversation I’d have with him, just because I expect how he would answer me, and I know it will get me in a bad mood.   I feel like he always make conversations so argumentative and he pins that on me, since I fought back to what he said. And sometime I loose my shit and get angry and start having a rougher tone and words   When I bring that behaviour to him, he said he didn’t contradict me at all, that it is all in my head and that I have been mean to him. To be honest, it is true, sometimes I’ll use words I shouldn’t, and I often sincerely apologize for it. But when I talk to him about what he does it’s like he doesn’t realize, and makes me second thought my feelings. Did he really got argumentative or is it just me interpreting it this way?  I don’t know what I came to find saying all that here. Mostly I’m feeling alone and I don’t know for sure I’m not imagining all this. I feel like I’m the only one that could do better in our relationship. If I’m honest I think i’d like to hear that I’m right to loose my shit when confronted to this behaviour constantly, but if you think otherwise feel free to say it. I sincerely want to do better, but don’t know how.   TLDR; my BF always disagree with me and it makes me loose my shit because I feel cornered in the most mundane conversation we have.   PS: English isn’t my first language.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:54:19.445555Z"
  },
  {
    "source": "posts",
    "id": 922842,
    "title": "How to overcome social awkwardness and the feeling of being easily drained in social situations?",
    "self_text": "I want to make friends and spend more time with my family but I get drained so quickly from social situations and have a tendency to be really awkward when conversing (I fumble with my words, I don’t know how to fill awkward silence because I only speak if I have something interesting to say, I never know what to do with my stupid hands, and sometimes I’ll speak without thinking and say something stupid...).  It’s so frustrating because I feel lonely and rarely leave the house or talk to anyone anymore because I’ve been taking classes online at a college that’s too far away.",
    "subreddit": "socialskills",
    "selected_at": "2025-09-06T23:55:20.453509Z"
  },
  {
    "source": "posts",
    "id": 313271,
    "title": "AITA for wanting to know what my husband spends when he asked to double his allowance?",
    "self_text": "When my husband and I got married we merged finances, so that his paycheck gets deposited into our joint account and about 60% of mine goes into the same account. The other 40% of mine goes into an account that pays the mortgage and is used to make our monthly contributions to our brokerage account.  The reason we have it set up that way is I bought my apartment right when we started dating, and so I pay for it all with my earnings out of an account where I get a discount on the mortgage rate, and that’s why part of my paycheck is directly deposited into it.  When we got married my husband didn’t want to transition to joint credit cards, so we each have our own cards, and his is paid from his checking account and mine are paid from the joint account. All of our bills are paid from the joint account or via my credit cards, which are paid from the joint account. Since all of our bills (car, apartment maintenance, garage, utilities, cleaning person, etc.) and pretty much all of our joint meals, groceries, travel, discretionary spending, etc. are all paid from the joint account or on my credit cards, what I’ve been doing is transferring a set amount to his checking account every month, which was an amount he said would be enough for his expenses.  I just checked his checking account though, and his credit card bills are more than the amount of the allowance I deposit every month. I asked him if he needs more, and he told me that he needs double what he is currently getting. He has access to our joint account and can use it for any spending or to take cash out at any time. I think if he wants to double the amount of spending money he’s getting it would be nice to know what he is spending it on.   AITA for wanting to know how much he is spending and on what? (I doubled the monthly transfer amount already, so it’s more a matter of curiosity, not a condition of him getting more).",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-06T23:55:37.899321Z"
  },
  {
    "source": "posts",
    "id": 428333,
    "title": "Is my partner pushing me away",
    "self_text": "Two days ago my partner asked if we could break up because they don’t have the mental capacity to maintain this relationship even tho there’s still love between us, i understand that the past month was difficult for us and we were both trying to make it work and giving each other space but now I was shocked to hear what they had to say and how “I don’t deserve a cold partner” and they can’t put effort into us anymore  Also this has happened few months ago early in the relationship they thought about breaking up because they were burnt out and “I deserved better” and I told them we can make it work and we did it bought us even closer than before, I can’t help it but think maybe this is their way of pushing me away because they think they’re not good enough, I know we have so much love understanding and good communication and I believe we can make it work but I also don’t want to invalidate their feelings and if they really want this but I don’t want to give up on us without a fight we both are in love and it’s the healthiest relationship to the both of us  Please help me with my situation what do you think",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-06T23:55:56.142277Z"
  },
  {
    "source": "posts",
    "id": 1002012,
    "title": "1 Year Anniversary Ideas?!",
    "self_text": "It's mine (20 M), and my gf's (19 F) anniversary in about a week and I can't think of something to do for our anniversary! She loves lots of different anime, bts, marvel, and Disney to an extent. She also doesn't want to have a dinner date which was my original idea at Mt. Fuji 🥲. So now I'm scrambling to figure out where to take her that'll be thoughtful and fun! Budget isn't too much of an issue as I've been saving up for a while now and I just want her to enjoy our anniversary as much as possible! So if anyone has any ideas of things to do or places to go in the NJ/NYC area id greatly appreciated it!",
    "subreddit": "dating",
    "selected_at": "2025-09-06T23:57:14.512600Z"
  },
  {
    "source": "posts",
    "id": 737755,
    "title": "Teachers can really suck man",
    "self_text": "I had the worst teacher ever in 6th grade. I'm in high school now but I just remembered this.  Let's call her Ms. Davis. (Ms. Because who would marry this monster)  She had a walker, not important but whatever. There were these two boys in my class who thought they were the funniest people alive. Constantly making inappropriate and verbally assaulting remarks about me/to me. (I'm a female, so there was more of this to come.) One day, they made a joke about my chest. Obviously I was getting sick of this, so I raised my hand and told the teacher. And you know what she did? She yelled at ME because I had not only interrupted class, I was tattle telling and being ridiculous. She did nothing, and I got detention. The harassment went on. Another day, the most annoying one (We'll call him J) Is making inappropriate jokes again. So you know what fed up with all this me does? I slap him, hard. They stopped after that. Thanks a lot Ms. Davis.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T00:07:44.233893Z"
  },
  {
    "source": "posts",
    "id": 783804,
    "title": "i like the idea of dying young so much, i wouldnt mind it if i died right now",
    "self_text": "\"You've got a whole life ahead of you!\"  I lived long enough to decide that i hate life.  I am very much resigned to die young (probably because i tried to commit suicide twice, when i was 11, and one before my 14th birthday this year) I feel like i need something to kill me, slowly but surely. I made a whole slide show about stuff i want in my funeral, and a playlist with songs i want to play during it. I also made a list of the people i want to invite (i wont see them but whatever, lmao) I've even planned what i want to say as my last words (A quote from the little prince in french)  And i want to die while i listen to the beatles.  This is why i only have one friend",
    "subreddit": "confessions",
    "selected_at": "2025-09-07T00:07:50.935018Z"
  },
  {
    "source": "posts",
    "id": 288049,
    "title": "What’s one thing that made you happy today?",
    "self_text": "mine was taking a nice warm shower after a long and tiring day. I felt…content 💕 these moments, even though small and fleeting, make me realize that I’m getting better. Day by day ❤️‍🩹",
    "subreddit": "ExNoContact",
    "selected_at": "2025-09-07T00:08:10.094396Z"
  },
  {
    "source": "posts",
    "id": 999545,
    "title": "Making a Birthday card for them?",
    "self_text": "When i was younger i never gotten any birthday cards besides one from family up until i was around 12, and then just kinda not because Appartently I was too old for them. None from friends however.  Because Of this I have been trying to make birthday cards for my friends. Usually I try to draw them and leave a little message.   Is it weird if I do this as a female for my male crush that's older than me. I don't wanna write anything that might tarnish whatever friendship we have.  My female friends were nice about my drawings/cards but is it weird. Maybe i shouldn't do a drawing of them, maybe like a funny meme or something.",
    "subreddit": "Crushes",
    "selected_at": "2025-09-07T00:09:28.269539Z"
  },
  {
    "source": "posts",
    "id": 893994,
    "title": "anyone else get irrationally upset when they get the hiccups",
    "self_text": "idk that it's a sensory issue for me I think it just pisses me off bc I'm trying to relax and the hiccups won't let me >:(",
    "subreddit": "autism",
    "selected_at": "2025-09-07T00:10:00.424377Z"
  },
  {
    "source": "posts",
    "id": 919442,
    "title": "How many calories should i eat in a day as a 15yo girl",
    "self_text": "Im 5’2 and a half, 100lbs, dont work out and on forums everyone says people my height and weight should be eating 2000-2300. But that seems like so much. I usually eat between 600 and 1000 of healthy foods and i wont get hungry. Should i up my calorie intake and if so what type of breakfast lunch and dinner? I just want a more feminine less flat body and i think maybe its because i dont eat enough so i want to eat more.",
    "subreddit": "WeightLossAdvice",
    "selected_at": "2025-09-07T00:15:30.122588Z"
  },
  {
    "source": "posts",
    "id": 629178,
    "title": "Surviving Losing Friends",
    "self_text": "I'm in my early forties and my wife ended our marriage last year.  I've recovered from her (it was better for both of us), but she has worked hard to turn family and friends against me, so much to the point where I've lost 90% of the people in my life.   It's not her.  It's the lack of people that were regularly in my life and all of them turning against me.  I really think she wants me to end my life so she gets everything, and it's been a year, but people still are turning against me, and I'm losing hope that I'm going to have good people in my life again.   Just venting.  Don't know what to do, but it really hit hard today.  Going through every day at work like things are normal is so hard.",
    "subreddit": "Divorce",
    "selected_at": "2025-09-07T00:16:00.905736Z"
  },
  {
    "source": "posts",
    "id": 867507,
    "title": "people say I'm always lucky",
    "self_text": "Don't know how to put this simply or even if this is a right place for this but I've been thinking...  I'm a young adult and right now I'm doing quite good in school, passing exams and overall doing well. My career is building at the same time, I have a great place where to work after I finish my studies and many other doors are open.  But after all this people just say I'm lucky? And that hits hard sometimes because all this has taken so much sweat and tears and even leaving my hometown along with friends just to study.  And I'm not sure where this all comes from? Am I really just lucky or is this something people do?",
    "subreddit": "confessions",
    "selected_at": "2025-09-07T00:17:00.940627Z"
  },
  {
    "source": "posts",
    "id": 945746,
    "title": "how long to feel comfortable in your skin",
    "self_text": "hi all- kind of a weird question but how soon after giving birth did you feel okay in your body again? not like a “bounce back” just like feeling good in your skin/like yourself again? i know it will vary per person, but i’m 27 weeks and fairly uncomfortable and just wanted to hear some positive stories as i’m absolutely terrified of how i’ll feel after giving birth and the following months.",
    "subreddit": "pregnant",
    "selected_at": "2025-09-07T00:17:50.742131Z"
  },
  {
    "source": "posts",
    "id": 576289,
    "title": "How do i get over being insecure abt my girlfriend’s guy friend",
    "self_text": "My gf and i have been in a long distance relationship since 11 months and been best friends for 2 years before. Her guy friend makes me uncomfortable.So basically, after a series lf events where she told me abt him, i think she started realising that her talking abt him really bothers me, so she started hiding her life with him from me. Last week, when i sent texts to her mid college, to “how are you” from my end i got a reply “very bad”. She later explained thst it was this guy who had texted, from the quick respond feature while he had the phone as she was showing him an app she made. Idk i felt like someone stabbed me in my chest, cuz my sense of privacy and intimacy with my gf just vanished. I told her to let me be for a while and told her ant how this made me feel. Later on call, i explained how this made me feel and she kindly asked me how i wanted her to comfort me and started workin on it immediately, for which im grateful and feel a lil gulity. Later, on a note of being honest with each other, she revealed more abt her relationship with this friend, that they listen to music together on the bus, that they sit very close to each other and that once he didn’t apologise for touching her as an apparent accident, which made her uncomfortable(it has happened before). I felt terrible, the first two made me feel devalued, the amt of intimacy they had, i didnt only feel like ill lose her as my gf but also as my best friend. The last one, i was plain mad (at him), that it just shouldn’t have happened and i told her that. She stayed with me trying to comfort me through all this, but ive been umable to get around this. Whenever she mentions him my mood immediately drops, and she knows it, and ive made it difficult for her to be around this guy, cuz she is reminded of how i feel abt it. I feel like im not enough? That i cant be there for her as much as he can, even tho i am. I feel like at some point he’ll have more value to her than me and well ig im really insecure about that. Ig sometimes i see myself in him, a friend turned boyfriend. The terrible consequence of my feelings has been this friend somehow catching how i feel about him, and it’s strained their friendship. I domt want to be that asshole either, and ik that this strain really bothers her. TLDR: how do i get over being insecure abt my gfs guy friend, infact all her guy friends cuz she mostly has guy friends.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:19:32.498199Z"
  },
  {
    "source": "posts",
    "id": 843961,
    "title": "Toxic Boss",
    "self_text": "I have just returned to work after a major surgery. I began to feel intense pain near the surgery area and told my boss that I was going to the hospital.  Two hours later, I get a text:  \" I know you're in the hospital, but I need to know when you'll be logging back in today.\"  &#x200B;  I was so proud of myself for not replying. I ended up in the hospital for 3 days.",
    "subreddit": "antiwork",
    "selected_at": "2025-09-07T00:19:37.248815Z"
  },
  {
    "source": "posts",
    "id": 546127,
    "title": "No Separation Anxiety in my 2yo -- What Does it Mean?",
    "self_text": "My almost-2-year-old behaves very differently from other kids at playgroup.  She basically takes off without a look back at me and stays gone for as long as we're there.  When she gets hungry she doesn't go to me, She hangs out with any other kid she can see that has a snack and tries to get their snack, or actually I caught her looking through other mother's bags for snacks at the last play group.  All the other kids her age and even a little older seem to hang out near their parents and don't just run like crazy maniacs from station to station.  I just bring up playgroup but she's like this always.  Whenever I have to leave I say \"bye honey, Mommy's going bye-bye\" and she mostly doesn't even notice, or she will wave by and say bye-bye.  She is also really good about being put to bed in her own room in her crib, we have a routine where I rock her and give her some milk, then I kiss her forehead and I say sweet dreams and put her down, Tuck her in and tell her to close her eyes and go to sleep, and she does!  I was not like this as a kid.",
    "subreddit": "beyondthebump",
    "selected_at": "2025-09-07T00:19:41.124922Z"
  },
  {
    "source": "posts",
    "id": 749874,
    "title": "My wife is always angry at me when she drinks",
    "self_text": "My wife is an alcoholic. Its like her true feelings for me come out when she's drunk. She always wants to fight and argue with me. Always thinks im up to no good says that she hates me  that she is going to leave. No matter what I do or say to her to try to keep her calm and not explode she'll find a reason to argue with me. Its like walking on eggshells  But when she's sober she says she loves me but i dont believe her  because she pulls away when i kiss her or hug her  when she is sober. Also because shes drunk most of the time and the hate towards me comes out.  When she's drunk i do leave the house and chill at my garage which is my safe spot.   Been together for 10years ive talked to her about the drinking she says she doesn't have a problem. Its been getting worse with  the verbal abuse. I dont know what to do.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:20:10.649791Z"
  },
  {
    "source": "posts",
    "id": 637661,
    "title": "Help!",
    "self_text": "I tested positive for C and now my 8m has a fever.. FTM what do I do? He’s moaning while I nurse him just gave him Tylenol.",
    "subreddit": "beyondthebump",
    "selected_at": "2025-09-07T00:20:36.723917Z"
  },
  {
    "source": "posts",
    "id": 780332,
    "title": "WIBTA if I ask my ex step mom what she’s up to since she’s been coming around a lot recently?",
    "self_text": "Backstory When I (18m) was 5, my dad (53) met my step mum (56). They started dating and eventually she got pregnant with my half sister (11). However, things started to go sour and they ended up divorcing and to be honest, I was glad. She basically forced us all to move in a smaller house because she originally didn’t like the house we were living in since my Half sister didn’t have her own room. However every house my dad and her viewed she either didn’t like or it was “too expensive”. In the end our house sold and we had to move into my grandparents old house since they moved. It was a nice house but I had to share a room with my step brother (23). This was only for a year but it was hell. He would never allow me in the room, I was constantly tormented by my half sister and I couldn’t even say anything because she would start crying and I’d get into trouble for making her upset. Everyone coddled her except my Nan from my mums side of family. She was the only one who had my back the entire time while living there. By the time I started secondary school, my dad and step mum divorced and she moved out. In our home now there was only me and my dad left with the house. She took almost £40k through the divorce and basically took off. Only saw her every few months but I was glad. Me and my half sister have a better relationship now thankfully but I still don’t speak to my former step mom.   Onto the issue  Recently she made contact asking for money because her monthly payments were stopped and she was running low on cash. My dad asked her what happened to the £40k and she said that it went towards holidays to Australia. As soon as she said that, I saw red and told my dad to not give her anything but he did and now she’s been coming back down to our house recently but I think she’s up to something. I really want to say something to my dad but I’m really worried if I do I might be in trouble and I really can’t be bothered to be getting in any bother since I’m already at uni and that’s already enough stress as it is.  WIBTA if I ask her what she’s up to?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T00:21:00.451549Z"
  },
  {
    "source": "posts",
    "id": 466383,
    "title": "Any books you recommend to go through this?",
    "self_text": "2nd month after BU, we were together for 3 yrs, me 30M, she 29F",
    "subreddit": "BreakUps",
    "selected_at": "2025-09-07T00:21:08.985125Z"
  },
  {
    "source": "posts",
    "id": 691633,
    "title": "My ex sent me a friend request on Facebook",
    "self_text": "She requested me yesterday, should I accept it or not? I’ve been very conflicted on it because I’m curious as to why she would request me. We’ve been broken up about a year now.",
    "subreddit": "BreakUps",
    "selected_at": "2025-09-07T00:22:45.988419Z"
  },
  {
    "source": "posts",
    "id": 632070,
    "title": "Confused relationship",
    "self_text": "Iam  f(28) in a 4 year long relationship. Livein for the past 1.5 year. My issue is me and my partner M(28) are 2 completely different personalities. When we fight my bf drag the fight for days until he gets what he wants. But when the same happens with me he expect me not to react to his anger so that the fight wont escalate. I don't know what to do. At this point i cant leave as well since our parents and relatives are involved Moreover his (car/phone/loan for his friend) everything is in my name (he is paying me for it though). Iam done with his anger issues. I dont know what to do",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:24:11.986019Z"
  },
  {
    "source": "posts",
    "id": 940692,
    "title": "AITA for talking to my grandfather too much at work?",
    "self_text": "I (14F) work at an assistant living home. This is my first job and my grandfather (73M) lives there. I work in the kitchen as a server. A couple days ago I got called into the main office at work. The boss who I will call A sits me down. She then gives me a list of things I've been doing wrong. I have been working there for 6 weeks at that point.   Just to note, I'm a very emotional person because I was adopted at a young age and have had lots done to hurt me emotionally and mentally. So I was just sitting there trying not to cry when she tells me.  \"Oh and last thing. You need to either stop talking to your grandfather or talk to him a lot less. It's not good for the other residents seeing him with his granddaughter.\"  I was about to cry then. He just lost my grandmother (75?F). She is not dead but in a nursing home. I took this job just for him. A called me the day my mom (44F and their kid) called A to tell her that my grandmother won't be living there anymore.  After that shift I went to see him and started crying. I don't know what to do. If another covid outbreak happens again, I will be the only family he sees. I want to quit because in the past 8 weeks, this job has not been good to me at all. I do make $13/hour and $19.50/hour when I pick up extra shifts. I'm confused and need advice. So AITA for talking to him too much?  Edit: I got fired",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T00:26:02.954492Z"
  },
  {
    "source": "posts",
    "id": 546934,
    "title": "I just wish people were nicer to each other.",
    "self_text": "When you have an opinion that’s different or not what people were indoctrinated to believe, they tend to shun before asking questions.  Just sneer and downvote because you hate what I say, rather than diving deeper and working to convince me of your point of view.",
    "subreddit": "Vent",
    "selected_at": "2025-09-07T00:26:24.369101Z"
  },
  {
    "source": "posts",
    "id": 398304,
    "title": "who's in the wrong",
    "self_text": "Am I in the right or wrong i male 13 went to a bow shoot up in the woods with a couple of friends ended up really messing up my hip and having to get a helicopter flight out of there I met a girl and I thought she was really cute I was 12 at the time and I had a phone so before I got flew away I asked my friend to get her phone number and I did we started dating we dated for 4 months we stayed up late almost every night and we talked all the time my dad found out about this male 32 and was very upset he took my phone away he  and my mom whor very mad he said I'm not allowed to get it back until I'm 16 it's been an entire year I think they completely overreacted and they still refuse to give me a phone and it was all because I was talking to a girl and staying up late just got this app and I needed to tell someone who I didn't no",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:26:26.978838Z"
  },
  {
    "source": "posts",
    "id": 670998,
    "title": "My (23F) boyfriend (26M) cashed a check meant for me and didn’t tell me about it.",
    "self_text": "Backstory: My boyfriend and I have been together for about 2 years. He had a birthday a few months back and we usually take the other out for a nice dinner on their birthday. BF picked a nice place and I called and made reservations. Prior to going, BF’s dad called to wish him a happy birthday and to ask what our plans were for the day and for dinner. BF’s dad offered to pay for dinner, which I politely declined as I wanted to pay for dinner.  We had a lovely (and somewhat expensive) meal and a great time! When the check came, BF asked me the cost and looked the check over while I happily paid.  Fast forward to a week ago and I was cleaning up our shared apartment. I picked up BF’s computer and put it in his backpack (where he keeps it). When I opened his backpack, the first thing inside the large pocket was a check. I know I shouldn’t have looked at it, but I was curious as to what it was + didn’t want to squish it with his computer.   The check was written from his dad, made out to my BF, dated the day after BF’s birthday, with the memo “birthday dinner” for the exact amount I paid for his birthday dinner (I double checked my cc statement to confirm). I flipped it over and saw that BF had cashed it online. What I’ve gathered is that BF ended up telling his dad the cost of dinner which BF’s dad then wrote him a check for without realizing that it was me who actually paid. It’s been months now and BF never told me about it, so he basically just pocketed the money without telling me.  Big disclaimer that I don’t care about the money - I’m fortunate to have a nice job and some spending money. This is more about me feeling taken advantage of by my BF.   Context: I work full time, cover the entirety of our rent and utilities, and do most of the cleaning/work around the apartment. BF has been unemployed for 1 year+ but helps out by doing some cooking and occasionally paying for dates when we go out. BF states that looking for jobs makes him very anxious - which I am very sympathetic too as I have an anxiety disorder myself. The whole check situation has just made me start to think more about what each of us contribute to the relationship.  This is my first serious relationship and I’m just looking for some advice about what to do and whether to bring up the check with him. I feel really hurt and taken advantage of right now so I’d really like an outside perspective on what to do.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:26:32.362221Z"
  },
  {
    "source": "posts",
    "id": 495084,
    "title": "Should i ask my crush out in this situation?",
    "self_text": "Hi. So basically im a shy introverted nerd (not insane btw) and i like this girl (also shy) in my class.  Over the last 2 or so weeks i have been talking to her to built up our friendship. For example asking her a few questions about herself like what subjects she will be taking ect.  Today i was walking to the spot me and my friends meet up in breaks and by coincidence i walked behind her and her friend. I overheard their conversation and here is what i think how the conversation went:  Her: He is in my class… He is a nerd.  Friend: Who even wants to go out with a nerd? >:/  Her: I don’t even know where he lives.  Here is what i could hear.  Her: Class… He is a nerd.  Friend: Who even wants … nerd  Her: I dont even know where he lives.  I also caught her looking at me with my peripheral vision a few times in a period where we sit next to each other after that.  So a few things could be happening here: (Here you can see how big of a nerd I am)  1: She also likes me but she is unsure if I like her back. Me reaching put to her over the last two weeks may have made that she thinks that i like her too. She and her friend could have been talking about how she likes me before i walked behind her.  2: She doesn’t like me and realised that I like her. She could have told her friend that she thinks this guy in her class likes her.  3: ??? You tell me  Im really unsure what to do here and i have by no means the courage to go ask her out.  Any help will be appreciated.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T00:27:06.627220Z"
  },
  {
    "source": "posts",
    "id": 916964,
    "title": "She unadded me on snap after she ended it",
    "self_text": "So me 18(M) and this girl (17 we’re talking about for about over 2 months and everything was going great we hung out at her house the day she ended it and everything seemed fine I asked her to be my girlfriend and she seemed happy and excited about it. She was dropping me off back at my house when everything seemed weird. The car ride she was quite and acting weird and nervous but we were cuddling and were happy 10 mins before. So she takes me home and we hung and kiss like everything was fine. She got home and ended it saying she wasn’t ready for a relationship and I thought I was ok with it but then she unadded me on snap and I got drunk and I decided to send her a paragraph about how I was hurt and she added me and read then unadded me again idk what to do or if I should do anything at all. All of our mutual friends told me she is truly not ready so idk what to do. Could someone help me?",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:27:21.735870Z"
  },
  {
    "source": "posts",
    "id": 736856,
    "title": "My (28F) husband (30M) gets angry when I cry",
    "self_text": "My husband gets angry and won’t talk to me if we’re arguing and I start to cry. This is my first “real” relationship so I don’t have much else to compare it too. Is this normal? It feels really bad and hurtful because I’m not TRYING to cry- it happens if I’m too overwhelmed or upset. Any advice is appreciated.   A little back story: We’ve been together for 4 years. We got married about 8 months after dating (due to various circumstances). He wasn’t always like this- but we also didn’t argue as much in the beginning.   TL;DR- my husband gets angry and says he won’t talk to me if I cry during an argument",
    "subreddit": "relationships",
    "selected_at": "2025-09-07T00:27:29.483187Z"
  },
  {
    "source": "posts",
    "id": 765721,
    "title": "Need advice",
    "self_text": "So I just found an earring under my boyfriends dresser in our apartment. We moved in a few months ago. I’m scared about what this might mean. Any advice? I don’t wear earrings or have my ears pierced.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:27:46.747029Z"
  },
  {
    "source": "posts",
    "id": 635056,
    "title": "Weird rash thing on my leg, what could it be?",
    "self_text": "30M Caucasian 6’2” 285 lbs  Current meds: Caplyta 42mg Trileptal 600mg Lunesta 5mg Various vitamins  Bipolar disorder  Sleep apnea  No smoking or drinking  There have been no changes to anything that would typically cause a rash; detergent, soap, lotions, etc.   It does not cause any itching, it is not swollen. It feels similar to a deep bruise as far as pain, and it does have a little warmth.   This started 4 days ago, when I was asleep. The pain woke me up a couple times, and when I got up for the morning, I saw this.   I have had a sinus infection for ~2 weeks, doctor prescribed me a Z-pack, and it did nothing for me. I have not taken one before, and the rash onset on the 5th day of it. I do still have a slight cough occasionally and a stuffed up left ear.   These pictures show my legs. The one with the grey bath mat is the day after I woke up, the close up of my thigh is today, where little red bumps have appeared as well.   Lastly, I DID go to the ER, I did an ultrasound to see if it was a blood clot as the NP thought it could be; it was not.",
    "subreddit": "AskDocs",
    "selected_at": "2025-09-07T00:27:54.548512Z"
  },
  {
    "source": "posts",
    "id": 883739,
    "title": "I texted something really dumb and now I can't cope with it",
    "self_text": "In the country I live in, today is the teachers day. So me and my classmates decided to buy our class teacher a present like a week ago. The problem was our class teacher wasn't in the country and we needed to solve that issue. One classmate managed to get his home adress and we decided to send it here. The issue was that I thought they got his hotels adress. When we decided to finally order his present, I said something really freaking dumb. We were chatting on whatsapp (in the class group) and one of my friends was complaining about how she wasn't able to get his present delivered to teachers home, as the shopping service wasn't able to deliver to that location. (She was trying to buy it from a local seller)  HERE IS WHERE I COMPLETELY F UP I told her that in order to deliver something to another country you need to get the thing first, and than deliver it outside the country thorough international delivery companies.  IN THE FREAKING CLASS GROUP. DELIVERING A FLOWER TO ANOTHER COUNTRY. HOW THE HELL DID I THOUGHT OF THAT.  The embarrassment I felt was extremely bad, so bad so that I was hitting myself constantly. I wasn't calming down no matter what, so I grabbed a razor and did the thing...  I didn't go to school today because I don't even know how the hell will I be look her in the face. And the fact that it was in class gc...  I still don't feel calm, I feel like she thinks I am extremely dumb. I just can't cope with it.  Normally I am pretty good at making friends and socializing, but I just can't cope with the feeling of shame. It just causes so much anxiety as it makes me feel like everyone hates me. The thought of being hated is just awful. How the hell do I cope with this?",
    "subreddit": "socialskills",
    "selected_at": "2025-09-07T00:28:28.169140Z"
  },
  {
    "source": "posts",
    "id": 278389,
    "title": "ayy, 12:14 am, time to sleep, gn everyone",
    "self_text": "<3",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T00:28:39.008485Z"
  },
  {
    "source": "posts",
    "id": 342237,
    "title": "Academic Accommodations for mental health",
    "self_text": "TW: self harm   I am a 5th year in college who is non-traditional student aged. I was previously academically dismissed and worked so hard to get back into my college and I did! The community college classes I took in the time between was so easy and I didn’t really learn to cultivate better habits as I was able to quickly do work and still get As, which felt good, but not the same at a 4 year college. I have been diagnosed with ADHD/ anxiety/ depression since the 5th grade and didn’t start utilizing accommodations until high school. Used them and did great. College is another story as I started to having to advocate for myself and thought all of my negative symptoms were how everyone felt and who I was. I never saw those things as barriers, but as I have gotten older, the dots have started clicking. I have been embarrassed to use my accommodations until this year because past friends made comments that it’s unfair and I took those to heart. The academic resource center purged my files upon my dismissal so it’s been a mess trying to get the correct documentation and my doctor only sent in the documentation last week even though I was asking for months. I am very frustrated as I’ve been falling behind due to my mental health rapidly declining this semester upon starting a new medication that made everything worse: insomnia, more anxiety, not taking care of myself, thoughts of unaliving myself, and started c*tting myself for a few weeks. I started to make the connection that it was my new med I started and then cut it cold Turkey and have felt better, but I’m still in a disassociative state making functioning hard. I am scared to disclose all of this as I can’t afford to medically withdraw and am supposed to graduate in the spring. I would appreciate any advice for how to handle this",
    "subreddit": "college",
    "selected_at": "2025-09-07T00:28:49.192129Z"
  },
  {
    "source": "posts",
    "id": 979704,
    "title": "Trying to breathe through the nausea 😭 I’m only about 7 weeks and it’s the worst thing I’ve ever felt",
    "self_text": "First pregnancy and boy is it rough already!! Any tips and tricks? Leave them here for me. Thanks!!",
    "subreddit": "pregnant",
    "selected_at": "2025-09-07T00:30:37.889564Z"
  },
  {
    "source": "posts",
    "id": 944455,
    "title": "I think I (m28) know the answer",
    "self_text": "So, basically, I’ve been seeing this lovely woman for the past two months. Nine dates, lots of fun, met some of her friends.  Tonight she told me she wants to take a step back because she feels like she’s either messing me around or I’m putting her on a pedestal (which I genuinely am not).  Is this her way of saying it’s over? If it is that’s fine, like she is not a words of affirmation person and I am unfortunately a big complimenter and some shitty romantic.  It’s fine if she doesn’t want to be with me, I get it! I respect her decision. But she said she “doesn’t think she wants to stop seeing eachother”  I just don’t know. Maybe I’m being naïve or overthinking. But whatever her choice I respect.  Edit: we really have a lot in common. She said she’s putting walls up and wants to see where it goes.  I genuinely like this person and will wait. But I understand this is my issue",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:30:56.939636Z"
  },
  {
    "source": "posts",
    "id": 952259,
    "title": "Don’t know what to do",
    "self_text": "I love my wife… as a friend now. We are now at different points in out lives. She is an amazing person, but I am not in love with her. I have learned a lot from her. We have been together for 24 years and married for 16. I am not attracted to her really and I don’t think monogamy is for me at this point. I have a PTSD issue and don’t want to burden her either. I am lost at this point.",
    "subreddit": "Divorce",
    "selected_at": "2025-09-07T00:30:58.847143Z"
  },
  {
    "source": "posts",
    "id": 810997,
    "title": "Baby’s temp is always high",
    "self_text": "Our 2mo old is a happy and healthy little boy from all visual points. He had a UTI in October and was hospitalized for a week so I may be just overly anxious, but I wanted to see what the group said.   We keep him dressed lightly, just a body suit, and we keep out home around 70-72 all day and night, but he will occasionally feel warm. Every time I take his temperature (rectal) he is between 99.5 and 99.9 on multiple thermometers. His pediatrician didn’t know why that would be, as he is acting, eating, and sleeping well.   Has anyone else come across this with their baby? Is this normal or should I get a second opinion with another pediatrician?",
    "subreddit": "NewParents",
    "selected_at": "2025-09-07T00:33:18.037543Z"
  },
  {
    "source": "posts",
    "id": 617847,
    "title": "I don't get men sometimes",
    "self_text": "Men want an intelligent woman, but why do they feel intimidated when they finally meet one?",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T00:33:21.168278Z"
  },
  {
    "source": "posts",
    "id": 272222,
    "title": "sorry im never good enough.",
    "self_text": "I just realized I'm never going to be my moms favourite and that I'm never going to be good enough for her. That whatever I do, I'm going to be in my younger siblings shadow because they are my moms perfect little angel and I'm nothing but a thorn in her side.",
    "subreddit": "Vent",
    "selected_at": "2025-09-07T00:36:30.657678Z"
  },
  {
    "source": "posts",
    "id": 691197,
    "title": "I need help with a lost of dopamine towards an activity I like",
    "self_text": "Hello I’m new to this page but I need help because I’m not 100% sure if I have ADHD I’m planning on seeing  but I have this thing where I will have a sudden rush of dopamine towards something I really like but after doing said thing for hours or days I lose all interest and I can’t do said thing without feeling bored. even though I’m really into it and i almost feel this depression from it because I really want to do that thing but all of that dopamine is gone. And I think it’s called hyperfocus or something along  I could not find a direct answer. I’ve seen people with my same problem and I have no where else to go for help. But what I’m asking is if anyone knows how to make that dopamine last longer or help mitigate where I can make last a hell of a lot longer but without as much excitement or anything really I really need help",
    "subreddit": "ADHD",
    "selected_at": "2025-09-07T00:38:17.056399Z"
  },
  {
    "source": "posts",
    "id": 312716,
    "title": "I cannot imagine a future for myself",
    "self_text": "I don’t know what I’m going to do. I feel like everyone’s got something figured out. I get anxious making decisions at the store. I don’t know how I’ll pick a job and stick with it. I feel like a failure. I don’t know where I’ll be once I finish my education, all my friends will move away and I have no clue where I’ll be. The one thing I do know is I eventually want to have a family. With a husband and kids. But I don’t know if anyone would ever want me enough to marry me. I don’t think most men I’ve dated tolerated me much. I have time to find one that might tolerate me. I have plenty of time to figure out love and work and family but I feel so stuck. I can’t think of myself as a fully functional adult with a cool job or a husband or kids. I don’t know what I’ll do. I honestly didn’t think I’d be alive this long. I didn’t really think I’d be dead but I didn’t know what I’d be like or what I’d do. Honestly I don’t have a whole lot of hopes or dreams. I cant see myself living in the future so why bother. My brother is gone. At this point following through with what he did seems like the most promising path. I don’t know what will come after but it’s probably better than sitting around second guessing everything. Maybe I’ll give myself a set time to figure everything out or I’ll actually do it this time. I don’t know. I want a future I guess. Hopefully it’ll be good enough for me to stick around",
    "subreddit": "confessions",
    "selected_at": "2025-09-07T00:41:14.664766Z"
  },
  {
    "source": "posts",
    "id": 579785,
    "title": "I hate this",
    "self_text": "Always, i swear always when i come to school and i wear something like not a hoodie and you can see my sh scars, everyone is suddenly interested and some of them are talking about me literally standing one meter away from me, or even laughing at me saying things like \"Omg Emo\". It's just so annoying can people leave me fucking alone? Can they stop doing this? I know it's not common to see someone's sh scars but doing that stuff is just..you know. Idk just how to talk about it- i don't know how to even write it down here so sorry if y'all don't understand..",
    "subreddit": "venting",
    "selected_at": "2025-09-07T00:42:57.664802Z"
  },
  {
    "source": "posts",
    "id": 940265,
    "title": "WIBTA for reaching out to my relatives?",
    "self_text": "So, my family use to have fairly large holiday get togethers. Typically it was aunts, cousins, and nieces on my father's side. My mother disowned her side years ago, and to be fair, I would actually have to do some research on how my actual relatives are on that side.  Over the last few years, my parents fairly successfully alienated all my relatives. They say they are liars, drunks, addicts, and they when this was going down they said not to contact my relatives and that my Aunts were looking for \"anyway to worm their way into our lives\". Now a few years removed I am... not sure if I am believing any of that. My parents have alienated everyone in their lives, and seem to have a general hate of other people in general, and now it is sort of casting a lot of what they said about my relatives in doubt.  Supposedly one aunt has neurological problems and the other aunt is dying of cancer, although my parents say they are lying about this. I just had a spectacularly depressing nuclear family holiday, where my parents sort of seem to be receding into themselves and so I have been thinking... I should reach out to my relatives.  We had some really great times together, and I feel like none of what I was told I actually witnessed. I guess I should use extreme caution, but I feel I should reach reach out to them, and at least extend an olive branch for myself to them.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T00:44:24.501158Z"
  },
  {
    "source": "posts",
    "id": 959310,
    "title": "i wish i had someone to game with",
    "self_text": "im sickz and boredz mane",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T15:33:00.076127Z"
  },
  {
    "source": "posts",
    "id": 917004,
    "title": "Genuine curiosity: what was my mum up to?",
    "self_text": "Might not be the best place to ask this, but wasn't sure where else to go.  &#x200B;  The gist of it:  When I was little, my mum would stop by the local beer/smoke/tobacco shop on the way home from class. She would buy something and hide the bag from me. She always made sure to come out with a can of soda for some reason, and she insisted  that  was what she came to buy... But who the heck goes to a tobacco shop to buy a soda?   I have put together a few clues over the years. When I was little, I occasionally walked in on her using some kind of product/substance/whatever and she would always try to shoo me out, hide it from me, or straight up just refuse to tell me (I have always been curious about it). She always had this blue cup nearby, had trouble talking, and was making a weird face.    I have never seen that blue cup in our cupboard before. It looked disposable or like it came in some kind of package: it was made of partially see-through blue plastic and was always really messy. There was some kind of sludgy stuff on the side of the cup that looked black, and there was always some black residue on the bottom of the cup. Maybe it was tobacco?  The weird face and trouble talking make me think she had something in her mouth. Her tongue was always pressed against her bottom lip (sort of like she had something on her tongue; it made her look like her mouth was swollen) and she kept it there whenever she opened her mouth or talked at me, which might be why she had trouble talking.   I have always been curious to know what it was she was buying, because she always dodged the question when I was little and now insists it never happened (mum is a gaslighter). It might have been chewing tobacco or something (since it was a tobacco store and all), but she doesn't really seem the type to do that. Lots of people in my immediate family are smokers and drinkers so it wouldn't even be that weird. It just seems weird that if it  was  tobacco that she would be so defensive about it.  It probably isn't something sinister or scandalous, but I just wanted to know if anyone knew what was up. Reddit is known for Reddit Detectives, sooo... Can anyone figure it out? Anyone seen/used something like that before?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T15:33:13.818115Z"
  },
  {
    "source": "posts",
    "id": 456373,
    "title": "Too much FaceTime",
    "self_text": "My gf says she don’t want to call too much due to her not wanting to get bored of me. Her words. While I don’t wish to stay away from her for too long and I’m trying to come under grips with a nice middle ground for us both to flourish in and doing so by talking to her about it. We’re not currently finding any good answers that suits us both.   Does anyone know what to do here and has been in similar situations.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T15:33:21.518791Z"
  },
  {
    "source": "posts",
    "id": 282459,
    "title": "Mood",
    "self_text": "They'll never take me alive, sleeping with one eye open I'm paranoid fucc sleep, and I'm drinking and I'm smoking Ain't no love in my heart, too many times it been broken So my lifestyle is fucc y'all niggas, and I ain't joking",
    "subreddit": "lonely",
    "selected_at": "2025-09-07T15:35:59.323127Z"
  },
  {
    "source": "posts",
    "id": 384909,
    "title": "Wedding and Polygamous Friend",
    "self_text": "Hello all, my fiancé and I are getting married next November and I am concerned about our guest list. We have a friend who has two partners. One which I love, and the other I cannot stand. The one I cannot stand was someone I knew before they started dating. She also despises me and has been kind of a bitch to me (lol). One thing I really dislike about her is that she never bothers to talk to me, or at least try, even when she has been invited to our place for things. Generally my other friends dislike her too, she’s very much a snake and has blackmailed people. My fiancé and I have stopped extending invites to our home a while ago. I would also like to say that the other partner and I get along well and we have been on several double dates together!  Would it be rude if I just addressed the invitation to both my friend and the preferred partner? Or should I just give them the plus one so they get to choose which one (and hopefully it be either the other partner or someone else totally)? I appreciate any advice because I don’t find it fair that I have to “share” my day with people that 1) don’t like me and wouldn’t even talk to me and 2) someone I personally dislike. Thank you.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T15:36:05.758041Z"
  },
  {
    "source": "posts",
    "id": 393968,
    "title": "Is it normal to get the random urge to start watching anime?",
    "self_text": "I’ve never watched it before, and I can’t let myself become a weeb",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T15:36:18.639407Z"
  },
  {
    "source": "posts",
    "id": 440567,
    "title": "I lose touch, when you love me too much",
    "self_text": "I lose touch  When you love me too much  That's not how this works  No, that's not how this works  No, that's not how this works  When I have a knife to your back and you're screaming  How love is so draining  But pain is just water  We're just floating, filling in the holes with the filth  That's all we have  I dream of water when I'm dying of thirst  I dream of water when I'm dying of thirst  I lose touch  When you love me too much  I dream of water when I'm dying of thirst  I dream of water when I'm dying of thirst",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T15:36:58.393874Z"
  },
  {
    "source": "posts",
    "id": 978418,
    "title": "who's with me",
    "self_text": "i would want to date a strong and tall woman, like i mean really tall and muscular   like i'm saying i want her to be able to pick me up by the head and crush it like a grape kind of strong",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T15:39:30.486246Z"
  },
  {
    "source": "posts",
    "id": 407926,
    "title": "AITA for throwing away my grandmother's belongings?",
    "self_text": "I (26F) moved to my grandmother's house back on 2020. For context, the house was bought by my parents when we moved states over 20 years ago, but after a nasty fight, my grandma refused to move out so my parents, sister and I moved instead, and she kept living there. Recently my grandma (88F) could no longer live on her own, so my mother took her in and I moved here.   My grandma is a bit of a hoarder. She had boxes full of decades old stuff that had not seen the light of day in years. When she moved to my mom's, I was left to sort the bulk of it out. However, I would defer to her before throwing or giving away anything. I was still hesitant because she has very bad memory and would sometimes deny I ever asked her, so I kept some items in case she changed her mind.  She also had a car that she barely used and I kept it after she could no longer drive. I spent a lot of money trying to get it back in shape, but it bled me out if my savings with constant new repairs, so it was sold with her blessing, and she told me to keep the money.   All of this happened a year ago. Yesterday I brought her the last of her stuff, and today she called me to ask about some missing books, and when I told her that I did give them away, she flipped out and started to ask me about several objects that I no longer had with me. She started crying when I told her as much, even when I reminded her that she had greenlit everything. She berated me about how awful I was for not appreciating any of that stuff, and even brought up how I should have \"insisted\" more about her keeping some of the money from the car sale.   Now I'm honestly feeling guilty. My mother said I shouldn't worry because I did nothing wrong, and my grandma has to learn to let go of things she no longer uses. However, I feel like I should have insisted more, or at least attempted to keep some stuff because, in reality, it was part of her history and may have had more sentimental value than what we thought.   So Reddit, AITA?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T15:41:13.257118Z"
  },
  {
    "source": "posts",
    "id": 341938,
    "title": "Feeding my kids is so fucking exhausting.",
    "self_text": "Every meal is a fight. I’m so tired. Who knew the hardest part of parenting would be the never ending meal planning and grocery shopping and cooking and kids tantrums each time I try to get them to eat anything else besides chicken nuggets. I hate it.",
    "subreddit": "toddlers",
    "selected_at": "2025-09-07T15:41:15.625992Z"
  },
  {
    "source": "posts",
    "id": 879744,
    "title": "AITA for giving my mom and sister an ultimatum to sell properties or proceed legally?",
    "self_text": "I'll try to be short. Four years ago me and my sister lost our dad (parents where divorced), now we got a 1/4 each of the house where we were living at the time (the other half belongs to our mother), a 1/4 each of a terrain lost in nowhere, and an 1/2 each of the house that my dad got by their parents (but never lived in, so no emotional memories if not the fact that our grandparents build it. NB: the house is a duplex, where another half belongs to our uncle from our father).  From a year or so I'm trying to explain to my mother and sister that the bigger house where no one lives needs to be sold, I want to go live out of the city and don't want to be poor because of bank when I have empty houses. They have changed idea many times in the time, saying that it's unfair that I lived in this bigger house for this year and my sister doesn't have the chance to do it.  Let's give some numbers: I'm 27, lived here without paying rent but I've cleaned, repaired and gave back life to an house that was ruined from previous tenants without asking money to my sister. My sister is 18, and she's asking to me to leave the house unsold, and empty, for something like 5 years or so until she can think of buy it, or not. In the meantime I'm paying rent.  Now I want to ask them to sell the bigger house, give my part of money and also buy the other pieces of property that I own, or I will proceed legally and force them to sell everything but at a more lower price.  To me I'm not the asshole, my sister is under the influence of my mother that doesn't like my wife, and she want her son all for herself and think she could put influence over me not leaving me go away. Now I'm done, I think I'm right and I'm doing it for my mental health. But you know, it's never nice to get to this point.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T15:42:29.700468Z"
  },
  {
    "source": "posts",
    "id": 749959,
    "title": "I don't know if I should go to my friend's wedding",
    "self_text": "I don't have any friends anymore, except one guy that I've known since we were kids. We used to hang out a ton and regularly, but in the past several years he's been dating this girl that takes up a lot of his time, and his general life as well. He's definitely done better than me socially and professionally. I don't begrudge that but it has kept him from being available to regularly see each other for years.   He recently got engaged to his now fiance, I don't really know her that well because we don't hang out much, and invited me both to the wedding and to be one of his best men at the ceremony. I am happy for him, but I don't want to go to any of the wedding or be involved in it.   I can't think of any good way to honestly explain it to him, and it'll be a permanent black mark on our relationship he'll always remember if I don't go. But I barely see him anymore. The wedding and everything around it would just be another painful obligation, like going to work and not getting paid.   I don't know if I should force myself to go and act like I'm enjoying it. Or if I shouldn't go. And which option I would lose the least amount of self respect for.   I'm happy for my friend. But there's no good outcome for me here.",
    "subreddit": "socialskills",
    "selected_at": "2025-09-07T15:44:09.501952Z"
  },
  {
    "source": "posts",
    "id": 360436,
    "title": "Gifts for my closeted gf",
    "self_text": "This month is our one year and I don’t know what to get my closeted gf. Her parents already have suspicions and are highly homophobic. I’m going to get her something she wants for Christmas so I want to get something more special towards our relationship for our one year anniversary. I don’t know what to get, any ideas? Thanks🙂",
    "subreddit": "lgbt",
    "selected_at": "2025-09-07T15:51:45.729173Z"
  },
  {
    "source": "posts",
    "id": 435417,
    "title": "What’s the big deal with sleep training?",
    "self_text": "Seriously, I don’t get why parents get judged for sleep training their babies. Someone tell me what I’m missing.  Signed - a parent with a 9mo LO who likes to sleep.",
    "subreddit": "Parenting",
    "selected_at": "2025-09-07T15:52:07.958701Z"
  },
  {
    "source": "posts",
    "id": 914347,
    "title": "How do i breakup with my gf?",
    "self_text": "I(19m) have been dating my gf(20f) since 10 months. I just want to get out of the relationship because i just don't feel the same for her and don't want to lead her on. I have tried breaking up with her multiple times over the past few months. I have taken the direct approach of telling how i feel, i have also used indirect methods when that didn't work, like creating fights from minor stuff, just being an ass in general, as a last resort i even tried making her feel like shit by saying mean things so that she'll understand I'm a dick and leave me, but that didn't work too. She just comes right back, i feel very bad using her like this, how do i get her to see that she's dependent on me and needs to leave me as this relationship is abusive for her.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T15:52:59.329638Z"
  },
  {
    "source": "posts",
    "id": 995340,
    "title": "Can A toxic home life cause a rift in relationships?.",
    "self_text": "Context: myself m (27) partner F (27) I'm living with her and her family, due to my own family unit being less than pleasant, and so while we make eachother happy we both have trauma and I'm questioning/taking steps to separate things letting her know that it's not solely her fault, that living with her family and some comments she makes makes me feel uncomfortable and mentally unsafe.  So is this a legitimate reason to walk out or is anxiety just playing whack a mole with me?.  EDIT: She is doing what she can and trying though I think everything outside of it may have been too much.  Edit 2: we worked it out, that it's the environment that's triggering me and not her presence, so anxiety just came by and nearly blew the house down.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T15:55:15.816927Z"
  },
  {
    "source": "posts",
    "id": 376804,
    "title": "AITA for trying to speak Korean badly?",
    "self_text": "so at my workplace (I live in USA) a lot of our clients are Korean immigrants. we have a translation service available by phone. the service requires a long hold time and is awkward to use, so we are all very happy when one of our coworkers is on who is bilingual Korean-English and provides translation.   now, I love foreign languages. so I am taking some online Korean lessons which admittedly are not going that great because I don’t have a lot of free time. I speak 2 languages other than English but they are not as different from it as Korean is.   so far I learned how to say “hello” and “thank you” in Korean and I try to just say it to people kind of as a sign of respect and also to practice. but my bilingual coworker spotted me doing this and told me to stop. he said I pronounce it badly and it is rude to speak just those two words if I am not prepared to engage in conversation. I thought the responses from clients were usually positive-they smiled. and maybe I transferred a bit… English is not my native language and if an English speaker says couple words to me in my native tongue I am usually happy that they’re trying, even if it sounds all wrong.   but I don’t know maybe with koreans it is not good if non korean speakers pronounce things wrong and they’re too polite to tell me off…  AITA?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T15:58:14.706947Z"
  },
  {
    "source": "posts",
    "id": 987816,
    "title": "I’m young, and am excited for the future body capabilities developed in the future",
    "self_text": "Did you know the average person’s brain takes 25 years to fully develop? Recently I have been noticing a wider field of sight, and I think my instincts have become sharper, but that might be just a cognitive bias.",
    "subreddit": "RandomThoughts",
    "selected_at": "2025-09-07T16:14:37.927071Z"
  },
  {
    "source": "posts",
    "id": 690363,
    "title": "Frustrated and annoyed",
    "self_text": "We got our marriage license in the mail today and to be honest it really bummed me out. But not bc I’m not thrilled to be married (I’m elated to be married to my husband!) but because the total AH of a “father” is on it. I guess in my county they list both your parents names on it for both parties. I didn’t know this. I was so excited to get it bc it means we’re officially official and I can change my last name. Something I’ve been looking forward to. Except it feels like one last dig that my marriage license has to have the dead beat, verbally and mentally abusive, pathetic excuse for a “father” on it. It kinda took the wind out of my sails. Like why can’t I just be rid of him entirely?",
    "subreddit": "venting",
    "selected_at": "2025-09-07T16:46:49.343408Z"
  },
  {
    "source": "posts",
    "id": 501630,
    "title": "What if I, just, like, choose to be mute?",
    "self_text": "Can I do that? Like... personal things have happened and I just don't wanna talk anymore. I want to watch and I want to listen, I'm tired of speaking. I've always been so chatty, yeah, ever since I was in kindergarten, but I wanna be done. Will people hate me? Think I'm doing it for attention for whatever reason, just like everything else in my entire life? Does it count as \"faking a disorder?\" I just don't wanna talk anymore. That's all. I'll talk to, like, my boyfriend, and maybe my Mom and my step sister, but I just want to be silent for once. Is that frowned upon?  Will that  be frowned upon?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-07T16:49:09.562948Z"
  },
  {
    "source": "posts",
    "id": 1006939,
    "title": "My(27) gf(25) went on a “date”with someone she met in a party. Should I still trust her?",
    "self_text": "We have been dating for the last 8 months, exclusively for 2 months. We had a small fight last week about an unrelated matter and were not talking per se when this incident happened, but still committed. Last weekend she met someone at a party, the guy was trying to hit on her despite her telling him that she was seeing me. After the party he offered her a ride and she accepted. From what she had mentioned, they took a longer route to reach home. She said that nothing happened beyond that. She later told him it was a mistake.   On a related note, couple of months ago, after we became exclusive, she was being pursued by someone. She had made it clear to him that she’s not interested in him. Then one day he somehow finds out her address (common friends) and sends her flowers. Instead of rejecting the flower delivery, she accepted it right in front of me because she was curious to find out what had he written on the note(her words).  Is this a pattern of disrespect/untrustworthiness or am I being paranoid for no reason? Tldr: gf went on a long drive with someone she knew was hitting on her. Accepted flowers from someone else she knew was pursuing her.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T16:51:21.940348Z"
  },
  {
    "source": "posts",
    "id": 268635,
    "title": "What part did you play in your divorce?",
    "self_text": "This one is for self-reflection. Can you admit the role that you had to play in your divorce?",
    "subreddit": "Divorce",
    "selected_at": "2025-09-07T16:51:24.689629Z"
  },
  {
    "source": "posts",
    "id": 415378,
    "title": "Once you delete someone you shouldn’t add them back right?",
    "self_text": "I feel like I made a mistake and am so tempted to try to make it right again I don’t have a lot of friends and I had a really good time with this girl she seemed into me but it didn’t work out when I tried to plan 2nd date we would snap have a streak but it felt like a stretch and she didn’t want to make time so I deleted her",
    "subreddit": "dating",
    "selected_at": "2025-09-07T16:52:25.757989Z"
  },
  {
    "source": "posts",
    "id": 616552,
    "title": "My partner has BPD",
    "self_text": "I (29F) am reeling from ending a 1.5 year relationship with my pwBPD bf (38M).   He had other issues too, depression, trauma, AuDHD, and still searching. Some self-diagnosed, others professionally.  He wasn’t going to therapy but was taking a cocktail of pharmaceuticals that was hard to understand and keep up with. It seemed like he wanted to get help but didn’t know what will.  I knew that going in, but I never saw it as an excuse to judge anyone. We have been friends for a while before dating, so I had a more sincere investment in his well-being.  Despite some red flags in his life (lack of close friends and family, no stable job, hoarding tendencies, bad spending habits, and sometimes low hygiene), I was being treated so well. He made me feel affection like I have never before. I was on top of the world, and that was enough for me to stay invested. I loved him wholeheartedly.  When the relationship got more serious, and talks about moving in started to come up, I told him I’m considering it as long as he gets his place under control, I would help him do it.  I was gaslit into believing that we were making progress on this, but it seemed to be a trigger for him to start splitting.   In the split, he would put up a high walls to push away my feelings, and my problem solving options were muzzled. Because of the amount of issues he was dealing with, I didn’t recognize this to be a BPD episode. It was a really hurtful cycle, so I told him I’ve had enough and I left.  Now begins the discard, and it is devastating. I’m being ignored and unrecognized. I’ve never been on the receiving end of such cruel treatment my whole life.   I thought he was splitting and discarding me on purpose (not as an untreated and uncontrollable coping mechanism), that’s why I left. It reached a point where I was so hurt that I wanted to be hurtful back. I sent him a mean and confronting message just to receive any kind of reaction from behind the wall he built to keep me out.  I regret it, i feel like I made things worse. Now that I’m more informed about BPD, I wish I had done things different. I said that to him too.  I’m not sleeping, and I have no appetite. I’ve lost near 10 lbs in the 2 weeks since this happened. I can feel my hair falling out when I brush it, and I cried enough for my period to come early. I’ve lost my will to live.  I don’t want to give up on a person that I love, like others may have don’t to him in the past. Is there anyway to reverse the discard? How can I self preserve during the devaluation phase?  Please help me, I am at rock bottom and struggling.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T16:53:21.413089Z"
  },
  {
    "source": "posts",
    "id": 925826,
    "title": "I accidentally ripped the door apart to my sisters bedroom.",
    "self_text": "So my bedroom is on the top floor and I really had to pee but in order to get to the bathroom, I must pass through my sisters bedroom. She has her dog in the room and she doesn’t want it to leave the room at night so I left her room to go to the bathroom and when I closed the door, it wouldn’t latch (it’s a shitty old door and you have to pull hard to latch it) so I pulled it with a good bit of force and the whole fucking doorknob ripped through the door… my parents are away for a couple days and nobody knows it’s broken yet because my sisters asleep. WTF DO I DO?",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T18:15:14.082768Z"
  },
  {
    "source": "posts",
    "id": 835357,
    "title": "Who to go to when you’re failing at being a mom",
    "self_text": "I can’t stop crying today. My son is almost seven months and he’s perfect, absolutely perfect, but I can’t help but feel like I’m failing him as a mom. I can never get him to sleep the amount he’s supposed to. Every nap/bedtime is forever of him crying to only get a short nap. I can’t get him to consume food and every time we try we have to bathe him and wash the floor and I can’t imagine it’s supposed to be that hard. He screams like we’re trying to murder him when we put him in the bath. I don’t know how I’m supposed to entertain him for fourteen hours a day and I can’t manage to remain emotional engaged with him for that long. I failed as breastfeeding. I’m sick of fighting with my husband constantly.   I didn’t grow up with siblings and have no experience with babies. I don’t know what made me think I could take one home and do a good job. I’d do anything for him, but I desperately need someone to teach me what to do. Who do you even go to for that? I’m starting to feel like I should give him to someone who can take better care of him, which I know is crazy, but he deserves so much better than me.  Update: Seriously, thank you to everyone who responded. I don’t have the bandwidth to reply to everyone right now but everyone has been so helpful and made me feel much better in general. I don’t have any mom friends so I guess it’s easy to fall into the “it’s not supposed to be this hard” trap.",
    "subreddit": "beyondthebump",
    "selected_at": "2025-09-07T18:15:57.662610Z"
  },
  {
    "source": "posts",
    "id": 818961,
    "title": "I’m sorry bro but brunettes are my weakness",
    "self_text": "That long brown and black hair bro with the pretty face you can’t beat that I’m sorry",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T18:16:12.988026Z"
  },
  {
    "source": "posts",
    "id": 574457,
    "title": "I wish I had friends",
    "self_text": "I never had long-term friendships, and currently, at this stage in my life, I don’t have any close friends. I wish to have friends in my life, as how other people seem to have, but I don't have any skills or anything in me that would make someone want to be my friend. Is it possible for someone like me with no interests or interesting qualities to get any friends?  How should I go about making friends, both in an online and offline setting?",
    "subreddit": "socialskills",
    "selected_at": "2025-09-07T18:23:19.254285Z"
  },
  {
    "source": "posts",
    "id": 787075,
    "title": "Urge to just delete everything",
    "self_text": "It started with just debating about deleting my discord server because the only two other people I have in there just vibe more with each other than with me, to the point when  I  initiate a conversation I get almost no replies but when one of them do they're talking for hours.  Then this app and all its junk. Then Facebook and it's junk. Like why am I keeping these? The only reasons I can think of are my memory, as social media has helped me multiple times pin dates onto stuff I couldn't recall, it being some of the only source of my media like photos or doc*ments of said memories and the idea I turn to it on multiple occasions for something.  But it's clear that it does more harm than good and I'm sick of 90% of these people who end up making comments (this is like the only sub I enjoy every commenter on) and I'm just so sick of all of it! I'm sick of trying to find communites to belong in and finding out I don't fit anywhere, including my own discord server!  I'm fighting the impulse but I'm so tempted just to burn every one of my profiles to the ground and delete all the apps.",
    "subreddit": "AutismInWomen",
    "selected_at": "2025-09-07T18:23:23.412436Z"
  },
  {
    "source": "posts",
    "id": 369901,
    "title": "I'm just so overwhelmed right now.",
    "self_text": "On the work side of things: I am currently a college student living at home with a 20 hour a week job. The classes alone (Calc iii, Discrete Math, Engineering stats, and A Comp Sci class) are a lot. My job is a programming internship that I am going to quit at the end of the semester. It comes out to over 60 hours a week of mentally intensive work. My job is actually the part that stresses me out the most. I work from home and have part time hours, but I will get sent messages at random times, once I was sent a message as late as 10 PM. I'm also being underpaid for my work.  On the romance side of things: I'm gay, I met a guy whose bi about a year ago and he stopped messaging me a few months ago. He actually stopped messaging all of his friends as far as I can tell. I developed feelings for him but never expressed them to him. I managed to find his twitter and it tuns out that he has somehow become a little homophobic over the few months that he stopped messaging me. It's never explicitly hate, and its hard to describe without showing exact tweets, but its stuff like tweeting \"Go woke go broke\" when Velma was revealed to be gay, or stuff like \"The states should be allowed to decide marriage\" when we both live in a very conservative and religious state. To add onto that my parents are part of that religious conservative bunch but they don't know I'm gay so it doesn't really matter.  A third thing: I contacted my school's counseling center about depression, I had an intake session, which is an assessment. They said they would e-mail me, and they never did. I have some pretty bad social/confrontation anxiety so I get anxious about calling them back and its been almost 2 months since the intake session.  On the social end of things: I actually do have pretty good friends who are there for me. But there is this mental block that keeps me from reaching out to them.  Needless to say, all of this makes me feel like shit. I don't know what to do. I don't even know where to start. Maybe someone who's not in my current mental state can see something I'm not. I just don't know what to do. I don't even know if I'm not a danger to myself anymore.",
    "subreddit": "Vent",
    "selected_at": "2025-09-07T18:28:49.240220Z"
  },
  {
    "source": "posts",
    "id": 1035396,
    "title": "I’m afraid to lose her",
    "self_text": "At the beginning of our relationship she was always down to hang out, she would go out of her way to see me, I love spending time with her, she used to text me paragraphs about anything, telling me about her day, something she found funny, literally anything. I don’t get that anymore though, when we text she gives me one liners or just one word responses, we barely see each other cause I have a new 9-5 job and she has strict parents so she’s afraid they’re gonna get suspicious. When we call we barely say anything, but when I do see her in person she’s fine, she’s laughing, jumpy, cracks jokes, we go on expensive dates and spend time doing whatever the hell we want and we can talk for ages when we see each other in person, but we barely get to do that now.",
    "subreddit": "relationship_advice",
    "selected_at": "2025-09-07T18:29:36.151779Z"
  },
  {
    "source": "posts",
    "id": 516124,
    "title": "WIBTA if I (F22) don't cover all the car fees on a holiday, my friend (F22) booked us for free?",
    "self_text": "First time poster. Long time reader, I also apologise as I am on mobile. 2 months ago me (F22) and my best friend (F22) booked a staycation which will be happening in 2 weeks with a voucher my friend got through her work (this was given to her for free). It covered the price of a 2 night hotel stay and breakfast for the 2 mornings. The city we are staying in is historic and pricey. We are mainly going for the christmas markets. I work as a Part-Time Waitress (still at uni) and my friend works as a Customer Service Rep (very small salary). We normally wouldn't be able to afford this trip.   I was incredibly grateful for her inviting me along, I even offered at the very beginning to give her some money for using her free voucher on the both of us. She said 'no' and that she didn't really want to do it on her own and I am her closest friend! Still I always expressed how appreciative I was. I had already agreed to drive us to the hotel and to any events/places she wanted to go to. For example, the morning we arrive at the hotel she wants to spend the day in another city nearby (my friend has never been - I have), so I would be driving us there and back. And then when our holiday ends I will drive her home and then myself.   However, I thought we were going to split petrol and parking. Especially as she booked the hotel without checking if they have any parking facilities (they don't) and the parking is going to be about £15 each day, not including the other city we are visiting. With petrol split between the both of us being MAX £20. However I did not expect her to pay half, as she has provided the hotel, something like a 60/40 split, with me paying the 60%. I thought this was fair, considering I am doing all the driving and therefore cannot drink or do anything that can impact my ability to drive. And as I am getting us discounted dinners due to the company I work for getting us 50% of dinner and drinks for the 2 nights we are away. She still contributes some but it's not all.   Well, when I asked her how she wanted to go about paying her half of the petrol etc (like shall we do it before the trip, during or after) she said she thought she would only have to contribute max £10 for everything. As she is providing the hotel stay, even though when we booked this she never mentioned it once.  So now we are at an impasse, she wishes to postpone/cancel altogether, because I dont really see how I should have to cover all the car expensives. I could theoretically cover the costs, as I am no longer having to pay for the hotel, I just do not feel like I should have too. Plus if she cancels I will have 3 days off work (unpaid) for no reason. She states that if she had known that I didn't want to pay all the car fees she would of used the voucher for something else. So I can see her side, but idk, reddit WIBTA?",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T18:30:09.842380Z"
  }
]