[
  {
    "source": "posts",
    "id": 545079,
    "title": "[Spoilers Extended] Shireen \"Bright Reborn\"",
    "self_text": "Shireen's name may be a clue in favor of the theory that she will be sacrificed to R'llor. I think there is some wordplay going on here.  Separated into the two syllables \"Shir\" and \"Reen\" the name can be read as \"Bright-Reborn\" using Old English (which George very commonly uses) and French.  >Shere or Shire is derived from the Old English \"scir\", meaning  \"fair, bright, shining\" .  >René meaning  born again or reborn  in French is derived from the Latin name Renatus.  Why think French? Because the name Shireen or \"Shereen\" is also a French name from the word \"chéri\"  (Listen to Google translate French to English say chéri. The pronunciation is almost exactly the same) . Also George likes French and the history of France as he motioned when discussing the book  Les Rois Maudits  which was an inspiration for ASOIAF.  This reading of the name very closely matches the language used when a follower of R'llor discusses fire sacrifice or death.  >\"Let these girls be reborn in light. - Victarion  >Better that they be reborn into the light.\" - Selyse   The name \"Shireen\" is a play on words.  Within the \"darling\" Shireen or \"chérie\"  hides a more sinister meaning related to R'llor worship.",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-06T23:16:27.457209Z"
  },
  {
    "source": "posts",
    "id": 287816,
    "title": "KD belongs to the oddest set of teams ever: OKC - 3 MVP in their prime, GSW - greatest cheat-code ever, BRK - most dysfunctional team ever",
    "self_text": "I think history will look back on KD career with straight up movie-like narrative.  He chose to walk away from OKC when they were that close to win it all with 3 future MVP in their early prime.  Then  jumping to GSW to form possibly the greatest team ever ....   and then promptly leaving to join the most dysfunctional team ever, and wanting to add Ime Udoka as their HC",
    "subreddit": "nba",
    "selected_at": "2025-09-06T23:19:25.944250Z"
  },
  {
    "source": "posts",
    "id": 371391,
    "title": "What happens to muggle-borns who don’t go to Hogwarts?",
    "self_text": "Let’s use Hermione as an example because we know she became a powerful witch. What if Hermione chose not to go to Hogwarts? Could she have studied magic on her own later in life? Could she have performed wandless magic? Made potions?  Considering both potential magical ability and what the Ministry of Magic allows, what do you think becomes of muggle-borns who don’t go to Hogwarts?  Edit: If you think attending Hogwarts is mandatory, how is it enforced for people who don’t want to go?",
    "subreddit": "harrypotter",
    "selected_at": "2025-09-06T23:21:31.022250Z"
  },
  {
    "source": "posts",
    "id": 872616,
    "title": "First time watcher of the OC and GG and I need to talk about these ships!",
    "self_text": "I spent the past few months watching The OC, then Gilmore Girls. I felt a sense of deja vu watching Jess and Rory’s relationship in GG. It felt like they kept setting them up to be endgame but all the things that happened behind the scenes made it near impossible, just like Ryan and Marissa’s relationship on OC. It also felt like Logan and Taylor played the same type of characters, they tried really hard to make them “the one” since they couldn’t make Rory and Jess, and Ryan and Marissa endgame. I hope if there is another revival that we’ll see Jess and Rory finally have good timing and be in a good place in their lives to be together after a lot of character growth. Especially since we’ll never get the closure for Marissa and Ryan!",
    "subreddit": "GilmoreGirls",
    "selected_at": "2025-09-06T23:24:13.050412Z"
  },
  {
    "source": "posts",
    "id": 900671,
    "title": "Devastating Endings For Kids",
    "self_text": "I’m looking for suggestions for horror movies that have child protagonists that lose or die in the end.  I’m thinking of movies like INVADERS FROM MARS or TROLL 2. Both of them wrecked me when I first saw them as a little boy, I was definitely not prepared for the plucky kid to not win and save the day.   I still love brutal and/or ironic horror movie endings like THE MIST etc. but if anyone has any suggestions for one’s with losing kids, please let me know. Thanks!",
    "subreddit": "horror",
    "selected_at": "2025-09-06T23:26:58.975924Z"
  },
  {
    "source": "humorposts",
    "id": 1848,
    "title": "In Superman (2025), After a villain and threatens to kill the reporter Superman does interviews with. Superman decides to make an interview with Lois Lane putting her at risk of a villain killing her. This is because the \"I have a secret identity to protect those I love\" is always bullshit",
    "self_text": "",
    "subreddit": "shittymoviedetails",
    "selected_at": "2025-09-06T23:27:52.399936Z"
  },
  {
    "source": "posts",
    "id": 1018372,
    "title": "Say what you will about Die Hard, but it has the best ending for a Christmas movie…",
    "self_text": "Hans down.",
    "subreddit": "Jokes",
    "selected_at": "2025-09-06T23:35:21.887756Z"
  },
  {
    "source": "posts",
    "id": 603572,
    "title": "Timeline",
    "self_text": "Anyone know where to find the timing of filming/the reunion? I saw a post saying the weddings were a year and a half ago and a week after season 2 was filmed! We’re the reunions recent?",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-06T23:42:46.326722Z"
  },
  {
    "source": "posts",
    "id": 1006914,
    "title": "Birch Grove spa s2/e16",
    "self_text": "Do you think there’s any chance Emily intended to give both certificates to the spa to Lorelai, or was she truly being vindictive? She only states that she wants to go once Loreley talks about how great it was, and she makes a comment that she has no interest in spies. I kind of assume it’s the vindictive stuff, but I just got curious. Thoughts?",
    "subreddit": "GilmoreGirls",
    "selected_at": "2025-09-06T23:50:57.341796Z"
  },
  {
    "source": "posts",
    "id": 349716,
    "title": "Which movies do you remember hating as a kid and why?",
    "self_text": "I couldn't stand 3 NINJAS. The neighbor kid was obsessed with that movie and we'd often go to his house since he was the only one with a VCR and he'd force us to watch 3 NINJAS and them practice karate moves on us (which never hurt, mind you). Hate, hate this movie. Years later, I saw a sequel and it was even worse than the original.   MY GIRL 2. I actually liked the first movie so I was excited to watch the sequel. It turned out to be a boring ass movie about Vada looking for her dead mother's backstory and then getting her first kiss with the LAST ACTION STAR kid. Jesus, Gross!   HOME ALONE 3. Pretty pointless to do a HOME ALONE movie without Macaulay Culkin and Alex D. Linz was no Culkin. Pity Kieran Culkin was already in HOME ALONE, he would have been a decent replacement.",
    "subreddit": "movies",
    "selected_at": "2025-09-06T23:59:41.730222Z"
  },
  {
    "source": "posts",
    "id": 322218,
    "title": "broke boy season?",
    "self_text": "the age differences made finances weird this season and that made the dynamics so weird. cole chose Zanab because he could tell she was rich. thats why he labeled colleen his “poor” option. Bartiste was done w raven when she started her sugar daddy/trick spiel bc he wants to drain a woman’s pockets, not the other way around. Now he’s rubbing his little hands together over Nancy’s money.  Brennon started the proposal saying he’s broke. like??  and SK is a damn student. Talking about he needs to downsize.   Mind you, they’re pairing them with women in their 30s, who all expressed they wanted kids. It’s just weird, and set them up for failure I think. Alexa wants a house, Raven’s ready for rent divided by 2, Nancy got houses to buy…like realistically women still desiring children past 30 need real providers.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T00:13:59.777226Z"
  },
  {
    "source": "posts",
    "id": 1026621,
    "title": "Love Is Blind discord server!",
    "self_text": "This is new new, but we have one for Love Island and it’s so much fun. If you join and have suggestions for channels, content, etc. please lmk!!  https://discord.gg/fEhbmEfe",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T00:17:37.509336Z"
  },
  {
    "source": "posts",
    "id": 327894,
    "title": "THMT Trauma",
    "self_text": "I binge watched for the first time all of THMT in about 3 weeks. Today in Target an employee walked by with their walkie talkie crackling and going off. I jumped and looked down and almost said “under his eye.” 😅 Just some little excess trauma.",
    "subreddit": "TheHandmaidsTale",
    "selected_at": "2025-09-07T00:35:36.633135Z"
  },
  {
    "source": "posts",
    "id": 341979,
    "title": "SK &amp; Raven",
    "self_text": "Although unconventional at the beginning. SK and Raven’s relationship seemed so honest and pure.  I am convinced about the fact they are dating/engaged but just decided not to get married as a part of this experiment.   Ps: Tbh that is what any sane person would do.  UPDATE: SK has lost my respect. Sorry.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T15:40:21.937810Z"
  },
  {
    "source": "posts",
    "id": 343882,
    "title": "The problem between Zanab and Cole (and most of the cast)",
    "self_text": "I know the show is reality television and not everything is real, but the one thing that is real are the issues and feelings between the couples. And the issues in Zanab’s and Cole’s relationship is not only Zanab’s inability to release control once in a whole, but also, communication.  Cole is young and a male. Most men hav a harder time communicating and expressing their thoughts and emotions and I heard a whole lot of things from him, mainly between the lines, that Zanab either refused to hear or couldn’t hear. I think she has this image of herself that she is great at communicating and perfect and what’s to keep everything nice and clean that when that is disrupted she shuts down. Cole was trying to be nice and cook dinner for Zanab, and because it wasn’t being done the way she thought it should be done she took over. And I think Cole just let it happen, because he was trying to keep the peace.  So when they were sitting down and he kept saying “Someone nice” and “I want my wife to like me” and “Look what happened in the kitchen” he was saying; “I tried to make dinner for you and you took over and made me feel stupid for trying.” Don’t get me wrong, the nerf ball in the kitchen was dangerous, but he was trying to have fun.  I think Zanab needs to; 1) be honest about her relationship with Cole and realize they are too opposite for it to work, 2) Work on living in the moment and not taking life so seriously, 3) Learn how to receive criticism from your SO without feeling attacked or getting defensive. And Cole needs to 1) Mature a little bit, 2) Stand up to his family more strongly and 3) Learn how to communicate without getting petty when he gets annoyed that his SO isn’t hearing what he is saying.  I honestly don’t think Cole and Zanab are bad people, they just aren’t good for each other and I think it has to do with their age gap and where they are in life.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T18:15:24.023096Z"
  }
]