[
  {
    "source": "posts",
    "id": 545079,
    "title": "[Spoilers Extended] Shireen \"Bright Reborn\"",
    "self_text": "Shireen's name may be a clue in favor of the theory that she will be sacrificed to R'llor. I think there is some wordplay going on here.  Separated into the two syllables \"Shir\" and \"Reen\" the name can be read as \"Bright-Reborn\" using Old English (which George very commonly uses) and French.  >Shere or Shire is derived from the Old English \"scir\", meaning  \"fair, bright, shining\" .  >René meaning  born again or reborn  in French is derived from the Latin name Renatus.  Why think French? Because the name Shireen or \"Shereen\" is also a French name from the word \"chéri\"  (Listen to Google translate French to English say chéri. The pronunciation is almost exactly the same) . Also George likes French and the history of France as he motioned when discussing the book  Les Rois Maudits  which was an inspiration for ASOIAF.  This reading of the name very closely matches the language used when a follower of R'llor discusses fire sacrifice or death.  >\"Let these girls be reborn in light. - Victarion  >Better that they be reborn into the light.\" - Selyse   The name \"Shireen\" is a play on words.  Within the \"darling\" Shireen or \"chérie\"  hides a more sinister meaning related to R'llor worship.",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-06T23:16:27.457209Z"
  },
  {
    "source": "posts",
    "id": 287816,
    "title": "KD belongs to the oddest set of teams ever: OKC - 3 MVP in their prime, GSW - greatest cheat-code ever, BRK - most dysfunctional team ever",
    "self_text": "I think history will look back on KD career with straight up movie-like narrative.  He chose to walk away from OKC when they were that close to win it all with 3 future MVP in their early prime.  Then  jumping to GSW to form possibly the greatest team ever ....   and then promptly leaving to join the most dysfunctional team ever, and wanting to add Ime Udoka as their HC",
    "subreddit": "nba",
    "selected_at": "2025-09-06T23:19:25.944250Z"
  },
  {
    "source": "posts",
    "id": 371391,
    "title": "What happens to muggle-borns who don’t go to Hogwarts?",
    "self_text": "Let’s use Hermione as an example because we know she became a powerful witch. What if Hermione chose not to go to Hogwarts? Could she have studied magic on her own later in life? Could she have performed wandless magic? Made potions?  Considering both potential magical ability and what the Ministry of Magic allows, what do you think becomes of muggle-borns who don’t go to Hogwarts?  Edit: If you think attending Hogwarts is mandatory, how is it enforced for people who don’t want to go?",
    "subreddit": "harrypotter",
    "selected_at": "2025-09-06T23:21:31.022250Z"
  },
  {
    "source": "posts",
    "id": 872616,
    "title": "First time watcher of the OC and GG and I need to talk about these ships!",
    "self_text": "I spent the past few months watching The OC, then Gilmore Girls. I felt a sense of deja vu watching Jess and Rory’s relationship in GG. It felt like they kept setting them up to be endgame but all the things that happened behind the scenes made it near impossible, just like Ryan and Marissa’s relationship on OC. It also felt like Logan and Taylor played the same type of characters, they tried really hard to make them “the one” since they couldn’t make Rory and Jess, and Ryan and Marissa endgame. I hope if there is another revival that we’ll see Jess and Rory finally have good timing and be in a good place in their lives to be together after a lot of character growth. Especially since we’ll never get the closure for Marissa and Ryan!",
    "subreddit": "GilmoreGirls",
    "selected_at": "2025-09-06T23:24:13.050412Z"
  },
  {
    "source": "posts",
    "id": 900671,
    "title": "Devastating Endings For Kids",
    "self_text": "I’m looking for suggestions for horror movies that have child protagonists that lose or die in the end.  I’m thinking of movies like INVADERS FROM MARS or TROLL 2. Both of them wrecked me when I first saw them as a little boy, I was definitely not prepared for the plucky kid to not win and save the day.   I still love brutal and/or ironic horror movie endings like THE MIST etc. but if anyone has any suggestions for one’s with losing kids, please let me know. Thanks!",
    "subreddit": "horror",
    "selected_at": "2025-09-06T23:26:58.975924Z"
  },
  {
    "source": "humorposts",
    "id": 1848,
    "title": "In Superman (2025), After a villain and threatens to kill the reporter Superman does interviews with. Superman decides to make an interview with Lois Lane putting her at risk of a villain killing her. This is because the \"I have a secret identity to protect those I love\" is always bullshit",
    "self_text": "",
    "subreddit": "shittymoviedetails",
    "selected_at": "2025-09-06T23:27:52.399936Z"
  },
  {
    "source": "posts",
    "id": 1018372,
    "title": "Say what you will about Die Hard, but it has the best ending for a Christmas movie…",
    "self_text": "Hans down.",
    "subreddit": "Jokes",
    "selected_at": "2025-09-06T23:35:21.887756Z"
  },
  {
    "source": "posts",
    "id": 603572,
    "title": "Timeline",
    "self_text": "Anyone know where to find the timing of filming/the reunion? I saw a post saying the weddings were a year and a half ago and a week after season 2 was filmed! We’re the reunions recent?",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-06T23:42:46.326722Z"
  },
  {
    "source": "posts",
    "id": 1006914,
    "title": "Birch Grove spa s2/e16",
    "self_text": "Do you think there’s any chance Emily intended to give both certificates to the spa to Lorelai, or was she truly being vindictive? She only states that she wants to go once Loreley talks about how great it was, and she makes a comment that she has no interest in spies. I kind of assume it’s the vindictive stuff, but I just got curious. Thoughts?",
    "subreddit": "GilmoreGirls",
    "selected_at": "2025-09-06T23:50:57.341796Z"
  },
  {
    "source": "posts",
    "id": 349716,
    "title": "Which movies do you remember hating as a kid and why?",
    "self_text": "I couldn't stand 3 NINJAS. The neighbor kid was obsessed with that movie and we'd often go to his house since he was the only one with a VCR and he'd force us to watch 3 NINJAS and them practice karate moves on us (which never hurt, mind you). Hate, hate this movie. Years later, I saw a sequel and it was even worse than the original.   MY GIRL 2. I actually liked the first movie so I was excited to watch the sequel. It turned out to be a boring ass movie about Vada looking for her dead mother's backstory and then getting her first kiss with the LAST ACTION STAR kid. Jesus, Gross!   HOME ALONE 3. Pretty pointless to do a HOME ALONE movie without Macaulay Culkin and Alex D. Linz was no Culkin. Pity Kieran Culkin was already in HOME ALONE, he would have been a decent replacement.",
    "subreddit": "movies",
    "selected_at": "2025-09-06T23:59:41.730222Z"
  },
  {
    "source": "posts",
    "id": 322218,
    "title": "broke boy season?",
    "self_text": "the age differences made finances weird this season and that made the dynamics so weird. cole chose Zanab because he could tell she was rich. thats why he labeled colleen his “poor” option. Bartiste was done w raven when she started her sugar daddy/trick spiel bc he wants to drain a woman’s pockets, not the other way around. Now he’s rubbing his little hands together over Nancy’s money.  Brennon started the proposal saying he’s broke. like??  and SK is a damn student. Talking about he needs to downsize.   Mind you, they’re pairing them with women in their 30s, who all expressed they wanted kids. It’s just weird, and set them up for failure I think. Alexa wants a house, Raven’s ready for rent divided by 2, Nancy got houses to buy…like realistically women still desiring children past 30 need real providers.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T00:13:59.777226Z"
  },
  {
    "source": "posts",
    "id": 1026621,
    "title": "Love Is Blind discord server!",
    "self_text": "This is new new, but we have one for Love Island and it’s so much fun. If you join and have suggestions for channels, content, etc. please lmk!!  https://discord.gg/fEhbmEfe",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T00:17:37.509336Z"
  },
  {
    "source": "posts",
    "id": 327894,
    "title": "THMT Trauma",
    "self_text": "I binge watched for the first time all of THMT in about 3 weeks. Today in Target an employee walked by with their walkie talkie crackling and going off. I jumped and looked down and almost said “under his eye.” 😅 Just some little excess trauma.",
    "subreddit": "TheHandmaidsTale",
    "selected_at": "2025-09-07T00:35:36.633135Z"
  },
  {
    "source": "posts",
    "id": 341979,
    "title": "SK &amp; Raven",
    "self_text": "Although unconventional at the beginning. SK and Raven’s relationship seemed so honest and pure.  I am convinced about the fact they are dating/engaged but just decided not to get married as a part of this experiment.   Ps: Tbh that is what any sane person would do.  UPDATE: SK has lost my respect. Sorry.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T15:40:21.937810Z"
  },
  {
    "source": "posts",
    "id": 343882,
    "title": "The problem between Zanab and Cole (and most of the cast)",
    "self_text": "I know the show is reality television and not everything is real, but the one thing that is real are the issues and feelings between the couples. And the issues in Zanab’s and Cole’s relationship is not only Zanab’s inability to release control once in a whole, but also, communication.  Cole is young and a male. Most men hav a harder time communicating and expressing their thoughts and emotions and I heard a whole lot of things from him, mainly between the lines, that Zanab either refused to hear or couldn’t hear. I think she has this image of herself that she is great at communicating and perfect and what’s to keep everything nice and clean that when that is disrupted she shuts down. Cole was trying to be nice and cook dinner for Zanab, and because it wasn’t being done the way she thought it should be done she took over. And I think Cole just let it happen, because he was trying to keep the peace.  So when they were sitting down and he kept saying “Someone nice” and “I want my wife to like me” and “Look what happened in the kitchen” he was saying; “I tried to make dinner for you and you took over and made me feel stupid for trying.” Don’t get me wrong, the nerf ball in the kitchen was dangerous, but he was trying to have fun.  I think Zanab needs to; 1) be honest about her relationship with Cole and realize they are too opposite for it to work, 2) Work on living in the moment and not taking life so seriously, 3) Learn how to receive criticism from your SO without feeling attacked or getting defensive. And Cole needs to 1) Mature a little bit, 2) Stand up to his family more strongly and 3) Learn how to communicate without getting petty when he gets annoyed that his SO isn’t hearing what he is saying.  I honestly don’t think Cole and Zanab are bad people, they just aren’t good for each other and I think it has to do with their age gap and where they are in life.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T18:15:24.023096Z"
  },
  {
    "source": "posts",
    "id": 1032659,
    "title": "what happened to ocean side did lance kill them",
    "self_text": "after 11x16 when lance was flipping a coin we never say ocean side again. where they killed or just taken over by the commonwealth. i wish they showed what happened to them after the final episode like daryl could have drove by them and we would have seen they were ok. but nothing i just want to know if they died or not",
    "subreddit": "thewalkingdead",
    "selected_at": "2025-09-07T18:42:29.770609Z"
  },
  {
    "source": "posts",
    "id": 522159,
    "title": "Azor Ahai / The Prince that was promised is about Dragons, and the dragonriders are decendants of him.",
    "self_text": "If you look closely at the story about Azor Ahai i see some paralells between the Story of Dany and the song of Daemon to Vermithor.  At first we need to look at the Story of Azor Ahai, first he tested his 'weapon\" with water and the Weapon did Break/ not succeed.  Later he fought with his weapon against a lion, and his weapon broke again.  Later he made the sacrifice of his wife he drove it tru her \"heart' and he had a strong weapon.  &#x200B;  Now lets take a look at the song of Daemon: \"  Fire breather / Winged leader / But two heads To a third sing. From my voice: The fires have spoken / And the price has been paid / With blood magic. With words of flame / With clear eyes / To bind the three / To you I sing. As one we gather / And with three heads / We shall fly as we were destined / Beautifully, freely.”    The prophecy is a figure of speech, when the long night occuurd, the bloodmages wanted to weaponise a Firewyrm, but when they came across water they could not fly over it so they could not succeed. then they tried a wyvern to fight the lion of the night, but because he had no fire he could not succeed. Then the bloodmages tried to cross those two, and gave it life by doing a bloodritual with her  baby and that is wat putting the sword tru his wife heart and gave the spirit of the unborn baby into the dragon, and so is it that dragons came into the world who ended the long night.  All the targaryans/dragonriders decent from Azor Ahai, and you need the gene from azor azai to bond with a dragon because his spirit in in there",
    "subreddit": "HouseOfTheDragon",
    "selected_at": "2025-09-07T18:42:32.364163Z"
  },
  {
    "source": "posts",
    "id": 318870,
    "title": "It was a really stupid idea to have Jennifer Tilly play an in-universe version of herself",
    "self_text": "Tilly first played Tiffany as a human in Bride of Chucky, then she ended up in doll form and then switched bodies with the movie Tilly while Tilly now plays Tiffany in the body of Tilly and Tilly now voices her fictional self in Tiffany’s body which doesn’t seem that much different than when Tilly played Tiffany before in doll form. This whole thing is such a mindfuck.",
    "subreddit": "Chucky",
    "selected_at": "2025-09-07T18:42:38.562143Z"
  },
  {
    "source": "posts",
    "id": 914635,
    "title": "(Spoilers Extended) Speculation on Bronn’s future role in the story",
    "self_text": "I think it’s pretty clear the Bronn still has more to do, and so far his character has been about him rising to ever more insane positions, despite starting out as interchangeable sellsword #2. Additionally he has also gotten tied up in themes relating to Cersei, specifically the tendency for her plans to backfire as well as her connection to self-fulfilling prophecies. We can see this with the whole Falyse Stokeworth incident, which so far just seems like a random plot point, but I think it might pay off in a big way.  I feel like the Golden Company is going to take Kings Landing, simply because I’m not sure what else would be the point of including Aegon VI. But this won’t be the end for Cersei, as she will flee to Casterly Rock. This is because it seems very likely that we will see CR in the series at some point, and this would be the quickest, and most logical way to get a POV there. Additionally Jaime seems set up to go there, and him going to deal with Cersei would be a easy way to do that. But this is not where Bronn comes in.  So the GC puts KL to siege, and somehow it falls. Probably some combination of the GC storming the walls as well as betrayal and infighting amongst the defenders. Cersei grabs Tommen and makes a break for it with like a twenty person escort or something (not sure what will happen with Myrcella). Robert Strong charges forward, and is able to cut a path right through the GC’s siege lines, allowing Cersei’s party to get away. But they still need to get out of the Crownlands. They ride until another party approaches them. It’s Bronn. The Stokeworth men attack Cersei’s party, and at first it seems folly, as Robert Strong cuts men down left and right, but they don’t need to fight Robert Strong. Instead one of them grabs Tommen right off his horse and Bronn’s men ride off. Sometime later JonCon gets a letter from Bronn saying he has the Boy King, and proceeds to make several demands for the ransom, including a small council seat. As Aegon VI can’t have his predecessor just running around, these terms are accepted. Tommen goes to KL where he ends up dying somehow, my guess is at Tyene’s hands.  Now I do have some other ideas for Bronn, but this is getting to far from published material. I think this would be a surprising event, that would still make sense, and bring Bronn back into the story. It fits with Cersei’s scheme constantly backfiring as Bronn wouldn’t have the Stokeworth men if it wasn’t for Cersei siccing Falyse and Balman on him, and the only reason she did that is because she was afraid that Bronn would be a threat to her children (or somewhat she does say in her internal monologue that she just wants him gone), meaning that this would be another instance of a self-fulfilling prophecy in Cersei’s story.  What do you guys think?",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-07T18:45:22.718529Z"
  },
  {
    "source": "posts",
    "id": 484519,
    "title": "What's the population of Gilead? And what happened to black and gay people?",
    "self_text": "The lore of the handmaids tale interests me very much. But I feel like we don't see much of it outside of June's world.   I know that when the takeover started, many people fled continental US, and many people were killed. What of those left, what's the population?  Also, what happened to gay people and black people? Were they killed too? Like I feel like you only see black handmaids, some of who are also lesbians and fertile but aren't allowed to act on it (obviously). I think we see a photo of a gay male couple in season 5, who are presumed dead, so was that the fate of all gay men?",
    "subreddit": "TheHandmaidsTale",
    "selected_at": "2025-09-07T18:56:32.679399Z"
  },
  {
    "source": "posts",
    "id": 709474,
    "title": "[Spoilers Main] What happened to the Valyrian steel dagger?",
    "self_text": "How did the Valyrian steel dagger go from Aegon II to Petyr Baelish? After going on a deep dive through the asoiaf wiki, I believe the answer is through House Corbray.   First I checked Aegon II’s page and confirmed that all of his (legitimate) children died before they reached adulthood, meaning they had no descendants. I also confirmed that Alicent’s entire line ended shortly after the Dance, so there was no one else in that family line to inherit the dagger.  Next I went to Littlefinger’s page and tried to work backwards, but his family tree only goes back to his great-grandfather. I clicked on his link and saw this, “The great-grandfather of Petyr Baelish was a Braavosi sellsword that came to the Vale of Arryn in the service of Lord Corbray.”  Since there wasn’t any further ancestor listed I clicked on the link for House Corbray. I figured if this was the connection between Aegon II and Littlefinger then the Corbray’s probably supported the Greens, but no, they fought for the Blacks. Specifically Lord Leowyn Corbray and his younger brother, Ser Corwyn Corbray, led an army of 10,000 Vale men to march on King’s Landing. Rhaenyra and Aegon were already dead before they arrived, but they took back King’s Landing and helped to install Rhaenyra’s son, Aegon III as the new king.  Since he was only 11 at the time and too young to rule, a council of regents ruled in his place. Lord Leowyn Corbray was named Protector of the Realm until he died of Winter Fever in the Red Keep two years later.  One year after the war Ser Corwyn Corbray married Rhaena Targaryen, daughter of Daemon Targaryen and Laena Velaryon, but they have no children together. Two years after that he was made one of the seven regents. He was killed at Runestone later that year while trying to capture one of the failed claimants for the succession of the Vale.   I believe it was one of these two brothers who came into possession of the dagger. Lord Leowyn would appear to be the more likely owner of the dagger. He was named Protector of the Realm while Aegon III was too young to hold the title. Perhaps the dagger was given to him as a gift when he took on the role. He lived the remainder of his life in the Red Keep and his son Quenton became Lord after Leowyn’s death, so him inheriting the dagger would ensure it stayed with their family until one of the Baelishes comes to possess it.   But there is still a case to be made for Ser Corwyn having the dagger. He married a Targaryen and he became one of the regents, so there are several ways he could have come into possession of the dagger. When he died he was wielding House Corbray’s Valyrian steel sword, Lady Forlorn. There’s nothing on his wiki page written about what happened to his body or the sword immediately after his death, but Lady Forlorn ended up being wielded by Ser Gwayne Corbray in the first Blackfyre Rebellion, and later by Ser Lyn Corbray in A Feast for Crows, so the sword was returned to House Corbray after Ser Corwyn’s death. It’s possible if he had also been in possession of the Valyrian steel dagger that it would have been presented to Lord Quenton alongside Lady Forlorn.   It should also be noted that in the same chapter of AFfC (chapter 23, Alayna I) where Ser Lyn Corbray draws Lady Forlorn, Littlefinger tells Sansa that Lyn works for him, so there’s still a close tie between their families. Perhaps it wasn’t his great-grandfather who got the dagger from a Corbray, or maybe Littlefinger got it from Lyn.   Of course another possibility is that the dagger ended up in the possession of House Tully or House Arryn and Lysa gave it to Petyr. But that’s pretty boring in my opinion, and I hope we see something in the show about either Leowyn or Corwyn receiving the dagger at the end of the Dance of the Dragons.",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-07T19:10:05.950544Z"
  },
  {
    "source": "posts",
    "id": 425957,
    "title": "(Spoilers Extended) Living Valyrians Outside of Westeros",
    "self_text": "Was just thinking about how there must have been some pureblood Valyrians outside of the Freehold during the Doom besides the Targaryens, Celtigars, and Velaryons. Is there ever any mention of any prominent Valyrian families elsewhere in Essos? I could imagine a line posting up in Yi Ti or something if one happened to be visiting or sailing around during the Doom.",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-07T19:11:31.319341Z"
  },
  {
    "source": "posts",
    "id": 515020,
    "title": "What was Voldemort Planning to Make His Horcrux From When He Killed Harry?",
    "self_text": "We know from Dumbledore that Voldemort was planning to make his last horcrux using Harry's murder, so I'm wondering what your thoughts on what item of significance he had that he wanted to use?",
    "subreddit": "harrypotter",
    "selected_at": "2025-09-07T19:18:02.233883Z"
  },
  {
    "source": "posts",
    "id": 639918,
    "title": "what are your plans for Tuesday nights starting tomorrow?",
    "self_text": "Asking for a friend",
    "subreddit": "TheHandmaidsTale",
    "selected_at": "2025-09-07T19:18:19.503705Z"
  },
  {
    "source": "posts",
    "id": 585562,
    "title": "How to Train Your Dragon is Animated Valyria",
    "self_text": "Re-watching How to Train Your Dragon, and as a fun thought its basically the PG animated version of House of the Dragon specifically around Valyria . In the HotD lore you have blood magic that bonds dragons to valrayian blood lines.  In how to train your dragon you have a special dragon breed that connects with a rider and slowly shows others how to ride lesser dragons. Then you eventually get a lot of young dragon riders who use their dragons to win the war after the stubborn old ways of war with their naval fleet and army gets destroyed.   How to train your dragon is the PG animated series of HotD/Valaria.   &#x200B;   OBVIOUSLY, this is just a fun post and a stretch of your imagination but I was watching it and was laughing about so many lines you can stretch after reading Fire and Blood.",
    "subreddit": "HouseOfTheDragon",
    "selected_at": "2025-09-07T19:47:19.438156Z"
  },
  {
    "source": "posts",
    "id": 680742,
    "title": "Viren is such a babygirl",
    "self_text": "Sorry didn't have an idea for a title, I just wanted to say how I noticed that Viren was such a softie without his staff, he literally  wanted to give things up and just live his final days with peace, watching sunshines and shii, and when he got his staff back he truned back into big scary magic guy, #bringebabygirlvirenback (kinda a joke post, im just scrolling through this subreddit trying to fill up the void after watching the new season........)",
    "subreddit": "TheDragonPrince",
    "selected_at": "2025-09-07T19:52:14.497450Z"
  },
  {
    "source": "posts",
    "id": 503902,
    "title": "Half way through the reunion, why is no one being hard on Fartise?!",
    "self_text": "spoiler   Am I missing something here? Did they just say that 2 or 3 days after the wedding, Fartise had a blonde girl all over him? And everyone (especially the hosts) just let him get away with that so easily??  Poor Cole...",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T20:02:00.501274Z"
  },
  {
    "source": "posts",
    "id": 764172,
    "title": "[Spoilers Extended] What Mushroom stories do you actually believe?",
    "self_text": "It feels like almost all of his recounting of the Dance is one level of bullshit or another. What if his many, um, colourful versions of events do you actually believe were 100% (or close enough) to be true?",
    "subreddit": "asoiaf",
    "selected_at": "2025-09-07T20:02:32.435635Z"
  },
  {
    "source": "posts",
    "id": 370883,
    "title": "What if Heather Chandler from Heathers Lived?",
    "self_text": "In  the 1989 teen black comedy film Heathers, Heather Chandler, played by Kim Walker, ends up getting killed off early on at the hands of both Veronica Sawyer and Jason Dean, played by Winona Ryder and Christian Slater respectively. Had Heather Chandler lived, how different would the outcome/plot of the movie be?",
    "subreddit": "movies",
    "selected_at": "2025-09-07T21:19:20.083486Z"
  },
  {
    "source": "posts",
    "id": 376480,
    "title": "Privileged Rappers kinda underrated when you look at the album",
    "self_text": "People be bumping circo loco rich flex ofc, they go the hardest, but PR hella underrated",
    "subreddit": "Drizzy",
    "selected_at": "2025-09-07T22:13:48.949122Z"
  },
  {
    "source": "posts",
    "id": 327249,
    "title": "Nancy and Bartise Predictions",
    "self_text": "Spoilers   I just finished Episode 10. First of all, why did Bartise have an emotional breakdown? Is it because he recognized how kind and thoughtful Nancy’s gift was and he’s going to break her heart? OR was it incredibly meaningful because he’s going to say yes? I really can’t figure out what he’s going to do.",
    "subreddit": "LoveIsBlindOnNetflix",
    "selected_at": "2025-09-07T22:13:53.359458Z"
  }
]