[
  {
    "source": "posts",
    "id": 991170,
    "title": "Can I accept halal food from my secular nephew's father?",
    "self_text": "Asallam alaikom everyone,  I'm a revert living with my family, including sister, her boyfriend and their son, my nephew. I only speak what is necessary to my nephew's father and never greet him with hello or good morning. I never stay in same room with him alone but when I buy food for the house, it for everyone so he feels he wants to do the same. Can I accept halal food from him? Can I borrow some of his protein powder because I've been training really hard and muscles sore and need some food !  Or would that make me a hypocrite?  Jazak'Allah kheiran for reading from me",
    "subreddit": "islam",
    "selected_at": "2025-09-06T23:28:47.674593Z"
  },
  {
    "source": "posts",
    "id": 304315,
    "title": "Cleaning negative energy",
    "self_text": "Hello everyone. My mom tragically passed away at my home we shared about two weeks ago. I was very involved in trying to save her life. However while I’m healing going home has this incredible heaviness and fear. I can feel the negativity the moment I pull into the driveway. I’m becoming more spiritual and I’d like to learn how to remove this energy from my home. Any advise would be greatly appreciated. I do have sage, and the ability to play music. Any other ideas or prayers/chants to use?   Thank you",
    "subreddit": "spirituality",
    "selected_at": "2025-09-06T23:55:53.249555Z"
  },
  {
    "source": "posts",
    "id": 280776,
    "title": "Astral Projection attempts are meditations to work and cultivate vital energy as well",
    "self_text": "I feel that I work best my energy body when I'm attempting an Astral Projection. Even when I don't fully exit my physical body, I seem to be more readily available to work on my chakras and kundalini.  Here I'm sharing four reports from my notes. If anyone would like to hear me talk about it,https://www.youtube.com/watch?v=N5SJ_hhHq2s  In the 1st report, I talk about the intensity of the vibrations and sound, how distracting it can be and how I tried to maintain focus and courage by convincing myself that it's OK to experience this \"little death\". In the 2nd report, I talk about the obstacles of the mental constructs in the Astral Plane and the idea of the \"cocoon\". In the 3rd report, I talk about false awakening and the notion of percentages of perception. In the 4th report, I mention Kundalini energy and talk about strange and unique sensations after waking up physically. This last report is very reminiscent of an entheogenic experience, because of light patterns, physical body load, headspace and feelings of Oneness once physically awake.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-06T23:59:24.478413Z"
  },
  {
    "source": "posts",
    "id": 974954,
    "title": "We just left the church and our families don't know yet. Any advice?",
    "self_text": "I recently celebrated Thanksgiving with my in-laws. After we ate, everybody took a turn saying one thing they were grateful for. I just recently left the church with my wife and it was really hard to hear what they had to say. There were so many that talked about how grateful they were for the gospel, or for their blessings, or for their big families. My grandpa took a few minutes to talk about how grateful he was that all his children and grandchildren were faithful members of the church...It is getting harder and harder to see them. We are planning on telling them via email/letter (or something) because it is getting unbearable and exhausting. We are holding off for a bit because of a vacation next month we want to have fun on. We know it'll never be the same after we tell them, especially because the family is pretty extreme about it all. Anyone have any advice?",
    "subreddit": "exmormon",
    "selected_at": "2025-09-07T00:13:16.599851Z"
  },
  {
    "source": "posts",
    "id": 845793,
    "title": "Negative karma comes from dysfunction, not justice.",
    "self_text": "One single mistake ever was enough to blindside justice into a chain of mistakes (dysfunctions).   People getting negative karma aren't receiving \"teachings and lessons\", they're receiving other people's shortsighted vengeful wishes disguised as righteousness and originating from suffering.   Only someone who's been blindsided by suffering would wish bad to another in a counterproductive attempt to force empathy and without being able to realise that suffering itself is what perpetrates suffering.   Wishing evil to evil only feeds evil, wishing good health to evil feeds good functionality instead.   The trickier part of this is that the whole mechanism becomes invisible when we're not healthy enough to see it and the less we're seeing it the more we downspiral.   Negative karma was never the fruit of universal teachings intended on a purposeful punitive mindset, negative karma is another name for mistakes.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-07T00:19:47.143306Z"
  },
  {
    "source": "posts",
    "id": 431581,
    "title": "Do you think your family would recognize you if they were to end their shunning now?",
    "self_text": "It got me today. There really is no way back, I look different, I act different, even inside my head is different.  My hair is a buzz cut and ma hated those. I have a septum piercing and three very noticeable tattoos, I feel like the person they knew is gone.  There’s a new baby I haven’t met, but I can’t even bring myself to feel sad. I feel sad for the baby, he’s gorgeous. He hasn’t been indoctrinated yet because he’s only a few months but it’s already began obviously.",
    "subreddit": "exjw",
    "selected_at": "2025-09-07T00:24:46.330227Z"
  },
  {
    "source": "posts",
    "id": 414461,
    "title": "How is every one doing today?",
    "self_text": "Feel free to comment how you’re doing today. God bless you if you’re reading this. Each day for me is a struggle, is a battle , and I find hope in myself. I want to spread the gospel, help people with feelings of depression and suicide, help people who have had legal issues turn their life around. As many know from my previous posts, I struggle with depression , mostly because of the loss of the love of my life earlier this year. I’ve came across some very compassionate and supportive people . I continue to pray everyday to reunite with my girlfriend. I pray to eventually find work again. With Jesus on my side , and helping me through my journey, I want to help others with their journey as well. So far I’m on day 13 of 90 days of my home confinement. I hope to continue it and for it go well. Much love to anyone who toook the time out of their day to read this.",
    "subreddit": "Christianity",
    "selected_at": "2025-09-07T00:26:01.309151Z"
  },
  {
    "source": "posts",
    "id": 1002307,
    "title": "What am I experiencing?",
    "self_text": "I’ve been having these strong waves of existential dread lately. To preface, this is not necessarily a new experience for me as I’ve had these feelings virtually my whole life, but lately it feels a bit different.   It feels heavier if that makes sense. When I say that, I don’t mean to say I feel depressed or distraught, because I truthfully am not. But I do feel a strong sense of aimlessness or a void of sorts. I am quite content with my life, but I just can’t shake this looming feeling or heaviness. There’s nothing particularly or overwhelmingly stressful or bad in my life, in fact, quite the opposite. Yet, I still feel this void…it almost feels as if I am on autopilot, but completely aware of that fact.  Maybe a good way of putting it is that life feels surreal lately, but in a very neutral way. Not overly exciting or depressing. Life just seems to be happening, it almost feels as though I can feel everyone else experiencing life around me and I am just observing and playing my role in their realities without having one of my own, but I am completely aware that that’s what I am doing.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-07T15:58:31.437056Z"
  },
  {
    "source": "posts",
    "id": 311190,
    "title": "Music scares me",
    "self_text": "I am a Nazarene, so definitely not talking about hymnals.   Can someone explain the reason as to why Catholic mass music creeps me out? It’s hard to explain because I find it beautiful as well. For example, Miserere by Allegri. I could listen to it for an hour, but it feels scary to me, and I don’t know why.   Organs too, and imagining the sound reverb through a tall ceiling. This doesn’t happen with any other music; just Latin and Catholic mass choral selections.   Is there an explanation? Musicologically, psychologically, physiologically etc.?",
    "subreddit": "Catholicism",
    "selected_at": "2025-09-07T18:42:59.277569Z"
  },
  {
    "source": "posts",
    "id": 283295,
    "title": "CO texted me",
    "self_text": "I recently started the fade and switched halls and have been inactive for about 2 or 3 months. I don't believe it's the truth. Now most of my friends don't reach out now and no elders do either  My new co (we'll call him Will) was in my home congregation when I was a kid and they moved away to go to BSCC. his sister (we'll call her Ava) moved in and I became best friends with her kids and was at their home so much I see her as my second mom. Things have gotten so strained with my family I actually currently see her and her husband more than my own parents.  I spoke to them about being inactive a while back and just said that I was no longer active and searching for answers to see if it's really the truth (before I was fully convinced myself) and they were very kind which was a bit of a surprise to me that they would be so supportive.  Her brother Will is now my new CO and the visit is tonight. I had decided not to go but when he texted me I started to panic a bit.   He said \"Hi (name)! This is (name). Looking forward to seeing you this week! Hope we can get together.\"  Me not showing up to the co visit would get around quick and now everyone I haven't told yet will know. I'm worried this will ignite an elders visit. I don't know what to say back because even if I say \"Im inactive but would love to still see you\" if that will get me into uncomfortable conversations that could lead to dfed.   I just have so much going on as it is that this slow fade seemed the only thing I could handle for my mental health and this text got me all worried that things might blow up and send me into a bad spiral.  Please just asking for input based on your experiences.   Much love.",
    "subreddit": "exjw",
    "selected_at": "2025-09-07T19:45:11.354745Z"
  },
  {
    "source": "posts",
    "id": 626279,
    "title": "Can God forgive me for this?",
    "self_text": "I have a fear of blasphemy against the Holy Spirit and so I started thinking about how the Pharisees were saying Jesus was performing works by the power of evil spirits and how that was unforgivable and then my mind imagined a scenario where it felt like I was agreeing with the Holy Spirit being possessed by evil and now I feel so guilty because I willingly imagined this and I’m scared that it came from my heart. Please help me I’m so anxious because I feel that God will never forgive me. If this came from my heart can I ever be forgiven for this? I feel awful and I regret it",
    "subreddit": "Christianity",
    "selected_at": "2025-09-07T19:45:43.171201Z"
  },
  {
    "source": "posts",
    "id": 573860,
    "title": "Should we as a Christian doing Jewish tradition?",
    "self_text": "As a Christian, we know that Judaism is the root of Christianity. We also know that God Himself write ten commandments for the Israelites. And if we dissect, there are still hundreds of other laws that must be obeyed by Israelis.  I know that Jesus came to abolish all of the The law and change it with the law of love.  My question is, did all of The Law is abolish since the crucifixion or we still do some of the law? For example, Israelis are prohibited from eating pork based on Torah law. But we, as a Christian are allowed to eating pork.  I have this question because some church still teaching the tithe doctrine, which is it's the part of The Law, but they are allowed to eating pork",
    "subreddit": "Christianity",
    "selected_at": "2025-09-07T19:48:35.421925Z"
  },
  {
    "source": "posts",
    "id": 647166,
    "title": "Qualities that Allah loves and qualities that Allah hates/dislikes",
    "self_text": "QUALITIES THAT ALLAH LOVES    Tawbah (Repentance)    > \"For Allah loves those who turn to Him constantly (in repentance)\" (Surah Al Baqarah 2:222)   Repentance is a form of detoxification – Sincere repentance cleanses and beautifies the Iman (faith).  We all commit sins but Allah loves those who after committing sins, seek forgiveness with deep sorrow and regret.  This is the only way by which the past can be set right. Allah has a concern for those He loves, therefore each time we slip and relapse into the abyss of desires and sincerely repent, He (exalted be Him) leads us out of it to the summit of forgiveness and further relieves us of hardship and provides for us.    Taharah (Purification)     > \"Allah loves those who keep themselves pure and clean.\" (Surah Al Baqarah 2:222)    This is the external purification. The secret to this is performing the acts with the intention of following the example of the Prophet ﷺ.  The removal of filth from the body by performing wudhu (ablution) and ghusl (ritual bath) and removal of filth from the garment, body and place of prayer. They are acts that purify the body and radiate the Iman. It is a means by which Almighty Allah will wipe out our sins and raise our ranks.    Taqwa (Piety)    > \"for Allah loveth the righteous (the pious).\" (Surah Al Tawbah 9:4)    The fear of Allah is the source of a pure soul – it is borne out of love and obedience. Thus, a pious person is constantly driven to do good only.  He/She is humble and does not flaunt piety in front of others. The fear of Allah beautifies the Iman and is the origin of all good as one continues to strive to do only what pleases Allah and stay away from the things that would displease him.  Piety is an internal quality as the Prophet ﷺ said,  \"The piety is here, (and while saying so) he pointed towards his chest thrice.\"  (Sahih Muslim, Book #032, Hadith #6219) and it is a quality that puts us above others in the sight of Allah.    Ihsan (Goodness & Perfection)    > \"for Allah loves those who do good...\" (Surah Ali 'Imran 3:134)   Prophet Muhammad ﷺ said,  \"Ihsan is to worship Allah as if you see Him, and if you cannot achieve this state of devotion then you must consider that He is looking at you.\"  (Sahih Bukhari, Book #2, Hadith #47)  Ihsan goes beyond a noble trait; it is an integral part of Islam. It is the secret to an attentive heart – knowing that Allah is watching everything. This fills the heart with respect and veneration and one becomes too embarrassed to go against Allah's commands. It promotes performance of good deeds for the sake of Allah and not for show-off or to gain praise or fame.   5. Tawakkul (Trust in Allah)   > \"For Allah loves those who put their trust (in Him).\" (Surah Ali 'Imran 3:159)    The secret and reality of trust in Allah is the reliance of the heart on Allah alone. Therefore trusting in Allah by word of mouth is different from trusting in Him by the heart.  Reliance is doing and hoping; doing everything necessary within one's capability to achieve one's aim and hoping with tranquility of heart and soul and putting one's trust in Allah with firm belief that whatever the outcome might be, it is as a result of the Will of Allah and His Decree.  One should never feel that too much time has passed by without supplications being answered; rather we should always place our hope on the One who is able to do all things. Prophet Muhammad ﷺ says,  \"If you all depend on Allah, with due reliance, He would certainly give you provision as He gives to birds who go forth hungry in the morning and return with full bellies at dusk\"  (At-Tirmidhi)   6. Qist (Justice)   > \"for Allah loveth those who judge in equity.\" (Surah Al Ma'idah 5:42)   \"for Allah loves those who are fair (and just).\" (Surah Al Hujurat 49:9)    Justice is a prerequisite to peace which is missing in our contemporary society. It involves giving other people the right we give ourselves, treating people the way we would like to be treated.  Justice sounds like a word meant for the leaders alone but rather it affects us all.  It means:  > - To be equitable in speech and in actions.   - With no degree of discrimination or false testimony.   - It involves being fair with regards to one's family and those who are in our custody.   - Justice between children by not giving one preference over the other.   - By not committing wrong against oneself such as engaging in sinful practices and immoral acts.   - Justice with Allah in not associating any being with Him in worship and obedience.     7. Sabr (Patience)   > \"And Allah Loves those who are firm and steadfast (As-Sabirin (the patient)).\" (Surah Ali 'Imran 3:146)   Patience is one of the most noble of virtues and traits. It is to endure what one dislikes with a sense of acceptance and submission and anticipating Allah's reward.  Ali (may Allah be pleased with him) said:  \"patience to Iman is like the head to a body: if the head is cut off, the body perishes as well.\"  (Gems and jewels – wise sayings, interesting events & moral lessons from the Islamic history, compiled by Abdul-Malik Mujahid (Darussalam))  Muslims should adhere to patience when afflicted with calamity and should not yield either to desperation nor despondence because if we are patient, everything that was destined and preordained for us will occur and we will be rewarded. If we complain and are hopeless, then all that was destined for us will still occur, but we will be blamed for our impatience at Allah's Will.   8. Kindness   Ayesha (RA) narrated: The Messenger of Allah ﷺ said:  “Allah loves kindness in all matters.”  (Bukhari)   9. Humility of the Rich   Sa’d Ibn Abi Waqqas (RA) said: Allah’s Messenger ﷺ said:  “Allah loves the believer who is pious and rich, but does not show off.”  (Muslim)   10. Belief and Work   > Allah’s Messenger ﷺ said     “Dawood A.S. would never eat except from the earnings of his own hand’s work.”  (Sahih Bukhari)   “The upper hand is better than the lower hand, the upper hand being the one that gives and the lower hand being the one that receives”.  (Sahih Muslim)   “Allah loves the slave who believes and acquires a career (or work).”  (Tabarani)    11. A sense of Honour   Al-Tirmidhi narrated: Allah’s Messenger ﷺ said:  “Allah loves from amongst his slaves, the one who has a sense of zeal or honour.”    12. Magnanimity   Al-Hakim narrated: The Messenger of Allah ﷺ said:  “Allah is All-Generous and He loves generosity in sale, purchase and judgment.”    13. Virtuosity   The Messenger of Allah ﷺ said:  “Allah loves the believer who is poor but virtuous enough to refrain from begging though he has many children.”  (Muslim and Ahmed)   14. Strength   Allah’s Messenger ﷺ said:  “The strong believer is better and more loved by Allah than the weak one, but they are both good.”  (Muslim)  So we should try and stay fit for the Sake of Allah and encourage our children for sports more than playstation.   15. Love for the Sake of Allah   Allah’s Messenger ﷺ said: “[Allah says:]  ‘My love is due for those who love one another for My sake; My love is due for those who visit one another for My sake; My love is due for those who help one another for My sake; My love is due for those whose hearts are free of grudges and who uphold ties with one another for My sake.’”  (Ahmad, Classed as Sahih)   16. Continuous Performance of Righteous Deeds   Allah’s Messenger ﷺ said:  “The best loved deeds to Allah are the ones that are continuous even if they are not very many.”  (Bukhari and Muslim)   17. Good Manners and Conduct   Al-Tirmidhi narrated: Allah’s Messenger ﷺ said:  “The best loved by me and the nearest to me on the seats on the Day of Resurrection are those who have the best manners and conduct amongst you, who are intimate, are on good terms with others and are humble, and the most hated by me and who will be on the furthest seats from me are those who are talkative and arrogant.”    18. Dua   Allaah loves to be asked, and He encourages that in all things. He is angry with the one who does not ask of Him and He encourages His slaves to ask of Him. Allaah says (interpretation of the meaning):   > “And your Lord said: “Invoke Me [i.e. believe in My Oneness (Islamic Monotheism) and ask Me for anything] I will respond to your (invocation)” [Ghaafir 40:60]    Du’aa’ is very important in Islam, so much so that the Prophet ﷺ said:  “Du’aa’ is worship.”   (Narrated by al-Tirmidhi, 3372; Abu Dawood, 1479; Ibn Maajah, 3828)  QUALITIES THAT ALLAH HATES/DISLIKES   1. Israaf (extravagance)   > \"But waste not by excess: for Allah loveth not the wasters (Al-Musrifun (those who waste by extravagance)).\" (Surah Al An'am 6:141)   Excessive spending and lavishness in everything is the core of evil and leads to greater evil. It makes one forget the hereafter and preparing for it. Such acts would be a cause of humiliation and disgrace on the Day of Judgment.  That is why Almighty Allah has prescribed zakah (obligatory alms) and sadaqah (voluntary charity) in order to bless the wealth and to curb extravagance in eating, drinking, clothing and in everything we do.   2. Istikbaar (Pride)   > \"verily He loveth not the arrogant (proud).\" (Surah Al Nahl 16:23)   And the Prophet ﷺ says,  \"Pride is to completely disregard the truth and scorn (looking down upon) the people\"  (Muslim)  Sometimes a person might be deceived by his/ her knowledge, wealth and property, lineage and ancestry, or worship and be arrogant and boastful.  Al-Hasan Al-Basri advised that:  \"Do not become proud merely because you worship often, for consider what happened to Iblis after he spent a great deal of time worshipping\"  (Gems and jewels – wise sayings, interesting events & moral lessons from the Islamic history, compiled by Abdul-Malik Mujahid (Darussalam))  > Pride is among the greatest means of damage to a person's wealth and circumstances. It distances one away from Allah's love and \"He who has in his heart the weight of a mustard seed of pride shall not enter paradise.\" (Sahih Muslim, Book #001, Hadith #0166)    3. Mukhtal fakhoor (Arrogant boaster)   > \"for Allah loveth not any arrogant boaster.\" (Surah Luqman 31:18)    Being arrogant and boastful are a deadly combination – beauty, knowledge, wealth and noble lineage should be taken as gifts from Almighty Allah and one should be humble and grateful for them rather than make them a means of pride and oppression.  Servants of Allah cannot be true to themselves as long as they are flattering themselves, walking in an arrogant manner and looking down on people who are inferior to them and not mix with them. The one who is arrogant in this world will be disgraced on the Day of Judgment.  Prophet Muhammad ﷺ said,  \"The arrogant will be gathered on the Day of Judgment in the form of small ants. Humiliation will surround them from everywhere.\"  (At-Tirmidhi)   4. Udwaan (Transgression)   > \"for Allah loveth not those given to excess (Transgression).\" (Surah Al Ma'idah 5:87)    Human characteristics have limitations, which if surpassed would be transgression and if one falls short of it, it would be a defect – for example, generosity has a limitation, when surpassed, it becomes extravagance, when courage is surpassed, it becomes rashness; when ibadah (worship) is surpassed, one falls into the risk of adopting bid’ah - some of the Companions almost fell into this trap.  Narrated by Anas bin Malik: \"A group of three men came to the houses of the wives of the Prophet ﷺ asking how the Prophet worshipped (Allah), and when they were informed about that, they considered their worship insufficient and said, \"Where are we from the Prophet as his past and future sins have been forgiven.\" Then one of them said, \"I will offer the prayer throughout the night forever.\" The other said, \"I will fast throughout the year and will not break my fast.\" The third said,  \"I will keep away from the women and will not marry forever.\" Allah's Apostle  ﷺ  came to them and said, \"Are you the same people who said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I fast and break my fast, I do sleep and I also marry women. So he who does not follow my tradition in religion, is not from me (not one of my followers).\"\"  (Sahih Bukhari, Book #62, Hadith #1)   Therefore, moderation is the best way to deal with all matters – it is not to exaggerate and make it hard for ourselves by prohibiting the permissible things. And not to transgress the limits by excessively indulging in the permissible matters but rather we should only use what satisfies our need and not fall into extravagance.   5. Zulm (Evil, wrongdoing)   > \"but God loveth not those who do wrong (Zalimun (oppressors, polytheists and wrong doers)).\" (Surah Ali 'Imran 3:57)   This is a reprehensible trait whose existence spoils the Iman and darkens the heart. The wrongdoers are those who have chosen the tempting transient life instead of the hereafter. All acts of wrongdoing such as stealing, breach of trust, embezzlement, usurping the rights of others, and bribery, have serious consequences in the hereafter.  In a Hadith, Abu Dharr reported Allah's Messenger ﷺ as saying that Allah, the Exalted and Glorious, said:  \"My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another.\"  (Sahih Muslim, Book #032, Hadith #6246)   6. Khiyaanah (Treachery)   > \"for Allah loveth not the treacherous.\" (Surah Al Anfal 8:58)   The treacherous one is two-faced and inconsistent in words and deeds. Acts of treachery lead to betrayal, disloyalty, perfidy, deception and hypocrisy which in turn soil the Iman.   7. Ifsaad (Mischief-making)   > \"And Allah loveth not those who do mischief.\" (Surah Al Ma'idah 5:64)   This is a comprehensive term which includes great crimes, sins, oppression, carrying false tales, hypocrisy, tyranny and all kinds of mischief. All these acts are despicable and stain the Iman.  Hasten today to adopt the qualities that Almighty Allah loves and don't rest until they become second nature to you; hasten today to abandon all the qualities Allah does not love and don't relent until you hate them with all your heart. The Prophet ﷺ said:  \"Faith wears out in the heart of any one of you just as clothes wear out, so ask Allah to renew the faith in your hearts.\"  (Al-Haakim in Al-Mustadrak and Al-Haythami in Majma Az-Zawaa'id)  Therefore the key is supplication, resorting to Allah and sincere desire to please Him followed by action, so we say,   \"O Allah make Iman beloved to us and beautify it in our hearts.\"    8. Publicity of Evil   > \"Allah does not like that evil should be uttered in public except by him who has been wronged. And Allah is Ever All-Hearer, All-Knower.\" (4:148)   This is very common in our Ummah now, people commit sins openly and also when they do certain sins people don't know about they come and announce it with pride. These people call upon Allah's wrath which is a dangerous thing to do.   9. Obscene words and acts   Ahmed narrated: Allah's Messenger ﷺ said:  \"Allah hates obscene words and acts.\"   Again one of the most common disease our Ummah is suffering from. They use obscene language and think they are cool or just for fun.   10. Treachery   > \"Verily, Allah likes not any treacherous ingrate to Allah [those who disobey Allah but obey Satan].\" (22:38)    11. Oppression   > \"Verily, He likes not the Thalimun (oppressors, polytheists, and wrongdoers).\" (42:40)    12. Corruption   > \"And Allah likes not mischief.\"  (2:205)    13. Betrayal   > \"Verily, Allah does not like anyone who is a betrayer, a sinner.\"  (4:107)    14. Exultance for Worldly Desires   > \"Verily, Allah likes not those who exult (with riches, being ungrateful to Allah).\" (28:76)   The remedy for all these diseases is the love of Allah Almighty, His Messenger ﷺ and the Pleasures of the Hereafter. Allah's love has many fruits and positive consequences, namely, Allah gives whoever loves contentment and satisfaction and this is one of the graces of Allah in this world. Allah's Messenger ﷺ said:   \"If Allah loves someone He calls Gabriel (the angel) and says: I love so-and-so, so you love him. Gabriel loves him, and calls the other angels in Heaven to love that person. They love him, then his love will be made upon earth, and he becomes loved. And if Allah hates someone He calls Gabriel and says: I hate so-and-so and you hate him. Gabriel hates him and calls the angels in Heaven and says: Allah hates so-and-so, so you all hate him. They all hate him, and his hatred is made upon earth and he becomes hated.\"  (Muslim)  On the authority of Abu Abbas Abdullah bin Abbas (may Allah be pleased with him) who said: One day I was behind the Prophet (peace and blessings of Allah be upon him) [riding on the same mount] and he said, “O young man, I shall teach you some words [of advice]:  Be mindful of Allah and Allah will protect you. Be mindful of Allah and you will find Him in front of you. If you ask, then ask Allah [alone]; and if you seek help, then seek help from Allah [alone].  And know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they were to gather together to harm you with anything, they would not harm you except with what Allah had already prescribed against you. The pens have been lifted and the pages have dried.”  It was related by at-Tirmidhi, who said it was a good and sound hadeeth. Another narration, other than that of Tirmidhi, reads:  Be mindful of Allah, and you will find Him in front of you. Recognize and acknowledge Allah in times of ease and prosperity, and He will remember you in times of adversity. And know that what has passed you by [and you have failed to attain] was not going to befall you, and what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and hardship with ease . (Reference: Hadith 19, 40 Hadith an-Nawawi). https://sunnah.com/nawawi40:19#:~:text=Be%20mindful%20of%20Allah%20and%20you%20will%20find%20Him%20in,had%20already%20prescribed%20for%20you.  For source, see here: QUALITIES ALLAH LIKES & HATES",
    "subreddit": "islam",
    "selected_at": "2025-09-07T19:57:23.876299Z"
  },
  {
    "source": "posts",
    "id": 579100,
    "title": "Church dogma on Pachamama",
    "self_text": "A friend of mine brought this up during dinner talk and I want to know if it is a mortal sin to support Pachamama or if I need to go to confession.   Why is no priest but the radical ones talking about Pachamama? I don’t see a Bishop Barron video or any other priest with some intellectual discussion on why the Vatican did this and if it is a sin or not.",
    "subreddit": "Catholicism",
    "selected_at": "2025-09-07T20:59:34.181388Z"
  }
]