[
  {
    "source": "posts",
    "id": 991170,
    "title": "Can I accept halal food from my secular nephew's father?",
    "self_text": "Asallam alaikom everyone,  I'm a revert living with my family, including sister, her boyfriend and their son, my nephew. I only speak what is necessary to my nephew's father and never greet him with hello or good morning. I never stay in same room with him alone but when I buy food for the house, it for everyone so he feels he wants to do the same. Can I accept halal food from him? Can I borrow some of his protein powder because I've been training really hard and muscles sore and need some food !  Or would that make me a hypocrite?  Jazak'Allah kheiran for reading from me",
    "subreddit": "islam",
    "selected_at": "2025-09-06T23:28:47.674593Z"
  },
  {
    "source": "posts",
    "id": 304315,
    "title": "Cleaning negative energy",
    "self_text": "Hello everyone. My mom tragically passed away at my home we shared about two weeks ago. I was very involved in trying to save her life. However while I’m healing going home has this incredible heaviness and fear. I can feel the negativity the moment I pull into the driveway. I’m becoming more spiritual and I’d like to learn how to remove this energy from my home. Any advise would be greatly appreciated. I do have sage, and the ability to play music. Any other ideas or prayers/chants to use?   Thank you",
    "subreddit": "spirituality",
    "selected_at": "2025-09-06T23:55:53.249555Z"
  },
  {
    "source": "posts",
    "id": 280776,
    "title": "Astral Projection attempts are meditations to work and cultivate vital energy as well",
    "self_text": "I feel that I work best my energy body when I'm attempting an Astral Projection. Even when I don't fully exit my physical body, I seem to be more readily available to work on my chakras and kundalini.  Here I'm sharing four reports from my notes. If anyone would like to hear me talk about it,https://www.youtube.com/watch?v=N5SJ_hhHq2s  In the 1st report, I talk about the intensity of the vibrations and sound, how distracting it can be and how I tried to maintain focus and courage by convincing myself that it's OK to experience this \"little death\". In the 2nd report, I talk about the obstacles of the mental constructs in the Astral Plane and the idea of the \"cocoon\". In the 3rd report, I talk about false awakening and the notion of percentages of perception. In the 4th report, I mention Kundalini energy and talk about strange and unique sensations after waking up physically. This last report is very reminiscent of an entheogenic experience, because of light patterns, physical body load, headspace and feelings of Oneness once physically awake.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-06T23:59:24.478413Z"
  },
  {
    "source": "posts",
    "id": 974954,
    "title": "We just left the church and our families don't know yet. Any advice?",
    "self_text": "I recently celebrated Thanksgiving with my in-laws. After we ate, everybody took a turn saying one thing they were grateful for. I just recently left the church with my wife and it was really hard to hear what they had to say. There were so many that talked about how grateful they were for the gospel, or for their blessings, or for their big families. My grandpa took a few minutes to talk about how grateful he was that all his children and grandchildren were faithful members of the church...It is getting harder and harder to see them. We are planning on telling them via email/letter (or something) because it is getting unbearable and exhausting. We are holding off for a bit because of a vacation next month we want to have fun on. We know it'll never be the same after we tell them, especially because the family is pretty extreme about it all. Anyone have any advice?",
    "subreddit": "exmormon",
    "selected_at": "2025-09-07T00:13:16.599851Z"
  },
  {
    "source": "posts",
    "id": 845793,
    "title": "Negative karma comes from dysfunction, not justice.",
    "self_text": "One single mistake ever was enough to blindside justice into a chain of mistakes (dysfunctions).   People getting negative karma aren't receiving \"teachings and lessons\", they're receiving other people's shortsighted vengeful wishes disguised as righteousness and originating from suffering.   Only someone who's been blindsided by suffering would wish bad to another in a counterproductive attempt to force empathy and without being able to realise that suffering itself is what perpetrates suffering.   Wishing evil to evil only feeds evil, wishing good health to evil feeds good functionality instead.   The trickier part of this is that the whole mechanism becomes invisible when we're not healthy enough to see it and the less we're seeing it the more we downspiral.   Negative karma was never the fruit of universal teachings intended on a purposeful punitive mindset, negative karma is another name for mistakes.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-07T00:19:47.143306Z"
  },
  {
    "source": "posts",
    "id": 431581,
    "title": "Do you think your family would recognize you if they were to end their shunning now?",
    "self_text": "It got me today. There really is no way back, I look different, I act different, even inside my head is different.  My hair is a buzz cut and ma hated those. I have a septum piercing and three very noticeable tattoos, I feel like the person they knew is gone.  There’s a new baby I haven’t met, but I can’t even bring myself to feel sad. I feel sad for the baby, he’s gorgeous. He hasn’t been indoctrinated yet because he’s only a few months but it’s already began obviously.",
    "subreddit": "exjw",
    "selected_at": "2025-09-07T00:24:46.330227Z"
  },
  {
    "source": "posts",
    "id": 414461,
    "title": "How is every one doing today?",
    "self_text": "Feel free to comment how you’re doing today. God bless you if you’re reading this. Each day for me is a struggle, is a battle , and I find hope in myself. I want to spread the gospel, help people with feelings of depression and suicide, help people who have had legal issues turn their life around. As many know from my previous posts, I struggle with depression , mostly because of the loss of the love of my life earlier this year. I’ve came across some very compassionate and supportive people . I continue to pray everyday to reunite with my girlfriend. I pray to eventually find work again. With Jesus on my side , and helping me through my journey, I want to help others with their journey as well. So far I’m on day 13 of 90 days of my home confinement. I hope to continue it and for it go well. Much love to anyone who toook the time out of their day to read this.",
    "subreddit": "Christianity",
    "selected_at": "2025-09-07T00:26:01.309151Z"
  },
  {
    "source": "posts",
    "id": 1002307,
    "title": "What am I experiencing?",
    "self_text": "I’ve been having these strong waves of existential dread lately. To preface, this is not necessarily a new experience for me as I’ve had these feelings virtually my whole life, but lately it feels a bit different.   It feels heavier if that makes sense. When I say that, I don’t mean to say I feel depressed or distraught, because I truthfully am not. But I do feel a strong sense of aimlessness or a void of sorts. I am quite content with my life, but I just can’t shake this looming feeling or heaviness. There’s nothing particularly or overwhelmingly stressful or bad in my life, in fact, quite the opposite. Yet, I still feel this void…it almost feels as if I am on autopilot, but completely aware of that fact.  Maybe a good way of putting it is that life feels surreal lately, but in a very neutral way. Not overly exciting or depressing. Life just seems to be happening, it almost feels as though I can feel everyone else experiencing life around me and I am just observing and playing my role in their realities without having one of my own, but I am completely aware that that’s what I am doing.",
    "subreddit": "spirituality",
    "selected_at": "2025-09-07T15:58:31.437056Z"
  }
]