[
  {
    "source": "posts",
    "id": 476061,
    "title": "Computer Engineering or Computer Science",
    "self_text": "So currently I am only 13 so I'm obviously looking way into the future. If I am looking to become a computer engineer out of college and eventually work at a FAANG company, Would I be better inclined to major in computer science or computer engineering in college? Also would going to an Ivy League better my chances at landing programming jobs?",
    "subreddit": "learnprogramming",
    "selected_at": "2025-09-06T23:16:52.736077Z"
  },
  {
    "source": "posts",
    "id": 620095,
    "title": "Tracking Progress with new design",
    "self_text": "I just got the learning path today.  As I understand it, there are no more crowns, is that correct?  I liked the crowns to see how far I still have to go and how much progress I've made. I had challenged myself to do 5 crowns every week.  Is there any similar feature to track my progress? Or at least to know many percent of the path I have completed?   XP is useless because of boosts and other weird stuff.",
    "subreddit": "duolingo",
    "selected_at": "2025-09-06T23:19:14.456045Z"
  },
  {
    "source": "posts",
    "id": 321979,
    "title": "UK University spLD assessment for accessibility. What can I ask for?",
    "self_text": "So I have an disability appointment for spLD with my university, after my ADHD appointment.   One of the main reasons I went for my assessment was because of how badly it impacted my undergraduate. I am currently doing my masters & already struggling - which is why I am going for this appointment.   I just don’t really know what kind of support I can ask for? they asked how do I think they can help, so what they offer, I’m guessing, will be based on what I say I struggle with at uni  Obviously I don’t want to ask for things that won’t actually help.   At the same time, does anyone have examples of things that their university or DSA assisted them with that made university more accessible for them.   I struggle with inattentive/hyperactive and impulsive & I know support is individual, but if I could get ideas of examples it would be helpful.  (I literally know nothing about the service because I didn’t even know this was a thing till my course director told me)",
    "subreddit": "ADHD",
    "selected_at": "2025-09-06T23:19:56.484028Z"
  },
  {
    "source": "posts",
    "id": 933407,
    "title": "Do education councillors get a percentage of fees for enrolling students into certain universities abroad?",
    "self_text": "So a bunch of my friends and I  are in process of applying to uni abroad for further studies but every education councillors some of us have visited scrap our list of preferred colleges and keep on insisting on applying to the colleges from their list, it’s not like we don’t have the marks, on avg our marks fall in the bracket of 85%-90%. Do these people get a cut for enrolling students in their given list of abroad colleges?  Let’s not even start talking about their exorbitant fees just to help with a damn SOP 😒",
    "subreddit": "mumbai",
    "selected_at": "2025-09-06T23:20:08.227248Z"
  },
  {
    "source": "posts",
    "id": 308658,
    "title": "FastAPI seems to be losing connection with mysql database",
    "self_text": "Hey all.. Weird thing going on. I've got a very simple rest api built with FastAPI. it connects to a MySQL database with  the pymysql module and I do really simple 'select' queries. It runs great for a while and then suddenly it starts giving me 'internal server error' for anything that gets database content.  it's not logging anything except for the actual internal server error message, so that's kinda useless.  It feels like it's losing database connection but since I don't get any errors, I'm not sure how to check this (or how to fix that if that is what's happening).  Does anyone know where to start looking?",
    "subreddit": "learnpython",
    "selected_at": "2025-09-06T23:23:23.407537Z"
  },
  {
    "source": "posts",
    "id": 553002,
    "title": "Advice for someone taking the test tmr",
    "self_text": "For the test takers that took it today, what do you wish you studied more? Are there any helpful tips you guys can give me? Thanks in advance. I hope you all reached your goal or did even better!!!",
    "subreddit": "LSAT",
    "selected_at": "2025-09-06T23:24:11.636489Z"
  },
  {
    "source": "posts",
    "id": 783034,
    "title": "EA decision notifications",
    "self_text": "My son (not on Reddit) applied EA to a healthy range of schools for CS.  He was accepted into UD only a couple of days after their deadline and into SUNY Buffalo (honors) a few days ago.  I thought EA notifications were similar to ED in that each school has a specific date in which they send out all their decisions.  My son was also accepted to Pitt, but that makes sense to me given that it is rolling admissions.  I just didn't realize EA notifications might work that way as well.  Is this the norm?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-06T23:24:50.295182Z"
  },
  {
    "source": "posts",
    "id": 421470,
    "title": "Is it okay to accept a verbal offer and then ask for a deadline extension?",
    "self_text": "I accepted a verbal offer from a company last Thursday, and then they sent me an offer letter with a deadline of 3 days. But I have changed my idea and want to wait for the result of other bigger companies in about 2 weeks. Is it okay if I ask for an extension of the offer deadline?  I am an international student and applied for this company through Handshake. I am worried that the company may tell the school if I reneged.",
    "subreddit": "csMajors",
    "selected_at": "2025-09-06T23:24:58.087109Z"
  },
  {
    "source": "posts",
    "id": 668643,
    "title": "College is great",
    "self_text": "I've developed 10 new insecurities and discovered a new lack of self worth.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-06T23:27:47.893675Z"
  },
  {
    "source": "posts",
    "id": 303175,
    "title": "Thoughts on 700 S Gregory Apartments (JSM Gregory Place)",
    "self_text": "Does anyone have any thoughts/experiences to share about these apartments? Wanted to move somewhere quieter and better for studying. When I went on the tour a saw a lot of people with instruments living here. Has instrument practicing been a problem for anyone living here? The layout is pretty small, but I think I could live with that since it has pretty much everything I need. Does JSM bother residents with a lot of tours? Is there any way around that?",
    "subreddit": "UIUC",
    "selected_at": "2025-09-06T23:28:30.354429Z"
  },
  {
    "source": "posts",
    "id": 765542,
    "title": "IT/Cloud certification pathway advice",
    "self_text": "Just looking for some advice on where I should go/ what I should do next. I currently work in administration and am looking to transition into IT. To be more specific, into the cloud and cloud security. Currently I hold Google It Support, AZ-900(Azure Fundamentals), SC-900(Security Fundamentals), AZ-140(Azure Virtual Desktop Specialist). I am at a bit of an impasse as to what certification I should get next. Looking to grow my knowledge, as well as work toward a position working in the cloud. Although I don't have any work experience in IT. I have a domain where I post documentation and tutorials of projects that I do. Mainly as a way to show I have experience and showcase some of my skills. I know I'll probably need Security+, but besides that I'm not sure where to go next. Any advice would be appreciated.",
    "subreddit": "ITCareerQuestions",
    "selected_at": "2025-09-06T23:33:04.871130Z"
  },
  {
    "source": "posts",
    "id": 721802,
    "title": "Is it ok to walk into random classes and attend lectures?",
    "self_text": "I just took my O's and I'm looking to pass my time. Attending these sorts of lectures kind of help me feel more productive in a way. The obvious answer for the question \"Is it ok to walk into random classes and attend lectures?\" seems like a no, but I've had some of my older friends and some seniors say its perfectly fine. Even upon searching for clarification through visiting sites, there were different answers. So for Singaporean UNIs, is it ok to attend lectures without enrolling in?  P.S: I cant exactly disguise myself as someone who actually enrolled in a class when I'm really attending a lecture I didn't pay for, as I'm 16 and they'll definitely know that I didn't enroll in the class lmao.  Edit : For those of you saying I can't learn UNI stuff, I'm solely looking for computing-related courses. I actually learnt computing through the UNI syllabus and I've been to UNI lectures, so I'll be able to understand it.",
    "subreddit": "SGExams",
    "selected_at": "2025-09-06T23:34:53.138853Z"
  },
  {
    "source": "posts",
    "id": 957146,
    "title": "Internationals who apply ED, how do you check what amount of financial aid you'd get?",
    "self_text": "I'm mainly talking about need blind schools who do give financial aid to internationals. Their NPCs are often for US citizens only. So how do you check as to what amount you'd have to pay?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-06T23:37:30.610164Z"
  },
  {
    "source": "posts",
    "id": 330598,
    "title": "How do i know my ACT STEM score?",
    "self_text": "I'm able to self report my score, but the ACT website doesn't directly tell me what my stem score is.   The University's admin office said it's the average of my math and science score. So i averaged them and it came out to a 28.5  Now it has to be a whole number, so do i round it up or down? I'm afraid that if i round up or down it'll be the opposite of what the official score would indicate.",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-06T23:38:43.240277Z"
  },
  {
    "source": "posts",
    "id": 881633,
    "title": "Career opportunities as an accountant in an Investment bank",
    "self_text": "Graduated recently and first job I got is to work as a junior accountant in an investment bank. Any ideas what opportunities would be open for me? I've always been interested in works related to financial analysis but I'm not sure if staying here would help me gain the skills required for that. But any idea what can other expectations i can have from my current kind of job?",
    "subreddit": "Accounting",
    "selected_at": "2025-09-06T23:40:23.534731Z"
  },
  {
    "source": "posts",
    "id": 751208,
    "title": "I spent 3 days trying to solve this problem. Can anyone help me?",
    "self_text": "\"All students of a class are of the same age, except for seven who are 1 year yonger, and two who are 2 years older. The age of all students added together equals 330. How many students are there in this class?\"  It seems to me like there is not enough data to solve this. I only managed to build one equation, which I verified to be true. But I need a second one to do that x&y-system thing. Any help is appreciated.",
    "subreddit": "learnmath",
    "selected_at": "2025-09-06T23:42:41.487409Z"
  },
  {
    "source": "posts",
    "id": 601668,
    "title": "Hey anyone know anything about Bryn Mawr’s environmental studies program?",
    "self_text": "Need help with Bryn Mawr “why this school” essay. Their website doesn’t tell you crap about their envsci program.",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-06T23:50:26.171115Z"
  },
  {
    "source": "posts",
    "id": 691368,
    "title": "Winter Stats 10 Lecture 4",
    "self_text": "Does anyone want to drop stats 10 (lecture 4) for this winter? Please let me know.",
    "subreddit": "ucla",
    "selected_at": "2025-09-06T23:51:14.643386Z"
  },
  {
    "source": "posts",
    "id": 883492,
    "title": "question about logs of negative values",
    "self_text": "help with log of negative numbers  Was just curious and surfing math stuff and I stumbled across deriving ln(-1) = ipi with e^(i pi) +1 = 0  I understand how this makes sense, but I have an inconsistency I came across I need an explaination for.   ln(-1) = i pi 2ln(-1) = ln[(-1)^2] = ln 1 = 0 != 2i pi This doesnt make much sense to me, there must be an error in reasoning. Any help? Also are there some real life applications of logs of negative values, or is it just pure theory?",
    "subreddit": "learnmath",
    "selected_at": "2025-09-06T23:53:20.411609Z"
  },
  {
    "source": "posts",
    "id": 347422,
    "title": "Day 2 of learning Python, question about something fundamental about arrays",
    "self_text": "I literally only yesterday decided to start learning Python, following the free course over on Datacamp, which has been excellent so far. It starts of slowly of course, arrays (and Numpy arrays) were quickly introduced. However I have a fundamental question about arrays.  This was one of the tasks (working with fictitious height & weight data)  # Print mean height (first column) avg = np.mean(np_baseball[:,0]) print(\"Average: \" + str(avg))   The coding itself is easy to understand, but I keep struggling with internalising the \"[:,0]\" bit. It is used to take out the first column of data, and do some analysis on that. But in my mind, \"[:,0]\" means to take the first row instead.  I see them as coordinates, which always follow the [x,y] formula. For me, the colon means to take everything from the first x value (so the data from the horizontal/row), with the 0 limiting it to the first row.  I hope that all made sense, because it is a fundamental problem for me right now. How am I wrong in my interpretation that arrays use the coordinate system the wrong way around? [0,:] for me means to stop on the first x value, and take everything from the y axis.",
    "subreddit": "learnpython",
    "selected_at": "2025-09-06T23:54:33.334472Z"
  },
  {
    "source": "posts",
    "id": 383589,
    "title": "Aspiring LA Teacher: Transness and Safety",
    "self_text": "Hi,  I really want to be a high school teacher. I love my subject area, I love teaching and working with kids, and a huge amount of my self-esteem comes from experiences where I served as a role model to younger people.  However, I'm scared that being transgender (especially as I'm almost certainly not going to pass as cisgender, at least not when I would begin student teaching) will put me in danger. I currently live in a blue state in an urban area, but I've also experienced flak for being trans from complete strangers here. I'm not too worried about being insulted, but I'm worried about being safe.  So, yeah. Is being a teacher a sane profession for me to pursue?",
    "subreddit": "Teachers",
    "selected_at": "2025-09-06T23:54:42.641670Z"
  },
  {
    "source": "posts",
    "id": 686301,
    "title": "Flix Bus",
    "self_text": "Anyone knows how to get to UCSD Health La Jolla Station?",
    "subreddit": "UCSD",
    "selected_at": "2025-09-06T23:57:07.007215Z"
  },
  {
    "source": "posts",
    "id": 823813,
    "title": "Boot camps on Cloud and Coding?",
    "self_text": "Hello , I am a Sales Engineer who got laid off last week . Before Sales Engineering I worked as a Senior Systems Engineer and did some minimal coding . But for the last 4 years being a SaaS Sales Engineer I totally lost touch of any of the programming languages and coding. Now after lay off,  when I am applying for Sales Engineering jobs there are technical evaluations done by few companies where I am failing miserably. So I am planning to register in a coding boot camp and increase my confidence in coding and also learn concepts around CLOUD, migrations, SQL. It would be of great help if someone can suggest a relevant boot camp course.",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T00:07:23.246229Z"
  },
  {
    "source": "posts",
    "id": 525998,
    "title": "Optional video submission",
    "self_text": "What are we supposed to talk about in these? The guidelines for one school just said “tell us more about you” but idk how to best do that. Is it better to flesh out stuff mentioned in our submitted application, or say something completely new?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T00:07:32.186344Z"
  },
  {
    "source": "posts",
    "id": 737755,
    "title": "Teachers can really suck man",
    "self_text": "I had the worst teacher ever in 6th grade. I'm in high school now but I just remembered this.  Let's call her Ms. Davis. (Ms. Because who would marry this monster)  She had a walker, not important but whatever. There were these two boys in my class who thought they were the funniest people alive. Constantly making inappropriate and verbally assaulting remarks about me/to me. (I'm a female, so there was more of this to come.) One day, they made a joke about my chest. Obviously I was getting sick of this, so I raised my hand and told the teacher. And you know what she did? She yelled at ME because I had not only interrupted class, I was tattle telling and being ridiculous. She did nothing, and I got detention. The harassment went on. Another day, the most annoying one (We'll call him J) Is making inappropriate jokes again. So you know what fed up with all this me does? I slap him, hard. They stopped after that. Thanks a lot Ms. Davis.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T00:07:41.251447Z"
  },
  {
    "source": "posts",
    "id": 587828,
    "title": "Should I write an LSAT addendum?",
    "self_text": "Hey all,  I would appreciate some insights into my situation. This might sound a bit crazy, but I've taken the LSAT seven times over a four-year period (2 takes before testing limits were placed). I was a reckless college kid and was really just taking the test for the heck of it for the first few times. As a result, I got three cancels on my record and improved by almost 30 pts from the first take. But my performance was stable in the last three takes (within 10 pts). So should I write an addendum to provide a narrative? I'm an ESL student, and it has been a struggle and I might be a bit obsessive. But I really don't want AOs to think I'm pathological with this test.",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-07T00:10:02.681455Z"
  },
  {
    "source": "posts",
    "id": 947489,
    "title": "Personally, what's your favorite Ivy League school and why?",
    "self_text": "I think all the national rankings and associated prestige with some of the ivies compared to others are skewing our perception of which school would actually be a good fit for YOU. So I'm curious, prestige aside, what's your favorite ivy league school?   I'll start off... I absolutely love Brown. The open curriculum, the cross-registration with RISD, the pass/fail option for classes, the collaborative environment, the happy and vibrant student population, the openness to trying new things, the intimacy of Providence, etc. This list can go on forever. Some people think Brown has a bad rep because it's not as \"rigorous\" or \"cut-throat\" as the other ivies (as if that were a measure of intellect and success). Still, I personally think that Brown is one of the best schools to go to if you want to grow and experiment with all that's out there.",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T00:10:06.652084Z"
  },
  {
    "source": "posts",
    "id": 534960,
    "title": "MBA from India or from Europe?",
    "self_text": "I scored 98 percentile in CAT last year. Got calls from baby IIM's, messed up the interview as I wasn't prepared. This year I'm going to score similar too.   The thing I'm confused about is if it's worth it. Or should I explore my options from European countries?   Only reason is because the fees in India and Europe are similar. For e.g. if I don't get admitted into an IIM, the next best option consists of a college like MDI Gurgaon. It has a fees of 27 lacs. I can do an MBA from Europe for this amount of money.  My end goal is to work in Europe maybe even settling down there (no matter if I do an MBA from India or Europe).  Anyone experienced in this, please do help. Thank you!",
    "subreddit": "india",
    "selected_at": "2025-09-07T00:10:55.937397Z"
  },
  {
    "source": "posts",
    "id": 346987,
    "title": "Desperate for promotion?",
    "self_text": "I'm currently working as a remote employee and I have ambitious goals. At this point, I'd like to move from an individual contributor to a managerial role. I talked to my manager about it and they said \"just be good at your current role\", and \"we will check\" to see how we can move you up a couple of months ago. Not sure how many times I've heard this in the past, only to be ultimately left hanging. Not saying that I will have the same outcomes as my previous managers who told me the exact same thing, but probably I have a tough time trusting these lines anymore without any immediate action/progress to my goals.  Now I'm thinking to message one of the company's exec who appears to be approachable (I've exchanged some emails with them when I was completing a project), to see their perspective as they have more influence. For context, the exec is 2-3 lines higher than my manager. Maybe somewhere along the lines of - to ask if they offer a \"leadership rotational program\" or plan to offer one in the future, or an internship to an open role where I can move up to a role with more influence. Will it do bad more than good for me in this scenario? Any peeps who had done the same and had quite some success rate?",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T00:13:47.361373Z"
  },
  {
    "source": "posts",
    "id": 336791,
    "title": "New TA: How to respond to inappropriate questions?",
    "self_text": "I am new to education. I work as a TA at a special ed middle school. For context, I am young and female. My lead teacher (middle aged female) had the class working on a journaling assignment about pajamas. I walked up to a random male student and asked what they were planning to write about as helping students develop and write their ideas is part of my job.   Here’s how the conversation went:   (Also, the whole conversation was in sign language- it’s a deaf classroom- so while my teacher was in the room, her back was turned- she was busy talking to another staff person so she didn’t see the exchange).   Me: “What are you planning to write about?”   Him: “Ummm…you! (My name)”   Me: “That’s not appropriate. Find something else to write about.”   Him: …comments about me and pajamas…   Me: interrupting “No. Something else…for example,…”   Him: Interrupts and starts rapid firing questions about whether I have a girlfriend or boyfriend or am I married…   Me: “I won’t answer that.” (Glances around for my teacher and feeling unsure of what’s to do…first time dealing with this- she’s still busy and I can’t easily get her attention)…I then walk away signing “Absolutely not- find another topic” and focused on other students. Students who witnessed this joked that the male student should be spanked.   Should report this to the lead teacher and possibly administration? This student’s Dad works at our school too so I have the option of talking to him directly if needed. I know that I am naive but I don’t know what to do.   Have any advice on how to handle this?",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T00:14:16.365487Z"
  },
  {
    "source": "posts",
    "id": 676104,
    "title": "css",
    "self_text": "How many colleges did you submit your CSS profile to?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T00:16:05.396077Z"
  },
  {
    "source": "posts",
    "id": 820797,
    "title": "Medical Withdrawal - Am I F***ed?",
    "self_text": "Hello, everyone! I hope you are having a great day. I have not posted to this subreddit before, but I have a problem for which I need some advice.  I am a second-year computer engineering major at UVA with a current LSAC GPA of 3.95 who hopes to practice patent law. The dream is to get accepted to UVA law or get a significant scholarship at GW. This semester I took a medical withdrawal, adding six additional withdrawals to my transcript. I already had two, giving me eight total withdrawals. I am wondering how to address this on my law school applications, or if I should even bother applying. All of the withdrawals were received due to the same mental health issue, which has been (and to a degree continues to be) addressed. I also plan on participating in an extracurricular activity at UVA that would enable me to help other students deal with similar issues. Should I just tell my story on my apps, or is discussing mental health a bad idea?  I would greatly appreciate any advice. Thanks for reading!",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-07T00:18:44.145668Z"
  },
  {
    "source": "posts",
    "id": 709470,
    "title": "Any advice?",
    "self_text": "What kind of professor (adjunct, tenured, etc.) did you ask for a LOR when applying to a Master's program that accepted you?",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-07T00:18:47.383132Z"
  },
  {
    "source": "posts",
    "id": 424177,
    "title": "I don't feel like I'm growing. What's average growth in first couple years?",
    "self_text": "I have 1.5 years at a small company. I don't feel like I've grown much since joining. The first few months I picked up all the industry jargon and essential code/tech knowledge. I'd call that the onboarding phase. Since then I don't feel like I've gotten a deeper understanding of anything or come up with any innovative ideas. I feel like I plateaud very quickly. It could be my ability, my motivation, the management & start-up culture, or me having unrealistic expectations.  I haven't learned to build bigger things, just build the things I was building but at a slightly quicker pace. Basically, I feel like my growth & impact is linear/sublinear whereas I had expectations that it should be exponential (building bigger things rather than building quicker). My manager assures I'm doing good work, but they never give me concrete goals and I worry: 1) being disposable in the current economy 2) failing to improve myself for future jobs.  Are my expectations realistic? What is typical growth for 0-2 years?",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-07T00:23:17.956067Z"
  },
  {
    "source": "posts",
    "id": 964714,
    "title": "What stim/fidget toys do you reccomend for learning (college)",
    "self_text": "I want to know generally what youd recommend for a learning environment and then generally what you think i would like (more so for home/breaks lol)   I like things that twist or spin a lot but i also like squishy things and things that make noise.",
    "subreddit": "autism",
    "selected_at": "2025-09-07T00:24:33.810769Z"
  },
  {
    "source": "posts",
    "id": 520057,
    "title": "I Keep Making Mistakes",
    "self_text": "I’m a new grad in an ICU working what I thought was my dream job. Our orientation lasts a couple months and I’m toward the end of it. Even this far into orientation, I’m making the dumbest mistakes. Mainly forgetting little things like taking temps, scanning things, checking for medication compatibility, etc. I’m extremely hard on myself because I want to do everything I can to be the best nurse for my patients. But I’m starting to feel like maybe I’m not meant to be a nurse… how can I be a good nurse if I’m making stupid mistakes. At this point, it’s very easy to sense that my preceptor and the other experienced nurses on the floor are frustrated with me and disappointed in me. I feel like no one wants me there. And I don’t even know if I want to be there anymore because I feel so stupid and embarrassed. I know in the back of my mind how to do all these things and yet I’m still forgetful and still making mistakes. I’m really disappointed in myself and I don’t know if I should be a nurse.",
    "subreddit": "nursing",
    "selected_at": "2025-09-07T00:25:53.600886Z"
  },
  {
    "source": "posts",
    "id": 815154,
    "title": "I haven't even tried studying in my life.",
    "self_text": "I did all the shools up until graduating high school without opening my books home or doing any homework. Now I study to be a marine engineer and not studying earlier in life has made it super hard for me. I don't understand shit about maths or physics or I can't speak any swedish (I study in Finland and in here swedish is mandatory because it is for some fucked up reason the second official language of Finland.) I try to open my books at home and do homework, but everytime I just quit after like 5 minutes. Basically I don't know how to study. To this point I would say that I haven't studied ever in my life. For 12 years, I have just went to school, listen for 6-8 hours, go home and then do that again tomorrow. I have done quite poorly in school but graduated nevertheless. I can't for real think a time I studied at home for more than 15 minutes, I didn't do that even for my finals in high school. So how the fuck am I supposed to study? Like what do I even do? I just might drop out for real to be a mailman or work in fucking KFC for 50 years till retirement.  fuk this!",
    "subreddit": "Vent",
    "selected_at": "2025-09-07T00:27:01.282181Z"
  },
  {
    "source": "posts",
    "id": 795077,
    "title": "Learn C++ in one day",
    "self_text": "hello, I'm a first semester student of computer science. My programming language is C++ in college, but I'm 100% new to this world of programming. and we have a team project regarding c++, my team makes games. but, from the beginning of the semester until now, I don't understand anything about c++...(i know its my fault). I understand just barely. In this team, I only work on reports. and tomorrow I have a presentation about this project. I'm afraid to let my team down. because, the assessment is that all team members must understand. please, does anyone here know how to learn c++ in just one day? I don't expect to be an expert in C++, but just understand the language, so that when my lecturer asks at least I understand.",
    "subreddit": "learnprogramming",
    "selected_at": "2025-09-07T00:27:30.735114Z"
  },
  {
    "source": "posts",
    "id": 756778,
    "title": "IB and Medicine",
    "self_text": "Does IB prepare you well enough for medicine and med school?  Do you have to take private lessons ? In bulgaria normal non-IB schools are way harder and still do not prepare you well for the medical academy as they do not cover all of the needed material .",
    "subreddit": "IBO",
    "selected_at": "2025-09-07T00:27:50.628202Z"
  },
  {
    "source": "posts",
    "id": 342237,
    "title": "Academic Accommodations for mental health",
    "self_text": "TW: self harm   I am a 5th year in college who is non-traditional student aged. I was previously academically dismissed and worked so hard to get back into my college and I did! The community college classes I took in the time between was so easy and I didn’t really learn to cultivate better habits as I was able to quickly do work and still get As, which felt good, but not the same at a 4 year college. I have been diagnosed with ADHD/ anxiety/ depression since the 5th grade and didn’t start utilizing accommodations until high school. Used them and did great. College is another story as I started to having to advocate for myself and thought all of my negative symptoms were how everyone felt and who I was. I never saw those things as barriers, but as I have gotten older, the dots have started clicking. I have been embarrassed to use my accommodations until this year because past friends made comments that it’s unfair and I took those to heart. The academic resource center purged my files upon my dismissal so it’s been a mess trying to get the correct documentation and my doctor only sent in the documentation last week even though I was asking for months. I am very frustrated as I’ve been falling behind due to my mental health rapidly declining this semester upon starting a new medication that made everything worse: insomnia, more anxiety, not taking care of myself, thoughts of unaliving myself, and started c*tting myself for a few weeks. I started to make the connection that it was my new med I started and then cut it cold Turkey and have felt better, but I’m still in a disassociative state making functioning hard. I am scared to disclose all of this as I can’t afford to medically withdraw and am supposed to graduate in the spring. I would appreciate any advice for how to handle this",
    "subreddit": "college",
    "selected_at": "2025-09-07T00:28:46.352791Z"
  },
  {
    "source": "posts",
    "id": 487757,
    "title": "Can my company use the results of a personality test against me?",
    "self_text": "My boss just had all of the office workers take the 16 personalities test and email him the results privately for \"team building\". I have severe generalized anxiety that I am currently taking medication for but it has dramatically impacted my test answers. A coworker has made a bet that they will be using this to fire people, if they do I know my scores wont look good. What could they be using this info for? Can they really fire someone over a personality test? If I something were to happen, what are my rights?",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T00:31:08.794737Z"
  },
  {
    "source": "posts",
    "id": 721713,
    "title": "Italian Clitics hell - a tip",
    "self_text": "I’d heard the Clitics section in Italian was notorious enough. But that combined with the new layout meant when I did get there it was almost unfathomable to me. I’ll be honest it stopped my learning in its tracks and I was really disappointed but this section of this website (below) was marvellous and helped me immeasurably. I’d highly recommend it if you want to continue your duo Italian journey beyond this difficult and annoying stage:  https://www.fluentu.com/blog/italian/direct-object-pronouns-italian/",
    "subreddit": "duolingo",
    "selected_at": "2025-09-07T00:33:58.932725Z"
  },
  {
    "source": "posts",
    "id": 575542,
    "title": "Did everyone have 2 RC today??",
    "self_text": "I feel like everyone got hit with an easy RC to start, a hard LG, a hard RC, and a meh LR",
    "subreddit": "LSAT",
    "selected_at": "2025-09-07T00:35:17.868923Z"
  },
  {
    "source": "posts",
    "id": 276793,
    "title": "Being on grade level is not the same as getting straight As.",
    "self_text": "Your child is not a straight A student. They are on grade level, but they are not masters of the content and that is okay.  Over pushing your child is going to make them hate education and make them afraid to be wrong. Asking me to send homework home will not fix this.  I also am not sending homework home. I will send what we are studying and they can make their own work.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T00:36:00.304643Z"
  },
  {
    "source": "posts",
    "id": 840704,
    "title": "Anybody else feel oddly zen?",
    "self_text": "Like, I really hope I got my target score. God I don’t like this test. But also, I feel at peace. No amount of calculating and nail-biting will change my score now, so what’s the point? I can’t do anything about it now, that possibility stopped the second my test stopped. I felt super nervous and anxious when I started The Wait™️ , but now I’m just sick of worrying about it. It took enough of my time already; and it might take even more in the future. This test will not take another unnecessary ounce of my sanity.",
    "subreddit": "LSAT",
    "selected_at": "2025-09-07T00:41:34.088530Z"
  },
  {
    "source": "posts",
    "id": 710071,
    "title": "Google STEP application timeline",
    "self_text": "Hello!  Can you please share your application timeline  If you got rejected:   When you applied   Where are you from  Where you applied  If you received questionnaire or was on interview with timeline  When you got rejected   If you got accepted:    When you applied   Where are you from  Where you applied  When you received questionnaire/OA  When was the first interview and when they reached you after questionnaire  When was the second interview and when they reached you after first one  If there was a third interview when they reached you after second interview   When you got accepted   The information you provide could help other candidates to a great extent, please if you can help us, don’t ignore this post.   Thanks in advance!",
    "subreddit": "csMajors",
    "selected_at": "2025-09-07T15:33:57.959697Z"
  },
  {
    "source": "posts",
    "id": 460648,
    "title": "CMU SAT Score Send \"Score Choice\"",
    "self_text": "I have only taken the SAT once so I only have one score to report. However, when sending my official scores to CMU, I selected \"Score Choice\" instead of \"All Scores\" and recently discovered that CMU requires all scores. Is this fine as I have only done one sitting (how would the Admissions office even know?) or should I re-send it with the All Scores option?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T15:40:14.612905Z"
  },
  {
    "source": "posts",
    "id": 821247,
    "title": "An error in my LOR",
    "self_text": "Hey guys. I'm applying for spring 2023 and am going to submit on Monday, but my boss put in her letter \"she will be a great asset to the dietetic internship!\" at the end 😭   Yes I did tell her I was applying to my MPH I'm person. She is used to writing letters for students since so many nutrition students do the internship first.  Is there a way she can resubmit her letter? And if it comes down to it will this hurt my chances? I'd really hate getting rejected over this. It's just the deadline is 12/1.",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-07T15:51:52.566666Z"
  },
  {
    "source": "posts",
    "id": 861121,
    "title": "Am I crazy for considering going back to teaching?",
    "self_text": "I left teaching a year ago and have stayed a part of this Reddit community to ensure that I don’t romanticize teaching while away.  Not sure if returning to teaching would be like starting a new relationship or going back to a toxic ex…",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T15:53:14.885200Z"
  },
  {
    "source": "posts",
    "id": 363117,
    "title": "Waitlisted 🥲",
    "self_text": "I know I should be happy to even receive an II but I really thought this was the school for me. Anyone have some positive waitlist stories?",
    "subreddit": "premed",
    "selected_at": "2025-09-07T15:58:25.457164Z"
  },
  {
    "source": "posts",
    "id": 890642,
    "title": "Is working for a government agency considered \"industry\" experience?",
    "self_text": "I'm writing in my personal statement about a job I did with the FDA and I want to call it \"industry\" experience. Would that be an incorrect term? I don't know the difference between governmental jobs, public research, private sector, industry, etc.: all these terms for non-academic work. The only thing I can define in my head is what academia is. Is \"industry\" a broad term, that I can use here, or is it specific to something?",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-07T16:46:43.599929Z"
  },
  {
    "source": "posts",
    "id": 945627,
    "title": "Taking Bloomberg over more well-known companies?",
    "self_text": "To preface, I recognize that this is a first-world problem. I went into this recruiting cycle thinking that as long as I got an offer, I'd be very happy. I already feel very grateful to have gotten the opportunity to interview and be thinking about this in the first place.  I had a Bloomberg offer deadline that was set pretty early. Was also in late stage for SWE intern at a trading firm. Three days before my deadline, another recruiter reached out to me for Citadel Launch, an internship program for sophomores.  Both recruiters knew of my deadline and asked me to get an extension since they couldn't expedite the process any further. The time I asked for an extension happened to be the time my Bloomberg recruiter was transitioning to another role. She said that she would put me in touch with my new recruiter, that she couldn't promise an extension but would forward the message along, and in the meantime, treat the deadline as the original.  I accepted the Bloomberg offer as the deadline approached, as I wanted to have a guarantee and hadn't heard much follow-up about the extension. Clearly, accepting offer = no extension  The recruiters asked me for news on the Bloomberg extension request. I didn't want to lie about my extension, also felt icky about reneging. Given the job market situation for CS internships, I'd rather not burn any bridges, especially since I'll be interviewing again next year and the year after. After learning more about the nature of the work, I've also become less certain that I'd enjoy HFT as a long-term career. I'm interested in trying, but not enough to outweigh the cost of reneging.  Among the offers I had, I narrowed it down to Bloomberg and two Big-Ns. My reason for leaning towards Bloomberg was that it would be a very different experience. I want to see more of the East Coast, as I grew up on the West Coast, previously interned at a Big-N, and think that the other two Big-Ns wouldn't be too different (both are either based in my hometown or near the place I was at last summer). I'm also curious to explore outside of pure tech companies and learn more about finance as a domain, including finance outside of trading.  Am I sacrificing career opportunities by making this decision? I'm fairly confident in my reasons, but a few people whose opinions I trust have asked me why not renege, or take the more well-known options. I'm willing to reconsider if it's worth it. Thank you!",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-07T16:51:05.837741Z"
  },
  {
    "source": "posts",
    "id": 536227,
    "title": "Help any good colleges that are open/inclusive to underrepresented minorities?",
    "self_text": "Demographics   Living in Mississippi, immigrant from St Kitts Public school Male, ethnically mixed African, native American   Other special factors  (first generation to college, legacy, athlete, etc.) : URM  Income: Not sure, I think around ~350k or something but not sure  Intended Major(s) : CS   (Gpa 3.5, Took several aps, etc)  Hey guys, any good colleges that are NA/black friendly? I'm looking to apply to colleges like Stanford, Berkeley, CMU for cs. Or should I look elsewhere? Thanks!!",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T16:51:32.046998Z"
  },
  {
    "source": "posts",
    "id": 629420,
    "title": "$170k+ Technical Sales Salary",
    "self_text": "Hello everyone,  I have a friend who went to a non-prestigious school for undergrad and MBA. He works at a tech company now making $170k+ doing technical sales (plus commission?). He's only been working a few months and is already making this much. I was looking at his account on LinkedIn and many of his coworkers have similar educational paths. He's also working remotely in a low cost of living area while the position is stationed in a high COL city in California.  I'd personally much prefer to do technical sales since there is a higher degree of personal interaction, and I am extroverted/competitive. The main reason I'm grinding leetcode and working in SWE is due to the salary. I would gladly take a minor dip in salary to be doing something like technical sales. I mean $170k is more than a many SWE's make. I did a bit of research on this subreddit but most of the posts are dated.  TLDR: Friend making $170k+ in technical sales after a few months of work.  Is it viable to transition to technical sales and get an MBA? Does anybody know how competitive this field is in terms of salary/positions compared to SWE?  Thanks for reading.  EDIT: for clarification, I have a new grad SWE job lined up in the summer. Pays decently. I'm just trying to see if there's something I could be more happy doing while also making more money.",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-07T18:23:34.247769Z"
  },
  {
    "source": "posts",
    "id": 283956,
    "title": "published research?",
    "self_text": "I hope I am not offending anyone w this question but I am still learning. I am interested in pursuing an MD/PHD and would like to start research and get published but don't know where to begin. My advisors tell me that I should just focus on my GPA this semester but I know it takes time awhile to get published. Any tips you guys can offer on how to find research and get published and also what MD/PHD programs really like to see on applications?",
    "subreddit": "premed",
    "selected_at": "2025-09-07T18:27:34.053816Z"
  },
  {
    "source": "posts",
    "id": 515872,
    "title": "Unlucky",
    "self_text": "How do I increase luck",
    "subreddit": "csMajors",
    "selected_at": "2025-09-07T18:29:40.211190Z"
  },
  {
    "source": "posts",
    "id": 447422,
    "title": "Thinking about going into teaching--- but scared. Is there anything good about it?",
    "self_text": "I've been thinking about going back to school to finish an English BA and then a master's in education. But honestly, I hear so many bad things about teaching. I'd want to teach high school English. Seasoned teachers, is it even worthwhile?  FWIW, I'm not yet a new teacher, just considering teaching. There wasn't really a flair that fit. :)",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T18:30:01.168994Z"
  },
  {
    "source": "posts",
    "id": 267377,
    "title": "Can I use my child education bachelors degree for high schoolers later on in life? CA",
    "self_text": "From California working on my bachelors degree on child development/education. Could I use this degree to teach high school students? Of course with an teachers credential. Wouldn’t I have to switch from multiple subject to single subject? Let me know if I’m correct.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T18:45:57.760698Z"
  },
  {
    "source": "posts",
    "id": 301714,
    "title": "common app?",
    "self_text": "I literally had no idea what the common app was a few days ago (HS Junior, so don't judge), so I created an account and tried to understand. I got the basic idea of it; all (most) college's applications, all in one place.   I need some help understanding the rest.   1: Do I still need to create an account on that college's app portal?  2: Do I pay the fees directly to common app? If not, how?  3: other than efficiency, is there any benefit to using common app? Is there any benefit to not using it?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T18:46:14.729746Z"
  },
  {
    "source": "posts",
    "id": 902050,
    "title": "Parent Communication",
    "self_text": "I need help because I’m pretty sure this is going to be the end of me.   I’m a first year teacher and I teach 9th grade world geography in a district that has about 80% of kids on free or reduced lunch. I understand that some parents are genuinely trying their best and can’t be as involved as they want, but this isn’t about them.   My admin has me contact parents of every student who is failing individually at the progress report and again at the marking period. However, emailing, texting, calling, pigeon, it doesn’t matter. If I don’t get a response, it doesn’t count.   We use Skyward and Google Classroom, and I personally use Remind and Google Voice. I have sent out huge detailed emails explaining each assignment and what it entailed but in an approachable way that has our Google Classroom codes included and my Remind code multiple times.  I text and explain exactly why their kid is failing and when the marking period deadline is. I have called.   But if I don’t get a response, it doesn’t count.   I’m told that the parent can/will say they didn’t see the text or email or call or whatever, so they can say they weren’t informed about their kid’s failing.   The parents have 24/7 access to Skyward and they can join our Google Classroom. But if they didn’t respond or answer or whatever then it doesn’t count. I’m beyond frustrated and feel like it’s not my job to care about their kid’s grade more than they do.   Please let me know if you have ANY tips for this. This is mostly a rant because I’m so exhausted by this, but I refuse to pass another kid who had a 24 because their parent claims to have not seen my communication.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T19:10:29.279754Z"
  },
  {
    "source": "posts",
    "id": 423594,
    "title": "Procrastination Help!!!",
    "self_text": "I am a serial procrastinator. If I ever complete work, it's the adrenaline/pressure that I have to submit my assignment or else I'll fail my course/module.  Every time I find that I am stuck/unsure how to continue with my essay or assignment, I procrastinate. If I don't pick up my phone, I may fall asleep. Anywhere. Any time.  I really want to change and I've been trying many different ways to (especially with regards to my phone).  I'm running out of ideas. Hope to receive some advice",
    "subreddit": "college",
    "selected_at": "2025-09-07T19:12:30.122355Z"
  },
  {
    "source": "posts",
    "id": 990382,
    "title": "Do you become a computer and information systems manager by getting a computer science degree?",
    "self_text": "Or do you have to have more IT background rather than programming background? What does this type of job entail, and if you have this job, how do you like it? I want to change my major to computer science when I transfer out of cc next fall. I saw this job as a career pathway on my cc’s cs degree description page and was interested in learning more about it. Thanks for any info and answers!",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-07T19:12:44.495751Z"
  },
  {
    "source": "posts",
    "id": 698624,
    "title": "how do you earn hearts on new path?",
    "self_text": "I don't mind the new path so far but I lost a heart doing the most current lesson so went back to an old one to try and get the heart back and made another mistake. When I finished the lesson I was now down to 3 hearts.   Do I just have to wait for them to refill or is there a way to earn them?",
    "subreddit": "duolingo",
    "selected_at": "2025-09-07T19:13:00.932819Z"
  },
  {
    "source": "posts",
    "id": 1042037,
    "title": "What is your yearly salary being a teacher?",
    "self_text": "People say teachers don’t make enough. I want to know how much that is. What is your state, and what is your salary for the year, or your hourly wage if you want to put that instead? I’m contemplating if it’s worth it to finish my teacher education.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T19:13:29.615795Z"
  },
  {
    "source": "posts",
    "id": 653843,
    "title": "Upward trend and nontrad",
    "self_text": "So this is going to come across as incredibly anal, but here goes.   I've been chipping away at prerequisites one at a time as a nontrad (graduated about 8 years ago). I had some of them from undergrad before I switched majors and had maybe a ~3.5 SGPA (maybe a little lower). I've slowly pulled that up to a 3.7 taking ochem, physics, and the last two quarters of biology.   I was listening to Ryan Grey's podcast and he basically said that if you do GPA repair/DIY postbacc by taking one class at a time your app is DOA. So this quarter I decided to do biochem and physics, in addition to working my 40-50 hour-per-week job as a software engineer. It would be very hard for me to get anything less than an A in physics at this point. But biochem has a 95% bar for an A and I could easily see myself floating below that for a A-/B+.   So basically I have two questions:    Am I screwing myself by taking these two classes and showing I can't handle the load?     Is this going to look like a downward trend since I had a bunch of 4.0 quarters before this as I was raising my GPA?",
    "subreddit": "premed",
    "selected_at": "2025-09-07T19:17:52.294879Z"
  },
  {
    "source": "posts",
    "id": 920911,
    "title": "Applying to NYU, What's the culture on the optional essays/scholly applications",
    "self_text": "Hey guys. Stats in flair. For Stanford, I know it is very encouraged to do the optional essays. Some other schools use this as a way to navigate YP decisions. Is the general advice for NYU to do this to avoid YP?",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-07T19:17:54.927987Z"
  },
  {
    "source": "posts",
    "id": 741850,
    "title": "Google STEP Interview",
    "self_text": "I'm having an interview with Google STEP in a couple days. Not anything specific but are there any topics I should focus on, and what level of LC do they usually ask candidates? I'm currently a sophomore and have already taken DSA.",
    "subreddit": "csMajors",
    "selected_at": "2025-09-07T19:27:51.628394Z"
  },
  {
    "source": "posts",
    "id": 650731,
    "title": "Thoughts on asking to sit with random people in the dining halls?",
    "self_text": "I’m a 3rd year living on the hill and I still don’t have a solid friend group here. I eat most of my meals alone if my roommate isn’t free. Would asking to sit with people also sitting alone be a good way to meet new people? I feel like people here are very cliquey and it’s hard to maintain a friendship if they are living in apartments.",
    "subreddit": "ucla",
    "selected_at": "2025-09-07T19:40:20.012082Z"
  },
  {
    "source": "posts",
    "id": 795206,
    "title": "How should I explain a shift in fields in SoP?",
    "self_text": "Hey!  How should I explain a change in fields in my SoP? I'm doing my bachelor's in computer science. And I wish to explain my switch from data science to software engineering. ( For masters )  Should I omit the data science part completely? Should I explain but dedicate less space to the data science story? Or how should I do it?",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-07T19:41:02.379487Z"
  },
  {
    "source": "posts",
    "id": 595633,
    "title": "How do you use whiteboard to practice leetcode?",
    "self_text": "I have a whiteboard and I have seen a lot of online articles focusing on the importance of using whiteboard while preparing. Can anyone share their own way of utilizing whiteboard for practice?",
    "subreddit": "csMajors",
    "selected_at": "2025-09-07T19:42:22.849362Z"
  },
  {
    "source": "posts",
    "id": 392313,
    "title": "Is it really worth it ?",
    "self_text": "I would like to ask a question regarding who almost finished Duolingo lessons, did the application help you enough to be able to speak and understand the language, and what level does Duolingo qualifies you for when you finish all the lessons, for example B1, B2? I am learning German, so I want to know your opinion, especially those who learned German too.",
    "subreddit": "duolingo",
    "selected_at": "2025-09-07T19:45:56.909644Z"
  },
  {
    "source": "posts",
    "id": 872606,
    "title": "Help, I FKD up my Yale app",
    "self_text": "My friends dared me to write “shiver my Timbers Harvard” in my Yale essay, and i was like ahaha I ain’t no bich, so I decided to put it and pressed the submit button right in front of them and they were shocked ASF LOL. I thought I could unsubmit it like a week later but it says “downloaded by college” and I cant now I have no fking idea what to do??😰😰",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T19:49:02.906754Z"
  },
  {
    "source": "posts",
    "id": 845625,
    "title": "Okay, so given all the talk about status changes…what do they mean?!!",
    "self_text": "I’ve heard terms like UR,URII, compete , status change,etc.? What’s the difference and do they actually signify anything ? Someone please help me out..",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-07T19:51:57.281812Z"
  },
  {
    "source": "posts",
    "id": 356444,
    "title": "Applying to Alabama Scholars Application",
    "self_text": "It says the requirement is 3.9 for scholars application. My undergrad gpa is 3.9 but LSAC is 3.87. Would y’all recommend still apply to the scholars or just do the regular application?",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-07T19:52:19.574817Z"
  },
  {
    "source": "posts",
    "id": 599176,
    "title": "The UC System screws workers, customers, and management",
    "self_text": "Grad students, post docs, workers: progress disrupted and pay lost  Undergrads: pay tuition and dont get taught  PIs: fight for grants and then lose your researchers  Trying to figure out who the real winners are",
    "subreddit": "berkeley",
    "selected_at": "2025-09-07T19:53:32.803784Z"
  },
  {
    "source": "posts",
    "id": 687222,
    "title": "Embedded Devs",
    "self_text": "I have been looking to do my first Raspberry Pi, Arduino, Teensy builds. Is this a good way to get into embedded software? Any suggestions on first projects (was thinking of doing a retro pi, and Teensy guitar pedal)? Should I use C++ or micro Python. Any tips appreciated!",
    "subreddit": "learnprogramming",
    "selected_at": "2025-09-07T19:55:47.110002Z"
  },
  {
    "source": "posts",
    "id": 969264,
    "title": "How to look for a job thats less than 3-4 hours a day?",
    "self_text": "In my current job we work all day even overtime sometimes. Last project for 2 weeks straight we sat 2-3 hours overtime one day me and a coworker sat to 3 pm. This project is much better the worst overtime is by 1 hour at most and it happens once a week at most.  Honestly my dream job is to maintain some old project work 2-3 hours a day and not have pressure of work. As I was moonlighting for such a company but it was contract so it ended and I could not leave the current job.  It would seem weird to recruiters to ask for such job so how can I look for one full time?",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-07T19:57:32.399347Z"
  },
  {
    "source": "posts",
    "id": 454980,
    "title": "Is this response to a temp agency acceptable?",
    "self_text": "Background : I'm working with a temp agency for the first time, and I have been getting very little communication from my recruiter (e.g., saying she'll call me and doesn't, not responding to emails, etc). I had an interview where I accidentally implied I did not have full-time availability, which is incorrect. Following pressure from my dad, I emailed a Thank You to my interviewers and explained my availability. Obviously, I did email my recruiter first to explain it to HER and also say what I was going to do, and her reply was 1. late at night on a Saturday 2. had multiple typos, and 3. did not address my intentions (only saying there were no opportunities with that company BUT had another opportunity somewhere else and would contact me Oct 24th). So, I sent the email. No response from the company, which I expected as \"thank you for the interview\" messages aren't really a thing now afaik, but a day later I get another email from the recruiter saying the same exact things. Personally, I feel she drunk-emailed me, forgot, and emailed me again. Did not contact me on the 24th, or any day since.  Anyway, I got an email today from a higher-up saying my recruiter is out of the office this week, reiterating there are no opportunities (okay, I know? Mrs. Ma'am sent me 2 emails in a row about it...), not to message a client directly (which is super embarrassing), and that my \"onboarding paperwork\" hasn't been completed. I haven't heard anything about that and genuinely thought everything was done after my initial interview with the recruiter.   My draft response to said higher-up's email is this:   \"Hello ___,  Good to hear from you.  I apologize for contacting [interviewers] directly, my interviewers gave me their cards and I didn't understand it wasn't done. I'm new to temp agencies and have been following my dad's advice. I had emailed [the recruiter] my intentions after a miscommunication on my end regarding my availability and when she didn't address it, I assumed it was alright. My mistake, and it won't happen again. I'm very sorry for the inconvenience.  Regarding the onboarding paperwork, I haven't received any information about it through phone or email. I had thought my initial interview with [the recruiter] had taken care of everything, again my mistake, and I am having trouble finding information on your website. Please let me know what I need to do.  Apologies again and thank you,  _____\"  What do I need to add and remove?  I am extremely stressed and now I'm (yes, unjustifiably) angry. I'm trying my hardest to communicate with this lady but she's giving me nothing back and now seems to have tattled on me to her supervisor. I don't want to burn bridges but I both can't say no to my dad when he wants something or he gets mean and I am clueless about temp agencies.   Thank you for any help, but please be nice about it (I know I'm stupid but I've already cried 3 times and I don't want to get to 4 hahaha).",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T19:59:25.637604Z"
  },
  {
    "source": "posts",
    "id": 921201,
    "title": "French course",
    "self_text": "Anyone who managed to finish the french tree?  What was you real french level after that?  Could you listen,read or write well in french?",
    "subreddit": "duolingo",
    "selected_at": "2025-09-07T20:00:39.701264Z"
  },
  {
    "source": "posts",
    "id": 278348,
    "title": "What do you do after accepting a job offer?",
    "self_text": "Hey guys,  I recently accepted a job offer, about a month and a half ago. And I've been kind of tweedling my thumbs since. I haven't really heard back from them regarding legal next steps. I'm just waiting and doing school. People from the company have reached out via linkedin and sent me books.. and had some emails back and forth, but that's about it.  I was wondering, is there anything else I should be mindful of? Do I just wait until the next word comes? Or should I be taking some active action? It's my first time being in a \"New Grad\" position.  I start in July of next year, for reference.  Thank you guys.",
    "subreddit": "csMajors",
    "selected_at": "2025-09-07T20:01:11.125820Z"
  },
  {
    "source": "posts",
    "id": 1036903,
    "title": "Ruler suggestions",
    "self_text": "I’m a 9th grade math teacher, and my students this year are somehow extra destructive with any objects we have in the classroom (pencils, erasers, calculators)… but especially rulers. I’m really picky with my expectations for written work, and when they’re drawing lines or shapes I always require them to use a ruler so it is precise and neat, but this year I am losing rulers constantly. Almost all of the rulers I bought have been snapped in half or into many pieces. These rulers are kinda bendy and a bunch of my students end up using them as fidgets during class (even though I have actual fidget objects available…) and slap them on the desk, in the air, or of course hit each other with them. And that is how they all have basically broken…  Any suggestions on rulers to get on my next purchase that won’t be a waste of money or give me a headache during class?  Stay tuned for part 2 where I ask what to do about never getting any pencils back that I provide…",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T20:01:19.839980Z"
  },
  {
    "source": "posts",
    "id": 730644,
    "title": "Just was let go after 90 days, should I include that job in my resume?",
    "self_text": "As the title states, I was just let go after my 90 day review with the company I was just working at. This is the first time I am getting fired, so I am unsure if I should put the job in my list of jobs I've had, or since I lost it after 90 days, that would look bad. Should I include this job and position on my resume, or just leave it off?",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T20:02:04.368943Z"
  },
  {
    "source": "posts",
    "id": 383172,
    "title": "Pretty sure I failed the boards",
    "self_text": "Just took the NCLEX and I’m pretty sure I failed. The test cut off at 145 questions and I feel defeated. I didn’t let the test not cutting off at 75 questions scare me. I kept thinking, “ok you have another question to show them you’re ready to be a safe and effective nurse.” I’m not going to lie, I feel awful right now. I tried the trick and the “good pop up “ but none of that matter anything until I get my results. I’m soooo scared",
    "subreddit": "nursing",
    "selected_at": "2025-09-07T20:02:06.295867Z"
  },
  {
    "source": "posts",
    "id": 280660,
    "title": "Did you enjoy going to school for education?",
    "self_text": "I was wondering if this was a common experience among teachers. I thought teaching was for me but now actually being in school for it I'm feeling pretty discouraged. It seems like I'm not learning anything practical, everything's very abstract which I struggle with. Expectations also seem very high and not just for my work but for my being, I feel like I'm constantly on edge trying not to do anything \"unteacherlike\" (anything less than super animated and positive). I've heard it gets better with practicum but I'm struggling to get through the actual classes.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-07T20:03:42.292691Z"
  },
  {
    "source": "posts",
    "id": 1035408,
    "title": "Strike email today",
    "self_text": "Can someone explain what today’s email about the strike was saying? Does tentative agreement mean the strike is over? I’m trying to figure out if I gotta go to discussion tomorrow 💀 appreciate it",
    "subreddit": "UCSD",
    "selected_at": "2025-09-07T20:59:29.437217Z"
  },
  {
    "source": "posts",
    "id": 477112,
    "title": "Need some reassurance...",
    "self_text": "So I took the MCAT twice. I got a 513 the second time I took it, which was just a 1 point improvement from my first score. I am kind of going crazy over my MCAT. Will this MCAT score keep me out of MD schools? I have been going back and forth over retaking or not retaking this exam. I feel like I should just apply with this score and see how it goes. I am also burnt out after continually studying for this exam for multiple years. But other times, I honestly feel like I might not get in, even if I apply to 40 MD schools. I am an ORM for context. Please let me know what you all think. Is my MCAT score the nail in the coffin for going to MD schools? No hate towards DO schools, they produce incredible, phenomenal physicians. Just that I am interested in global health and many countries do not recognize DO degrees as medical degrees.",
    "subreddit": "premed",
    "selected_at": "2025-09-07T20:59:31.339324Z"
  },
  {
    "source": "posts",
    "id": 454376,
    "title": "!!lecture time conflict and exam time conflict for pic10a and math class!!",
    "self_text": "i just enrolled into perlmutter for pic10a but the exam time and lecture time conflicts w another math class i'm in, what should i do!? does anybody know if perlmutter records his lectures or is accommodating for the final exam time? T.T plz lmk ty",
    "subreddit": "ucla",
    "selected_at": "2025-09-07T21:06:48.234785Z"
  },
  {
    "source": "posts",
    "id": 761578,
    "title": "Should I update my application?",
    "self_text": "Hi! I just recently started teaching myself Arabic for fun, and have dedicated significant time to it. On all my EA apps, I don't mention this. Is it worth it to send AOs of those schools an update? Thanks!",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T21:08:58.911461Z"
  },
  {
    "source": "posts",
    "id": 481061,
    "title": "Lit exam tomorrow",
    "self_text": "Feeling good knowing that I won’t have to worry about lit in 24 hours",
    "subreddit": "vce",
    "selected_at": "2025-09-07T21:19:25.070294Z"
  },
  {
    "source": "posts",
    "id": 510949,
    "title": "Should I quit part time for school?",
    "self_text": "I work part time. However, I work in the middle of the week which sucks because I get so drained after work that I don't feel like doing homework. I've been doing school part time to get a day to myself for my mental health.   I wanna go back into full time, but I wanna quit so I can make sure I'm at full focus since I have Adhd and tend to learn slower than others. However, I also need money but maybe I should take a break for a semester? I'm really stuck.",
    "subreddit": "college",
    "selected_at": "2025-09-07T22:11:57.092308Z"
  },
  {
    "source": "posts",
    "id": 910739,
    "title": "College Dorms",
    "self_text": "If you complete your first two years at a community college then transfer to a university where dormitory housing is required for freshman, does that mean you’re exempt from mandatory dorm living since you’d be past your first year?",
    "subreddit": "college",
    "selected_at": "2025-09-07T22:11:58.382989Z"
  },
  {
    "source": "posts",
    "id": 827706,
    "title": "NUS DSE career prospects",
    "self_text": "I know the first batch was 2 years ago, and no one has graduated yet. But if you have any knowledge about these questions, please share!    What are the main sectors that graduates can find employment in?    What makes DSE unique compared to a regular economics major?    Does having proficiency in data science increase your chances of getting employed in the public sector?    How much of the things learnt in data science modules will actually be applied at work?    Will it be hard to get employed because there's no internship?    Is it possible to find jobs in more technical fields like data science, machine learning or even AI?    What proportion of the curriculum is math, stats, computing, economics, etc.    Thanks",
    "subreddit": "SGExams",
    "selected_at": "2025-09-07T22:40:39.274488Z"
  },
  {
    "source": "posts",
    "id": 509909,
    "title": "Is being jobless at 22 really bad?",
    "self_text": "Hi!  I graduated last year and life started giving me a hard time so I did not apply for any job. I have been applying since June but not getting any success, sometimes people call and schedule an interview but ghost me at the last moment.  I fear if this keeps going on I will be going old without any work experience to show for, also my parents really want me to get a job ASAP and my father always gives me an angry face. I have made several projects and uploaded them my GitHub but nothing seems to be working.  Any tips on what to do?  I am into tech by the way. Don't have any professional experience but have made several projects [Web Development and Software Development, Python, JavaScript, as such], but it seems everyone wants someone with 2-5 years of experience and not freshers, I'm not asking for an astronomical salary as well, just something to start with.",
    "subreddit": "india",
    "selected_at": "2025-09-07T22:44:07.350172Z"
  },
  {
    "source": "posts",
    "id": 829164,
    "title": "Early decision withdrawal",
    "self_text": "Can we withdraw our ED application half an hour or minutes before the release of decisions?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T22:59:57.474599Z"
  },
  {
    "source": "posts",
    "id": 283953,
    "title": "Testing section is BLANK on submitted app despite checking \"Yes\" to reporting scores?",
    "self_text": "I am so confused. On the pdf of the submitted common app to my ED college, the testing section is completely blank. When I go back to the common app, the self report section is filled with AP scores and SAT score, and the option to self report is clearly checked \"yes\".  Why is this happening? Can I email admissions with a screenshot of the unsubmitted app?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T23:01:17.778607Z"
  },
  {
    "source": "posts",
    "id": 752860,
    "title": "AITA for replying this way to my mom after being scolded?",
    "self_text": "I was studying for my university finals which I had in 2 days, my mother had just came back from a day trip to Msia with my uncle and auntie, I had studied the whole day without my earpiece on as I was not feeling the mood to listen to music while studying. 2 minutes earlier I decided to put on my earpiece(noise cancelling kind) to listen to some music and she came home, she had the keys, and barged into my room without warning. WIth a dark look on her face, she stood at my doorway and spoke to me in a harsh voice.” Did you know I knocked your window for 3 times you didn’t came to the door to help me with the things I bought. “, I said \"Im sorry I had earpiece on\", “she replied, what is the doorbell for?” I then spoke, “For the person in the house to know that there is someone at the door”, “She then cuts me off, saying” do you know how dangerous it is to not be able to hear what is happening outside the house, what if there is a fire?” She continued, “ why do you have your earpiece on” “I just put it on not long ago, Im sorry that I didn’t hear your doorbell ringing, if it is my fault that I didn’t hear the doorbell ringing as I just put on my earpiece to listen to music, 2 mins earlier only, I’lll apologise,” “she stayed silent and I then continued,” im sorry that I didn’t hear the doorbell, I should be more careful next time, I won’t—“ she cuts me off but shutting my door and walked off without listening to what I had to say. It was not a regular door shutting but a big swing and my door then slammed. Am I the bad person for crying or for defending myself? Now im pretty sure she is pissed at me because of my tone, which I always tend to sound like and look like im angry. I am feeling not remorseful but very hurt, and I feel like I have been accused and scolded, my emotions are now haywire and it makes me hard to focus on continuing to study thus writing this down to pour out my overwhelming emotions and feelings so I can feel better because I feel like crying, but I have no time cos you know uni finals exam in 2 days.",
    "subreddit": "AmItheAsshole",
    "selected_at": "2025-09-07T23:04:10.341701Z"
  },
  {
    "source": "posts",
    "id": 610826,
    "title": "What career would be best for a big hearted person who loves to help people but doesn’t want to attend a 4 year university?",
    "self_text": "Looking for a career. I’ve been a server/bartender for 9 years, have my cosmetology license but since Covid, can’t build a clientele without having a second job. I love being social, helping people, taking care of people and love being on my feet. Don’t want to go to a 4 year university. Nursing I feel like would be my best bet, but the programs around me are all lottery based and don’t really want to wait my life away for that. Any ideas? I also enjoy a fast paced program.",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T23:08:52.658869Z"
  },
  {
    "source": "posts",
    "id": 353352,
    "title": "Anyone taken CS 6110 in SP21?",
    "self_text": "Title. Thinking about taking it next semester as an undergrad. How's professor Silva and how does she grade? Thanks!",
    "subreddit": "Cornell",
    "selected_at": "2025-09-07T23:09:26.538809Z"
  },
  {
    "source": "posts",
    "id": 333990,
    "title": "[High School Math] Diluting Percentages Evenly",
    "self_text": "So this isn't for my classes or anything, but something I was thinking about and want to know how to do.  Person A holds 60%, Person B holds 20% and Person C also holds 20% for a total of 100% of product.  Person B's share increases to 30%.  What is the formula to calculate the resultant percentage shares of Person A and Person B?",
    "subreddit": "learnmath",
    "selected_at": "2025-09-07T23:10:42.052442Z"
  },
  {
    "source": "posts",
    "id": 909484,
    "title": "Learning retention?",
    "self_text": "Is it weird to do or go over a course or course material multiple times to make sure it's understood and can be implemented?",
    "subreddit": "learnprogramming",
    "selected_at": "2025-09-07T23:11:49.952747Z"
  },
  {
    "source": "posts",
    "id": 390900,
    "title": "UMich vs Cornell vs NYU vs GWU vs BU",
    "self_text": "Waiting for Spring transfer results to be rolled out and got into UMich last week! Definitely still waiting for more results but conflicted on where to go assuming the best case scenario :”)  Going to be majoring in International Relations/Political Science.  Academics wise: Seems like UMich ranks quite high in political science, but so do Cornell and NYU. Not sure how to compare the schools academically. At the same time, GWU being in Washington is definitely an advantage quite unique to this major given the opportunities (but not sure how much I’d be able to gain from that as I’m on a bond and there are limitations to the chance to intern). Any advice on comparison between the Cornell/UMich/NYU  Other considerations:    UMich seems like it offers a really traditional campus life experience, and the courses are interesting. But as an international student I honestly don’t have a very deep impression of the school though I’m sure it has a lot to offer. Would love to hear the experiences of others  Cornell also offers that traditional campus experience that I would love to experience, and the area seems beautiful as well with a good amount of nature though a seemingly reasonable distance from the city   NYU’s location in NYC is really a dream, would love to experience living in NYC. But not sure if it’d feel very isolating given the spread out campus and non-traditional campus life",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T23:12:46.632678Z"
  },
  {
    "source": "posts",
    "id": 447948,
    "title": "Overwhelmed by application season",
    "self_text": "I am so overwhelmed with application season that it’s making me doubt whether I can even handle grad school again for my PhD. I’m struggling to even narrow down my list to finalize for my letter writers. I don’t know if it’s just anxiety or picking the right schools or fear because I’m making a slight shift in content area from my MS.  I am literally having imposter syndrome just to get through the application process. Realistically, if I wasn’t capable I wouldn’t even be considering applying and my letter writers would not have emphatically said yes to my requests. It somehow does not change the absolute overwhelming feeling that comes over me every time I open my prospective program list and applications.",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-07T23:13:50.068796Z"
  },
  {
    "source": "posts",
    "id": 835392,
    "title": "question ab parent demographics",
    "self_text": "Hello! I was wondering if I had to input my stepfather for parent demographics, considering that he is on the tax return, and he contributes to the income. However, he's not my biological father and I hardly consider him as a father figure. So would I be REQUIRED to put down my stepfathers Information on the applications if he's contributing towards income? Can I put my biological father who passed away? I'm just confused if i'm doing it wrong or not.",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-07T23:14:03.377140Z"
  },
  {
    "source": "posts",
    "id": 271766,
    "title": "How to get into software development with a degree, but a long gap in my resume?",
    "self_text": "I'll keep it as concise as I can:  - Graduated in 2014, B.S. in Computer Engineering  - Did not find work for a few years  - Got work as a support analyst, did plenty of coding but mostly was focused on customer support. Was supposed to lead into a dev job but our company got bought out and the tech team was dropped  - Ended up leaving that job in 2018 due to severe compounding mental and physical health issues  - Moved across the country, failed to find a job, COVID happened, I ran out of money, moved back home  I am great at coding, but I'm not great at proving it. I struggle a lot with running my own projects and with the social aspects of job hunting. I need a plan to get back into it, but everyone gives conflicting information about how good it is to get a certificate or go back to school or whatever. Any advice is appreciated. Thanks so much!",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-07T23:14:06.702853Z"
  },
  {
    "source": "posts",
    "id": 314120,
    "title": "Do great on assignments but testing so poorly",
    "self_text": "So I'm in my 2nd year at college, took midterms and few weeks ago and didn't do great. Practically failed one and almost failed the other. I also failed my math class last semester by 1%, I did really well on my homework but fail the midterm and final.  I don't know what I can do, I study and do the work but nothing helps. I love learning but testing kills me and I feel like I'm wasting so much money just to fail classes.  Any advice?",
    "subreddit": "college",
    "selected_at": "2025-09-07T23:14:10.876622Z"
  },
  {
    "source": "posts",
    "id": 1046893,
    "title": "where to eat fish on campus?",
    "self_text": "weird question but for nutrition reasons my dietician advised eating more fish in my diet. Are there any places on campus that serve salmon/other fish regularly?",
    "subreddit": "Cornell",
    "selected_at": "2025-09-07T23:14:57.258840Z"
  },
  {
    "source": "posts",
    "id": 1009627,
    "title": "Where to find job opportunities in France/Europe for fresh grads?",
    "self_text": "Hi! I'm a foreign languages student (major in French, minor in German) from the Philippines and I'll be graduating from university in June/July next year. I have experience teaching both French and English as foreign languages and teaching seems to be the best path for me now, and I am genuinely happy with the work I do. That being said, I'm more interested in pursuing other language-related fields such as translation or media production/studies.  I'm open to starting out simple since it'll be a new experience for me to live in Europe/France. Any advice as to where I can look for job opportunities in France (or anywhere in Europe as an ESL teacher) as a fresh grad? (Apart from LinkedIn lol)  Thanks to anyone who could help!",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-08T13:41:52.114633Z"
  },
  {
    "source": "posts",
    "id": 494086,
    "title": "Is getting a master's in UX design worth it?",
    "self_text": "I graduated with a BA in psychology about a year ago and have been working in human resources for the past 6 months. I don't necessarily hate my job or anything like that, but it is definitely not the field I want to be in for the rest of my life. I have always been interested in working in a tech field and have been doing some research on the UX field. Recently I started taking a Udemy course on UI/UX Design, specifically in Adobe XD. I have fallen in love with it and think the UI/UX field would give me the freedom, creativity, and challenge I am lacking in my current career. I would really love to get my master's in this field, but am unsure if it is worth the money when I know you can get into without a degree. I guess I have a couple questions. How hard is it to get into UX design? I know it is a competitive field, so will a master's help me? Will the benefit outweigh the cost?   Bonus Questions: Are there a lot of UX design jobs around NE Ohio?  Thank you in advance!",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-08T13:45:14.054536Z"
  },
  {
    "source": "posts",
    "id": 1028535,
    "title": "PSAT scores coming in a week",
    "self_text": "I’m guessing I got 1520 or so but I also didn’t study at all so it might be much lower.",
    "subreddit": "teenagers",
    "selected_at": "2025-09-08T13:45:36.770618Z"
  },
  {
    "source": "posts",
    "id": 783801,
    "title": "Question about virtual shadowing and counting hours",
    "self_text": "I completed 200+ of virtual shadowing, but I now have 600+ hours of scribing experience. Should I add the virtual shadowing to my application or should I just drop it?  I was a tutor for a year and did not count the hours I worked (I tried to look for the last paycheck but did not have any luck). How important is reporting hours on the application?",
    "subreddit": "premed",
    "selected_at": "2025-09-08T13:50:02.938480Z"
  },
  {
    "source": "posts",
    "id": 515964,
    "title": "Nicotine testing?",
    "self_text": "Through my job search, I had quite a few employers have a no nicotine clause, saying they enforce with testing. This was mostly big hospitals. I guess I'm just wondering... Is this new? Is this something some medical schools subscribe to as well?  I remember a few years ago some places were giving non-smoking employees some extra time off to try to match other employees daily breaks from smoking, so I felt threre was some kind of shift happening.  Just curious!",
    "subreddit": "premed",
    "selected_at": "2025-09-08T13:50:51.924287Z"
  },
  {
    "source": "posts",
    "id": 511913,
    "title": "Can anybody help with this?",
    "self_text": "You draw 6 cards out of a 52 card deck. What is the chance of drawing 4 cards with the same symbol and 2 cards with a different symbol. Does anybody know the answer?",
    "subreddit": "learnmath",
    "selected_at": "2025-09-08T13:55:59.066688Z"
  },
  {
    "source": "posts",
    "id": 560237,
    "title": "How long should the writing sample be for a Sociology PhD application?",
    "self_text": "Right now I’m at 8 full pages (double spaced, size 12, times new Roman), is this sufficient? It’s still in the editing phase, so it’ll probably get to ten pages when I add in smoother transitions. I’m applying to an R1 in the US. Thanks!",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-08T13:58:47.802889Z"
  },
  {
    "source": "posts",
    "id": 993388,
    "title": "Boot camp suggestions",
    "self_text": "Mainly the two things I’m looking for in a boot camp are   affordability   job placement once completed   Any suggestions?  I’m looking into general assembly",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-08T13:59:09.522367Z"
  },
  {
    "source": "posts",
    "id": 848409,
    "title": "What is the difference ...",
    "self_text": "What is the difference between 'I really am..' and 'I'm really..\"  For example  I really am hungry. I'm really hungry.   Do they have the same meaning?",
    "subreddit": "EnglishLearning",
    "selected_at": "2025-09-08T14:05:14.707071Z"
  },
  {
    "source": "posts",
    "id": 406116,
    "title": "Tips for kids who refuse to do work?",
    "self_text": "Elementary special ed. I see one kid in a group of 5. He is very smart and capable but has diagnosed ODD. When asked to do work he will lay on the floor and roll around or go sit in the corner and refuse to come out.   Behaviorist is involved but I’m just looking for more tips. I’ve offered him breaks, timers (if you can work for 2 minutes you can have a reward), modified problems (let’s try to get two done instead of the whole page). I try offering him to come sit next to me and do it together, the choice to do it on a dry erase board or use a marker. I’ve sent it home as work, I’ve put Unsatisfactory in grade book as a participation grade. I’ve been in touch with parents.   But he still shuts down and doesn’t say a word. I usually just end up ignore it but he isn’t getting any work done at all.   Sticker chart was the suggestion but I don’t think he’ll be motivated by it. I asked him if he could have any reward at school what would it be and he said “nothing, I don’t care”.   Any tips or advice?",
    "subreddit": "Teachers",
    "selected_at": "2025-09-08T14:07:56.211927Z"
  },
  {
    "source": "posts",
    "id": 390339,
    "title": "help me with srar!",
    "self_text": "for srar, it says to put classes exactly how the appear on my transcript. if my transcript abbreviates things, like hon algebra instead of honors algebra, should I use the abbreviated title?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-08T14:13:48.620221Z"
  },
  {
    "source": "posts",
    "id": 301557,
    "title": "Is the 90s tv show Recess \"woke propaganda?\"",
    "self_text": "At lunch I like to show TV shows that I enjoyed as a kid like Recess or later Phineas and Ferb. We eat in our classrooms and it's an easy way for us to have a mental break and allow me to catch up on grading and planning. I just received and email from a parent saying they didn't like the values it shows because it is making \"woke propaganda\" appealing to kids.   What are your thoughts?",
    "subreddit": "Teachers",
    "selected_at": "2025-09-08T14:15:12.230575Z"
  },
  {
    "source": "posts",
    "id": 604168,
    "title": "how to delete/reset language",
    "self_text": "A couple years ago my son did a couple of lessons in Russian on my phone. I hate seeing it on my list, lol. Can I delete it?  Also, I decided to try Spanish. I have learned some in the past, so I took the placement test. I put me at lesson 28. 😳😳😳 I went back to lesson 1 and can't even finish one of the crowns with less than 3 errors. 🙄🙄🙄   I would really, really love to reset the language to the start. I feel messed up to be at level 28. How do I reset the language?",
    "subreddit": "duolingo",
    "selected_at": "2025-09-08T14:31:02.088594Z"
  },
  {
    "source": "posts",
    "id": 853167,
    "title": "Order of names is different in transcript",
    "self_text": "F- first name M- middle name L- last name  My name on my college transcripts is  L F M, but I’ll be applying to each program as F M L.  I’ve even asked my recommendors to write my name as F M L.  Will a differently formatted name on my transcript be an issue while submitting applications?",
    "subreddit": "gradadmissions",
    "selected_at": "2025-09-08T14:31:20.918903Z"
  },
  {
    "source": "posts",
    "id": 418750,
    "title": "[UK] [Primary] - What's a good job for an Ex Teacher?",
    "self_text": "So I'm heading back to the UK after 6 years of international school teaching abroad. I liked my job, but there is no way I'm gonna do it in the UK.  &#x200B;  So what should I do instead? I guess this is a question for other people who are qualified and experienced teachers, after you abandoned ship, where did you jump to?  I'm seriously considering going to trade school and becoming an electrician. I know it's a big change, but the more I look into it, the more I like the idea.   &#x200B;  Any other ideas would be most welcome.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-08T14:34:11.954050Z"
  },
  {
    "source": "posts",
    "id": 819692,
    "title": "Multiple jobs in the same county",
    "self_text": "Most counties seem to list their jobs by specific position at a certain school. What if I’m looking at a county I want to work in and they have multiple openings across the county but at different schools? Should I apply to only one or all of those I’m interested in?   My only concern is that if I apply to one, my name and resume go to HR so I feel like although I’m not picky on what school I’d like to work at, if I flood them with applications it could seem desperate/excessive.",
    "subreddit": "Teachers",
    "selected_at": "2025-09-08T14:37:58.443204Z"
  },
  {
    "source": "posts",
    "id": 909774,
    "title": "It is Lists of Lists, a List or a Numpy array?",
    "self_text": "Hello everyone.   I have a simple problem. My function takes in an input. A prior I do not know if (as per title) it is a Lists of Lists, a List or a Numpy array.   What would be the quickest way to deal with the problem. Is there a universal conversion into some standard format, or do I have to check input type and do a few if statements?   Thank you for any input.",
    "subreddit": "learnpython",
    "selected_at": "2025-09-08T14:44:17.536176Z"
  },
  {
    "source": "posts",
    "id": 452984,
    "title": "Your personal statement topics in four words?",
    "self_text": "Indulge me please I’m feeling insecure about my statement",
    "subreddit": "lawschooladmissions",
    "selected_at": "2025-09-08T14:44:44.923100Z"
  },
  {
    "source": "posts",
    "id": 377264,
    "title": "Do i need to do something about this?",
    "self_text": "Guys I applied to USC EA alongside Stanford REA, despite USC being a private university. I did this under the exception on Stanford's website that allows you to apply EA to any uni (public or pvt) incase a scholarship is dependent on you applying EA.   Do i need to inform Stanford about this to clear it out? Or should I just take no action? Has anyone else also done this?",
    "subreddit": "ApplyingToCollege",
    "selected_at": "2025-09-08T14:47:23.060655Z"
  },
  {
    "source": "posts",
    "id": 496550,
    "title": "Is the bar this low for regular employees?",
    "self_text": "My question relates to advancement through different companies. TL;DR: started at entry level, want to move up, but fear hiring managers at other companies think I have the work ethic of the typical entry level employee, this limiting moving up across companies  If a person is working in the same industry, but is switching companies, is the expectation set so low that a person would have to start from entry level and work their way up?  I ask because I was an \"entry level\" employee that did some tasks that the company considers \"mid-senior level\" at my first company (right after college) for my first 4 years. Then I left to take on a more challenging position in a different industry that is somewhat related.  Now, I am looking to get back into the first industry where I made a huge impact but cannot seem to find any leadership roles that offer a job after interviews.  My colleagues have all mentioned that I \"pick things up very fast and that I am bright\" and also \"intelligent\". Unfortunately, after rounds of interviews for managerial roles across different companies, I am always told the company is going with another candidate but...there are entry level roles that I would be a great fit for.  In this industry, I easily excel at the basics and get bored. I don't want to start from ground zero as it seems like HR and hiring managers think that because I worked entry level that I need to start there again...because from what I've seen the entry level employees are just doing the minimum to get by.  I would like to think that I have enough work ethic and business oriented mindset to take on roles with more responsibility and thus much higher pay.  Has anyone else come across this obstacle?",
    "subreddit": "careerguidance",
    "selected_at": "2025-09-08T14:47:40.715035Z"
  },
  {
    "source": "posts",
    "id": 607231,
    "title": "What's the best place to start for a self learner.",
    "self_text": "I have a lot of free time right now due to being hurt. I've been tinkering with my old laptops and would like to learn how to program and maybe even change career paths.   Any and all help appreciated. Thanks in advance.",
    "subreddit": "learnprogramming",
    "selected_at": "2025-09-08T14:51:09.780825Z"
  },
  {
    "source": "posts",
    "id": 400781,
    "title": "Roommates want location",
    "self_text": "My 5 other female roommates all share their location with each other and have been pressing me to share mine with them. When I say no they ask “what I have to hide” and claim they want to know partially for safety reasons. I see them stalking each other all the time and they even openly admit to checking each other’s location out of boredom. I’m often gone for doctor’s appointments for a medical condition but have not known them long enough to disclose this information, as it is often very stigmatizing. Not sure what to do- every time I return from something I get asked where I was and why I was gone for “so long.” I am usually only gone during the day while they stay out late at night, so I’m not sure why my safety is such a concern…",
    "subreddit": "college",
    "selected_at": "2025-09-08T15:00:41.878241Z"
  },
  {
    "source": "posts",
    "id": 393954,
    "title": "Advice going forward",
    "self_text": "Just asking for some general advice and possible opportunities.  I've been working at a local computer repair shop in my town and will reach my 2nd year this upcoming March. It's essentially a help desk job with plenty over the phone troubleshooting as well as in person repair.  I work 50 hours a week with no overtime or benefits and need to start earning more.  I feel like there isn't much of anything left I can learn at this job and it's feast or famine as far as how busy we get.  I know I want to move forward into cyber security, (almost anywhere in that category for now) and I'll also be finishing my Associates in Cyber Security/Information Assurance by Christmas.  After that I plan to start pursuing more certs.  I've been applying for positions for entry level cyber security, (mostly remote) and have only ever gotten a call back from Revature once I started branching out to other positions.  I know the market for jobs everywhere isn't the greatest right now but surely I'd have gotten something back from any of the local positions or remote ones by now.  I did discover a potential formatting issue with my resume a few weeks ago but have more or less rectified it by copy pasting a png of it onto a document.  Even so I've been applying with my Indeed resume more often than not.  If there's any additional questions I need to start asking or overall paths I should be moving toward, I'd be grateful for any advice I can get.",
    "subreddit": "cscareerquestions",
    "selected_at": "2025-09-08T15:02:31.714204Z"
  },
  {
    "source": "posts",
    "id": 353483,
    "title": "Common Area affecting my room",
    "self_text": "So I have a newer dorm where a group of people shares a commons area with a T.V  &#x200B;  My fellow residents have not been treating it well as they watch sports there and every night it ends up a mess with Doordashed food and chips on the floor  &#x200B;  Recently I and my roommate have noticed it has started to smell  &#x200B;  Not only that but because we live so close to the area it has begun to stink up our room  &#x200B;  Also, they have been breaking some rules as they put a piece of paper over the light sensor so the room gets darker  &#x200B;  Our R.A does practically nothing about any problems so its no use talking to him about it  &#x200B;  What should I do?",
    "subreddit": "college",
    "selected_at": "2025-09-08T15:03:54.693115Z"
  }
]