[
  {
    "source": "posts",
    "id": 982733,
    "title": "How to change blue print pivot",
    "self_text": "How can I change the Pivot of an object within a prefab?  I want to rotate the doors of my wardrobe so I need to change the Pivot where the hinges are  It seems that i cant really do it in UE? but is there a workaround for something like this?  https://preview.redd.it/ortfjm9trn2a1.jpg?width=1440&format=pjpg&auto=webp&s=c4a0861acf57110a2159a1e3208446e769c7b879",
    "subreddit": "unrealengine",
    "selected_at": "2025-09-06T23:38:52.328638Z"
  },
  {
    "source": "posts",
    "id": 873679,
    "title": "Old bookshelf speakers is it worth upgrading",
    "self_text": "Hey there I've got an older home theater system in (probably 15ish years old) and I'm wondering what the overall consensus would be about the speakers I have and if it would be worth upgrading them... If so, what would be some good options? Newer bookshelves? Floor standing? Etc... I would typically use the setup for tv/movies and occasionally music. My preference would be to keep it all under 1000$ cad if possible, I could reasonably piece something together over time as well.  My current setup is 2 Energy 4.1e bookshelves, a Kenwood crs157 center, I have a 10\" generic sub.   I am in Canada so I know options can be limited here...  Edit: my living room size is about 13x15' or so couch is maybe 11-12 ft back from the tv",
    "subreddit": "hometheater",
    "selected_at": "2025-09-06T23:38:57.302943Z"
  },
  {
    "source": "posts",
    "id": 657107,
    "title": "Best gpu for i5",
    "self_text": "I've been looking to build my first pc. Currently have the better part of most components. I just want opinions on what gpu to purchase for an i5 12600k. Would prefer to keep it under 400$ if possible.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-06T23:40:27.577891Z"
  },
  {
    "source": "posts",
    "id": 810621,
    "title": "Best way to store actor groups?",
    "self_text": "Basically I want to make a bunch of premade rooms and spawn them in randomly, connected to another. I'm unsure what the best way of storing these rooms would be. Thanks in advance!",
    "subreddit": "unrealengine",
    "selected_at": "2025-09-06T23:40:34.756222Z"
  },
  {
    "source": "posts",
    "id": 960297,
    "title": "Cpu and mobo upgrade, but not sure on what to get",
    "self_text": "Looking to upgrade my PC into something more.. modern   Current specs are;   Nvidia GTX 1070 8gb  CPU: i5-6500  MOBO: Asus h110m-a/dp   RAM: 16gb   I'm currently looking into upgrading my cpu and mobo and was debating either;  CPU: i5-12400F or i5-12600KF  MOBO: honestly not sure, had a few in mind but any recommendations would be helpful.   Budget will be 500-ish.   Thanks.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:40:52.722735Z"
  },
  {
    "source": "posts",
    "id": 1013913,
    "title": "R9 7950x + ASUS ROG STRIX B650E-F GAMING WIFI",
    "self_text": "Is this mobo good enough to power the 7950x? I do not plan to OC.  It has 12+2 Power Stages at 80A and only 1x 8-pin + 1x 4-pin Power Connectors.  Is this a significant weakness of this board when combo'd with the 7950x?  I would love to get the ASUS ROG STRIX B650E-E GAMING WIFI, but it's out of stock everywhere, where I live.  Edit: Added some information about the mobo in question and that I do not OC.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:42:43.754334Z"
  },
  {
    "source": "posts",
    "id": 361330,
    "title": "If I send someone a workbook with power pivot tabes will they need power pivot installed to view the tables?",
    "self_text": "I'm doing a test for an interview and I have solved it by using power pivot but I want to check that they will be able see everything. The chances are that they will have it installed (this is for a data analyst role) but will they at least be able to see the values of the pivot tables if they don't have it?",
    "subreddit": "excel",
    "selected_at": "2025-09-06T23:49:13.702334Z"
  },
  {
    "source": "posts",
    "id": 475361,
    "title": "Something in my PC first died, then I killed the PSU. A repair dwindle boogaloo. A man versus technology narration that will move all rationale you've got left into computer repair. A simple ... ;;; Perchance ;;;.",
    "self_text": "Hello Redditors! Very,  very  funny story happened today. Well, not for me, but that's not the point.  &nbsp;  It had been a beautiful morning of Eight of November. A young, yet aspiring man hath riseth from his bed, waddled to his seat, and henceforth the story fully began. He awoke his computer from sleep as always, and frittered away the time. Seconds felt like pure blissful eons, as he scrolled through the endless internet. He decided to start a long dead game called Evolve, and start it he did, indeed. 10 minutes into a thousandth match of his life, his PC  suddenly   shut down . This has happened before.     \"A power outage it must've been!\"  , - he thinks to himself. But, as swiftly as he came to that conclusion, he just as quickly noticed the contradiction in front of him, as well as above him. Ceiling lights remained on, and router remained on as well. By this time - the computer has already started turning itself back on. He waits 15 seconds for the splash image to arrive - but it never does. So, he resets the computer. Still nothing.  Coincidentally, he notices that the mouse and keyboard lights aren't coming on either, so he grabs his pluggable USB voltage meter and plugs it into his USB ports - it reads 3.5V. 1.5V lower than intended. Instantly, frightened of data loss, he turns off the computer and removes all drives. Then, he grabs his voltmeter and measures 12V, 5V and 3.3V rails of the PSU. He reads 9.5V, 3.5V and 2.7V. All lower. Not good. He thinks it's a bad PSU when he notices that his motherboard has LED debugging LEDs. He reads what the LED says - the \"CPU FAULT\" LED is on. What could it be?   The introduction has been pretty simple so far.   Sudden shutdown  Won't post, but fans spin  Low voltage on all rails, but...  IS IT?   the story continues     He decides to remove the GPU as well, to prevent the damage to it, as he remembers the GPU has very sensitive MOSFETs that operate in a specific voltage saturation region and low voltage could kill them. Besides, the computer has integrated graphics, so that's not a problem.  &nbsp;  Correcting steps, commence!  &nbsp;    With only PSU, Motherboard, RAM and CPU remaining in the case, he decides to clear the BIOS via BIOS jumper as well as remove the BIOS battery for 30 minutes. He does it, no change.    He decides to shuffle ram, no change.    Voltage gets measured again, and this time..  SURPRISE!  Voltages are good and within spec! 12V, 4.98V and 3.3V!    He decides to take out PSU completely and to the paperclip test - it works great! So..  is it not the psu after all?      What do we know so far?   Voltages seem to be fine now  Still no post  Paperclip PSU test works ok   What happened next?    Stupidest moment of the story begins!   Next loical step in diagnostic would be reseating the CPU, possibly a new one and trying a second motherboard. As motherboards are more expensive than cheapest compatible CPU, he decides to get a CPU. However, the seller said it will have to wait until tomorrow, so he grows impatient. He searches the internet a bit about the problem a Youtube video about an user facing the exact same issue and solving it! And the comment section is FULL or positive replies. So he decides to try it!  &nbsp;   How is it done?   Simple, turn on your PC that won't post, and then quickly shift your ON/OFF switch on the PSU back and forth, quickly as in crazy fast.  I did that once, nothing happened. Second time, nothing. I guessed I was too slow. Third time I'll try it super fast, I thought to myself. So I do it and - woo! Power outage for real!! Wait - that's my breakers popping. Wait hold on did my PSU just blo-----.   Yes.    Yes it did.    So all in all my beloved Redditors, now I'm stuck with a dead PSU and either a dead motherboard or CPU. I'm out of ideas or any thoughts at all, so I hoped that you'd have something to share in the comments.  &nbsp;  Thanks for reading, love you all.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:50:33.987469Z"
  },
  {
    "source": "posts",
    "id": 399668,
    "title": "which 3080 ti should i go for? gigabyte gaming oc or asus TUF oc",
    "self_text": "gigabyte is around $1.120  asus tuf is around $1.218  pretty much $100 more expensive, i'm gonna be honest looks-wise i much prefer the gigabyte one but according to some people the asus tuf is better? I'm not quite sure better in what regards, but is it really worth the price difference?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-06T23:57:23.385840Z"
  },
  {
    "source": "posts",
    "id": 636771,
    "title": "Good enough VRAM?",
    "self_text": "I'm sorry for asking so many questions. Is the  NVIDIA GeForce RTX 3060 with 6GB GDDR6 VRAM good for stuff like Photoshop? (I'm looking at the MSI GE76 Raider). I think I have 8gb in my old laptop with GTX880M. But I imagine newer systems are more efficient?  &#x200B;  https://preview.redd.it/mzx4t0dok10a1.jpg?width=563&format=pjpg&auto=webp&s=5c8cbaeb2adf0ef2aa0b3efb14d2b0cc65216a44",
    "subreddit": "GamingLaptops",
    "selected_at": "2025-09-07T00:10:32.521377Z"
  },
  {
    "source": "posts",
    "id": 415431,
    "title": "PC build help",
    "self_text": "CPU: i3 12100F Mobo: ASRock H610M-HVS RAM: FURY Beast black 2x8GB GPU: ASRock intel ARC A380 Challenger PSU: EVGA 500 BQ 80+ Bronze  These are the parts and I just want to know if these parts are a decent match for eachother.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T00:10:50.810388Z"
  },
  {
    "source": "posts",
    "id": 678025,
    "title": "best Cpu for rx 580",
    "self_text": "Best ryzen cpu to pair with rx 580? For 175$.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:14:29.989421Z"
  },
  {
    "source": "posts",
    "id": 982589,
    "title": "Any motherboard alternatives for my build?",
    "self_text": "Hi I'm looking for some advice on my build that I am looking to buy soon. Any help would be appreciated   https://au.pcpartpicker.com/list/LBG9Q6",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T00:15:31.586788Z"
  },
  {
    "source": "posts",
    "id": 836751,
    "title": "My phone turns to light mode out of no where and apps and games get access to mobile data when I had that turned off…",
    "self_text": "I sadly don’t have pictures but today, when I wanted to show my friends a video that was in my library, my phone turned to light mode when I turned my phone to landscape. So it was in dark mode in portrait and turned to light mode as soon as I turned my phone to portrait mode. What I also have been noticing is that games I play that are offline( but when you’re connected to WiFi you get ads ) suddenly get ads( I never am connected to WiFi because I have a subscription with unlimited data and my WiFi is worse then my data so might as well ). When I went to look in the settings for the app, it said it didn’t have permission. But I clearly got an ad when I DIDNT HAVE WIFI ON and was only connected to data.  That was it",
    "subreddit": "iphone",
    "selected_at": "2025-09-07T00:16:38.778955Z"
  },
  {
    "source": "posts",
    "id": 843194,
    "title": "help me choose a mouse!",
    "self_text": "hi, i am looking to upgrade from my razer viper ultimate.  i have hand size 19.7x11.4 and use a relaxed claw grip, however i am willing to change grip it needed.  while i will play csgo and other games, my use is not primarily gaming, however i prefer the mouse to be very light and comfortable.  i also prefer wirelesss, the vaxee shape is particularly interesting, however it is not wireless, please let me know if there have been any updates in vaxee’s wireless release, i plan to upgrade this winter.",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-07T00:17:14.629420Z"
  },
  {
    "source": "posts",
    "id": 802707,
    "title": "are these specs good / properly balanced ?",
    "self_text": "this is prebuild, but hope its ok to ask what you think of these specs is it balenced? Im interested in gaming and it being mostly quiet.   AMD Ryzen 5 5600x Wraith Stealth / 3.5-4.6 GHz, ASUS GeForce RTX 3070 DUAL V2 LHR - 8GB , ASUS PRIME B550M-A, DUTZO Kori ARGB 240 - CPU watercooling, Corsair Vengeance LPX DDR4-3200 C16 BK DC (AMD optimized), WD Black SN750 SE M.2 NVMe Battlefield 2042 SSD - 1TB, DUTZO C720 Mesh Airflow RGB, DUTZO PS700B V2 PSU - 700 Watt - 120 mm - 80 Plus Bronze certified",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T00:18:53.318864Z"
  },
  {
    "source": "posts",
    "id": 934585,
    "title": "Creating new Smart Home",
    "self_text": "Hi all!  In my previous apartment I had a really nice Home Assistant setup, but some time has passed since then and my conditions changed a lot, so I need some help to get me started.  In the old apartment I used Sonoff devices to control the lights and heating. For thermostats I used Mijia bluetooth devices and everything worked just great...  I currently have a couple of Nest Mini and Nest Hub devices that shall be used for voice control. I also have a Xiaomi desk lamp and a Roborock cleaning robot. I plan to display the Home Assistant dashboard on the Nest Hubs, but I am not sure how that actually works. I have seen the cast option, but still have 2 questions:   Is casting a 2 way control, or is it just for showing the dashboard?  Can I make the cast always available on the Hub, so that the user can switch between different things on the Hub?   Now I need a solution for my radiators. I have seen that the Bosch has released a new version of their Zigbee thermostats. I have shortly used them and they had a problem with overshooting the temperature a lot. I quess that they have fixed that by now with an update, but if I connect HA directly to thermostats without a bridge, I wouldn't get the updates. The other option would be to get Tado devices, which are not Zigbee, but I have seen that they should work with HomeKit in Home Assistant. I guess that Tado software is more mature than Bosch and has more functionality overall. Finally, I could get Aqara thermostats for almost the same money as Tado, but I was not really impressed with the build quality...   Is there any way to update the devices without a bridge and cloud, but directly via Zigbee for example?  Das Tado work locally with HA and HomeKit?  How does Tado integrate into HA?    I plan to automate lighting again, but this time probably with Shelly devices instead of Sonoff. I guess they are a fair bit better too...  Which Zigbee stick would you choose? ConBee II or Sonoff Plus?   Do you maybe have some other advice for me? What should I consider or take care about?  Thanks a lot!!! :)",
    "subreddit": "homeassistant",
    "selected_at": "2025-09-07T00:23:35.533260Z"
  },
  {
    "source": "posts",
    "id": 311254,
    "title": "in your opinion, what's the best Zowie/Vaxee shape?",
    "self_text": "I've been looking into Zowie and Vaxee mice recently. I'll probably still wait until 2029 when they both go wireless but I'd still like to get opinions on the shapes. Btw, I know that shapes vary hand to hand.",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-07T00:23:47.196915Z"
  },
  {
    "source": "posts",
    "id": 567016,
    "title": "iPhone 14Pro Video @ 1080/4K 24/30",
    "self_text": "Dears,  Anyone experincing jitter or shakes when you try to shoot video at lower FPS for 1080 and 4K videos? It shoots smooth at 60 fps for both resolutions, however if at 24/30 fps it will shakes & jitters even before you press the capture button.",
    "subreddit": "iphone",
    "selected_at": "2025-09-07T00:26:17.805944Z"
  },
  {
    "source": "posts",
    "id": 725097,
    "title": "Can’t get Wi-Fi on Rog Strix B550-f Motherboard",
    "self_text": "I’m looking for help!!! I just built my first pc yesterday with the Rog Strix B550-f Wi-Fi (II) motherboard. While setting up windows 11 I need internet to finish the setup but no Wi-Fi is showing… when trying to update the wireless internet drivers in the bios using a usb it shows the folder but when clicked nothing shows in the folder nor gives me any option to install. Does anyone have any answers or ran into the same problem??",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T00:27:32.640676Z"
  },
  {
    "source": "posts",
    "id": 403794,
    "title": "So, AMD is doing what Nvidia did with 4080 variants, right?",
    "self_text": "I read an article in wich the AMD chief architect confirmed that the 7900 cards are both targeted to battle against the 4080, looking at the specifications.   So basically AMD is doing what Nvidia did with the 4080 versions, \"masking\" cards with an higher tier name to bump up prices, and not with just one card but two.  The only reason AMD \"shine\" it's because Nvidia cards are insanely more expensive but in the end is the same kind of scam.  Here is one of the articles talking about it: https://gamerant.com/amd-radeon-rx-7900-xtx-designed-compete-nvidia-rtx-4080-not-4090/",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T00:29:06.985323Z"
  },
  {
    "source": "posts",
    "id": 942728,
    "title": "Bonding two gigabit fiber lines?",
    "self_text": "I'm working on a home network setup where 2gbps up/down is going to be ideal. We have the ability to get dual fiber gigabit lines added, but I'm trying to figure out which hardware I need to make this happen. I've seen gigabit bonding routers for around $80, but haven't seen any that will combine >1gbps.  Any input on which hardware I could use to accomplish the task would be great thanks!",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T00:30:55.571430Z"
  },
  {
    "source": "posts",
    "id": 288901,
    "title": "Got malware after being dumb but removed it within minutes, am I safe?",
    "self_text": "So basically I was dumb and got malware from something I definitely should not have downloaded, but I picked up on it within minutes of infection and quickly scanned with Malwarebytes. It found 110 items, so I quickly quarantined and deleted them. Of course, it didn't come without complications, and over the last few days or so I've had multiple accounts attempted to be hacked. I made sure to change all passwords and have every single kind of protection on my accounts, and I've been vigilantly watching them to make sure I'm in the clear. Here's the thing though, while my computer is running pretty much as it should and I feel mostly safe, there's still something in the back of my mind that's telling me that it isn't safe, and I've noticed certain things like commands in Chrome take twice or three times to respond (Like CTRL + T and CTRL + W), and the fact that I've scanned with Malwarebytes in safe mode and it hasn't picked up on anything which makes me believe there's something still hiding somewhere. I've pretty much installed a good portion of the reputable antivirus programs out there (Bitdefender, Malwarebytes, Hitmanpro, etc.), none of which have picked up anything since the original infection, and I've even considered using Norton Power Eraser as well. I know a lot of you will say to just wipe and reinstall Windows, but it's incredibly time consuming and I'm not sure I'm able to currently.   Sorry if this is incredibly long, I'm just not sure what I should do going forward. Any advice is incredibly appreciated.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:31:43.937663Z"
  },
  {
    "source": "posts",
    "id": 583445,
    "title": "Home Theater setup - need some advice",
    "self_text": "Hello all! New to this subreddit, need some help as I'm trying to wrap my brain around a (complex to me) configuration issue.  Here's where I'm at:  I have an Xbox one X in a closet in my \"Theater\" room. I run an optical HDMI cable through the wall and up into the attic over to my  Optoma UHD30 Projector.This has worked fine, however, the audio from this projector is absolutely horrible.  I recently purchased a Sonos Beam and 2 Sonos SL's in a \"Surround\" setup. I currently have the Optical Audio converter cable to a ridiculously long HDMI cable ran on the ground to the Beam... which is not ideal and will not be permanent. Currently, I'm not getting true surround on the Sonos system and I think it has to do with the Optical Audio.  Here's where I need the beautiful brains of the internet to point me in the right direction. I'd ideally like to use some sort of HDMI splitter to extract audio via HDMI and have that go into an HDMI wireless transmitter. I've searched around online and nothing really stands out as a solid solution.  Or- perhaps I'm going at this the wrong way. I'm open to advice if anyone's willing to share!  Pardon the mess in the images, I have 2 kids that like to throw stuff everywhere :P  https://preview.redd.it/4qyqomr91nz91.jpg?width=4000&format=pjpg&auto=webp&s=bacb2aca26030cfa3322ef9486254c07a8775682  https://preview.redd.it/uqp2ior91nz91.jpg?width=3000&format=pjpg&auto=webp&s=3929248899121e4beddb7380cd3905aeaa96fa61  https://preview.redd.it/97uhjpr91nz91.jpg?width=3000&format=pjpg&auto=webp&s=e0d52b1d3cd891d335a692bd21e32110101fc4ab",
    "subreddit": "hometheater",
    "selected_at": "2025-09-07T00:31:46.352662Z"
  },
  {
    "source": "posts",
    "id": 1054888,
    "title": "PC randomly turns off when booting up games or doing certain things.",
    "self_text": "Hi. I was wondering if someone could help me with my computer. For the past 6 months at least, it's been randomly turning off on certain games or while booting up games. I recently bought a new motherboard, processor, cpu cooler, and ssd to try and fix this. These current specs are MSI MPG B550 Gaming Plus, Ryzen 7 5700x, GTX 1660 Super. I have 16 gb of ram and 650 watts of power. I had to do a manual bios update with the flash button on the motherboard to allow support for the processor. After fixing my computer I loaded up warzone from my harddrive and played a game. Everything went well. My brother then took a turn after me and right when he clicked to go back to the lobby, the computer, monitor, and all of the lights turned off completely. When we turned it back on, the CPU light went on so we turned it back off immediately. We then turned it on again for the CPU light to go on for a few seconds until it turned off, to then the VGA light going on and turning off, to the boot light going on and off, until it began booting normally. I reset my computer and my drives and then redownloaded windows onto my SSD. I redownloaded call of duty but every time I open it, my computer turns off. I can't even click the button to turn it back on anymore. I have to flip the power supply switch like 4 or 5 times before it finally turns on. Any help is much appreciated.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T00:32:55.008620Z"
  },
  {
    "source": "posts",
    "id": 730929,
    "title": "Pixel 7 Pro and Mi Band 5 Music Control",
    "self_text": "The Mi Band 5 Music Control is not working when the screen of the P7Pro is off or in AlwaysOnDisplay mode, so practically useless to me. On the Band I can read: \"No music is playing\". But as soon as I try to unlock the phone and it goes to the lock screen the Band recognizes the music playing and I can use the controls.  The same Band connected to a LG V30 works as it should. I have searched through the settings and online for a solution but found nothing. Can it be a setting preventing the Band reading the media playing? Or maybe it's a security feature with no workaround?",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T00:33:15.327134Z"
  },
  {
    "source": "posts",
    "id": 654137,
    "title": "GPU Fans keep starting and stopping no matter what I set the threshold temperature to",
    "self_text": "I have the EVGA XC3 Ultra RTX 3070 and use \"Fan Control\" to set my fan curve. However, I keep having the issue where the fans will turn on with a brief annoying noise, and then cool the GPU down slightly so that it's under the threshold and they turn off, and then gain some heat so that they turn on again etc. I have tried many different threshold temperatures for the 0 rpm mode (between 45 - 60 degrees) but the issue persists. Ideally, I would prefer not to just have them running constantly as I like idle fan stop as a feature but this is really frustrating to hear when I'm not in-game. Any ideas?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:34:33.293871Z"
  },
  {
    "source": "posts",
    "id": 418607,
    "title": "confused",
    "self_text": "I have a gtx 1650; for some reason, the fans don't spin while my PC is on. What's going on? halp",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:36:07.024471Z"
  },
  {
    "source": "posts",
    "id": 549899,
    "title": "Trying to figure out the best way to set this up",
    "self_text": "So I have a router from an online research study project right now and as much as it sucks to not be able to set up everything that I want to on it, it is basically paying for my internet right now so ditching that is out. I would like to add a second router behind that router though, and yes, i know that is a PITA to get just right. I'm curious though..  The current router and the one I want to add both have DMZ and VLAN options, and I also have a Cisco 48 10/100 managed switch I could throw at it if that'd help matters. I am fixing to start my server setup as well that will handle my media library, nas, security dvr, and a few other things so it'd be nice to get everything segmented out beforehand if possible.",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T00:36:19.118381Z"
  },
  {
    "source": "posts",
    "id": 889097,
    "title": "Best Small lightweight wireless mouse for Aggressive Claw (18 x 9)?",
    "self_text": "Currently have the Hati - S Wireless ,someone suggested the Pulsar X2 Mini so if anyone has experience with either of these mice and they have aggressive claw then please comment under this post or DM me with your experience please.",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-07T00:36:33.080628Z"
  },
  {
    "source": "posts",
    "id": 485017,
    "title": "RAM Voltage question.",
    "self_text": "I have two Kingston 16GB/5600MHz DDR-5 FURY Beast Black (KF556C40BB-16) memories. When I installed them fresh, the bios decided to default them to 4800MHz. Of course, I want to use them @ 5600, but it asked me whether I want to put the voltage to 1.0V or 1.35V. The timings are set automatically in both cases. According to the RAM's description, it has a 1.25 base voltage and here's my probably stupid question (please, keep in mind I'm basically a noob when it comes to voltages). I've set it to 1.35V which is clearly over 1.25V. Does the 1.25V means it's only the RAM's base voltage, not the upper limit I can set and I can safely set it to 1.35V?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:36:40.138842Z"
  },
  {
    "source": "posts",
    "id": 769396,
    "title": "I really don’t want to receive a motherboard that doesn’t work",
    "self_text": "So, the final part of my build will be my motherboard. I originally laid everything out, then slowly started researching every individual part and how well it could work with each other part. PSU and motherboard seemed to be the most problematic ones. Eventually I got the PSU figured out (at least thats what I think), but the motherboard is still just… uncertain. I found a psu that seemed to pass all the tests, yet every single b550 motherboard I research seems to have some problem. And its tricky too… I search amazon and go straight to the one star reviews. Filter out some more blatant DOA reviews. There was one board I had my eyes set on, the ASUS ROG Strix B550-A (also applies to F), and there is just a massive undiscussed issue with its ethernet ports apparently, they just dont work for many people. Every single board has this weird problem or multiple problems, and all I can think every single time is “wow, I would pay more so I can avoid that issue.” But while that may work for psu’s, it seems that the reviews play volleyball with the manufacturers— “never buying an msi product again. Plugged in x asus board and worked perfectly.” Reverse that on the asus product page.   I hate that uncertainty. Maybe Im just a baby though. What I suppose Im asking is, when it comes to b550’s, which is the best brand/model that can be proven (preferably through a reliable reviewing tech site)? Or is it not proven and just hearsay?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T00:38:13.368362Z"
  },
  {
    "source": "posts",
    "id": 968951,
    "title": "Thinking of buying a used Thinkpad off Amazon; if I get one with a Windows pro license, is it guaranteed to be transferable?",
    "self_text": "I don't plan to use the laptop for Windows at all, but I do have a main computer that I only usually use at home that runs Windows and it would be nice to get a cheap second laptop and a Windows upgrade to my current computer for a nice cheap price",
    "subreddit": "thinkpad",
    "selected_at": "2025-09-07T00:42:07.887569Z"
  },
  {
    "source": "posts",
    "id": 888100,
    "title": "I Need help with my desktop!",
    "self_text": "I bought a legion i5 desktop about a year ago and ervery day since then the monitor has randomly been freezing. It is a pre bult and I have changed nothing about it and it freezes even when I'm just watching YouTube on it. Advice would be greatly appreciated to solve my problem. Thank you.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T00:45:30.195029Z"
  },
  {
    "source": "posts",
    "id": 549133,
    "title": "I need someone I can reliably ask for help. Just occasional guidance/ work when I’m stumped.",
    "self_text": "Currently I have a game bare bones enough that it’s playable. It’s a tower defense. But I want to make a few more complicated changes and I can’t seem to figure them out.   If someone is able to spend a few extra minutes helping on the project, I’d be ever so grateful.",
    "subreddit": "unrealengine",
    "selected_at": "2025-09-07T00:45:49.057068Z"
  },
  {
    "source": "posts",
    "id": 995356,
    "title": "Any downside to filming ALL video in Cinematic mode on iPhone 14 Pro?",
    "self_text": "Given the new iPhone 14 Pro can record Cinematic mode in 4k at 24 fps, I'm wondering if there's any reason not to ALWAYS film in Cinematic mode.  If I later decide I don't want the Cinematic effect for a particular video, I can toggle off Cinematic mode by Editing the recorded video in the Photos app. This leaves me with the same 4k at 24 fps video I would have recorded if I didn't use Cinematic mode, right? So basically, recording in Cinematic mode leaves me with more options for later.  Is my understanding incorrect? Other thoughts? Please set me straight!  Thanks in advance for your patience with my inquiry. Cheers!",
    "subreddit": "iphone",
    "selected_at": "2025-09-07T15:34:40.061552Z"
  },
  {
    "source": "posts",
    "id": 388221,
    "title": "Upgraded PC (Xeon) not booting",
    "self_text": "Hi. I've just upgraded my computer but is it not starting anymore. Here are the specs: CPU: Xeon E5-2687W v3 Motherboard : MSI X99A SLI Plus RAM: 2x16 DDR4 2133 GPU: GTX 1660 PSU: 850W  Only my GPU didn't change since before the upgrade, rest is all new. I've also gotten a new SSD and HDD but idk if that could related to the cause. Only the clear cmos led turn on when the computer is plugged in. Holding the power button down for a few seconds make a led blink.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T15:39:25.781214Z"
  },
  {
    "source": "posts",
    "id": 944504,
    "title": "CPU Temp - I think I am a little hot - Options?",
    "self_text": "Hi Sub, I have a R9 5950 and I noticed things have gotten a bit 'hangy' of late. Nothing crazy, just some stuff takes a while to respond.  PC system health looks ok, it has been about 2 years and not done a rebuild so probably a little laggy is ok. But it's been quite bad.  So I have been running a temp monitoring tool and I am quite surprised to see my temps are hitting almost 80deg. That just seems a little hot for me.   I have a Corsair water cooled unit and I can't shake the idea that I need to repaste and reseat?  Worth a repaste? And is 80deg too hot? I think I know the answer but I am always hoping to learn.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T15:42:18.097354Z"
  },
  {
    "source": "posts",
    "id": 545201,
    "title": "Lenovo legion desktop i5 to i7 help",
    "self_text": "Tried to put an i7 in my Lenovo legion desktop. It currently has an i5. Everything is compatible but it boots into a checking media presence screen and says start pxe over ipv4 mac. Any idea on how to rake the i7 work ?",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T15:55:06.818535Z"
  },
  {
    "source": "posts",
    "id": 851781,
    "title": "Deco M4 and Virgin Hub 5 problem",
    "self_text": "I've recently had a Hub 5 delivered and previously I was using a Hub 3 with Deco M4 units which worked great  I've put the Hub 5 in modem mode and connected the Deco units but the speeds are coming in a lot worse (150 mbps).  I can’t work out what I’m doing wrong  Any help is much appreciated",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T15:55:09.083049Z"
  },
  {
    "source": "posts",
    "id": 888991,
    "title": "3090 CPU Upgrade",
    "self_text": "Hello everyone, I was thinking of upgrading my cpu. I have an intel i9 10850K but need something a bit more. What would be the best option for me without breaking the bank? Thanks! (gpu is 3090 and i have 32 gigs of ram)",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T15:58:33.144479Z"
  },
  {
    "source": "posts",
    "id": 754284,
    "title": "This is my plan for the first audio system setup. Any thoughts?",
    "self_text": "I got a lot of help in this subreddit with research to build my first audio system. Thank you all. This is the comp I decided to buy but I would like to get some advice before I jump in.  - Center: Elac UC52  - Front L/R: 2 Elac UF52s(tower speakers)  - AVR: Denon 3800H  It seems like 3800H is overkill for the Elac unifi 2.0 series. However, I'm planning to add more pieces like a subwoofer and surround system (eventually 7.1.2 or 7.1.4) and upgrade my speakers step by step.  - Does this setup make sense at all? Is the AVR still too much compared to the speakers?  - Is this setup decent for gaming experience as well assuming that I will add a surround system down the road?",
    "subreddit": "hometheater",
    "selected_at": "2025-09-07T16:46:05.176481Z"
  },
  {
    "source": "posts",
    "id": 449679,
    "title": "Suddenly restarted",
    "self_text": "Just wondering if this is normal that my iPhone 14 Pro suddenly restarted on its own. Went to open the phone and right after I swiped up to unlock it suddenly restarted. This is the first time I’ve encountered this though.",
    "subreddit": "iphone",
    "selected_at": "2025-09-07T16:46:07.864896Z"
  },
  {
    "source": "posts",
    "id": 1028051,
    "title": "Is a TI-Nspire CX II Worth it?",
    "self_text": "My birthday is tomorrow and I am wondering if I should get a TI-Nspire. I already have a TI-86 and a Casio FX-CG50. I do not know much about it but I have heard that it is very popular. I would use it for my calculus II class (and multivariable calc next semester,) and for personal calculations. I also program calculators for mathematical applications and. However, I have heard that this calculator may not be programmer-friendly. How much of this is true?",
    "subreddit": "teenagers",
    "selected_at": "2025-09-07T16:48:53.737194Z"
  },
  {
    "source": "posts",
    "id": 436093,
    "title": "RTX 3060 display disconnecting",
    "self_text": "Hello,  I built my girlfriend a PC about a year ago, and I've just recently found out that since it was built, the display tends to cut out every hour or so.   Issue   About every hour, the display will turn black as if the cable was disconnected. The monitor will receive no signal for about 2-3 seconds and then it kicks back in.   Specs   Gigabyte RTX 3060  AMD Ryzen 5 3600  Corsair Vengeance RGB DDR4 (2*8gb)  MSI B550 Tomahawk Max +WiFi  Corsair RM 750W PSU  Asus ROG 1080p@144hz Display  Windows 10 Home   Attempted Solutions   I have tried the display on a separate PC and the issue does not occur.  I have updated the video drivers to the latest version, including a clean install.  I am going to poke around in the BIOS to see if there's any settings there that might be the issue.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T16:48:56.907612Z"
  },
  {
    "source": "posts",
    "id": 675720,
    "title": "Question: Game Design - do I need to add \"complications\"? / \"depth\"?",
    "self_text": "G'Day  In the last week or so I've put together a game on my PC - which is mainly for my own personal benefit - I have no expectation that others will play it.  It's a space battle game - that shows fancy space battles being fought in spectacular fashion. I enjoy just watching the battles.  I know however that other players would probably expect more depth to the game. They might expect a proper, well structure story based campaign? Or a map campaign? Or similar.  They might expect more gameplay mechanics.  However - I like it as it is currently.  Although I know that I could add such things as described above if I wanted to.  I'm working on the assumption - which I don't want to debate here - that no one will play it, as that has  been the case with everything I've made for 30+ years. And that's fine.  &#x200B;  But - I kind of feel that I really should spend the time putting a proper campaign of some sort into the game - with either a map or a story based campaign.  &#x200B;  What do you think? Should I leave it to play simply as a bit of a 'screen saver' type idle thingy, or should I actually add a real campaign to the game?  &#x200B;  Thoughts?",
    "subreddit": "gamedev",
    "selected_at": "2025-09-07T16:49:28.301915Z"
  },
  {
    "source": "posts",
    "id": 551274,
    "title": "First pc advice",
    "self_text": "Hi all, couple weeks back I asked for advice about gaming pc’s as I’m planning on getting one for my brother (10) who’s been asking for ages. I have some basic knowledge on them but just need some advice before I pull the trigger on one really.   I found this deal and would love some input, good for the price? Is the PC good? Lacking or anything guidance would be great.  Bluetooth: Y Depth: 432 MM Dongle Required: N Intel Core i5 Six Core Processor i5-12400F - Discover the benefits of amazing performance, brilliant HD video & Graphics 8GB NVIDIA GEFORCE RTX 3050 - the latest Ampere architecture delivers unparalleled gaming performance. Genuine Windows 11 Home 64 Bit - Digital License Norton 360 inc. Game Optimizer - Free 90 Day License 3 Year Standard Warranty (1 Month Collect & Return, 1 Year Parts, 3 Year Labour) RGB Lighting - Customise your PCs lighting to your hearts desire with this professionaly manufactured PCSpecialist gaming PC WIRELESS INTEL® Wi-Fi 6 AX200 2,400Mbps/5GHz, 300Mbps/2.4GHz PCI-E CARD + BT 5.0 Graphics: 8GB NVIDIA GEFORCE GTX 3050 Storage: 512 Gb Height: 447 MM Processor: Intel Core i5-12400F RAM Memory: 16 GB Width: 217 MM Wifi Enabled: Y",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T18:16:59.169098Z"
  },
  {
    "source": "posts",
    "id": 971608,
    "title": "RDR2 can’t get more than 20FPS on a semi good Laptop on medium/high settings.",
    "self_text": "Bought the game on steam yesterday and it just doesn’t get past it.   Specs:  RTX 3050 AMD-Ryzen 74800H  16GB RAM  1TB HDD External storage  What do I do? How do I fix, I know lowering settings is advised but I wouldn’t think that I’d have to play on Low when I have more than recommended requirements",
    "subreddit": "reddeadredemption",
    "selected_at": "2025-09-07T18:17:07.574384Z"
  },
  {
    "source": "posts",
    "id": 942960,
    "title": "Advice needed please out of these 4",
    "self_text": "Hi all so with black Friday here I'm looking to buy some headphones but can't decide out of these 4. And due to health and safety can't try them on before buying which makes it a little difficult to decide. For quality of sound and bass . I also gave a Samsung phone which would people recommend and why please ?  Sony wf1000xm4 Bose quiet comfort in ear  Bose sport earbuds Beats fit pro true wireless",
    "subreddit": "HeadphoneAdvice",
    "selected_at": "2025-09-07T18:21:58.881524Z"
  },
  {
    "source": "posts",
    "id": 642378,
    "title": "stupid question about ram",
    "self_text": "Hello everyone, let me start by saying I haven't built a pc since I was a kid with my dad, I just got my first desktop in over a decade, I had to use laptops due to lack of space.  Recently got a pre built desktop and i love everything about it, except I'd like to add ram.  Can I just make sure if I get another stick  it's also 3200mhz and simply plug and play, or do I have to do something in bios.  Sorry for the wall of text and probably stupid question.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T18:23:43.337155Z"
  },
  {
    "source": "posts",
    "id": 870489,
    "title": "The calories are more accurate, as I entered my leanmass instead of my weight.",
    "self_text": "I'm at 100kg and my resting calories on the apple watch were like 2400kcal, which is waaay too much. At the end of the day the calories burned were at like 3000kcal, although I did nothing on that day.   My body fat percentage is approximately 25%, so my leanmass would be 75kg.  Now my calories are much more accurate.  Just try it out if you think the calories on your apple watch are way off.",
    "subreddit": "AppleWatch",
    "selected_at": "2025-09-07T18:27:23.095332Z"
  },
  {
    "source": "posts",
    "id": 903862,
    "title": "Worth upgrading CPU from i5-9600k with RTX3070?",
    "self_text": "My current specs are RTX 3070 i5 9600k oced to 4.8Ghz DDR4 3200 16gb  I just recently upgraded my RTX2060 to 3070 and feel a strong bottleneck from CPU (I was aware of it thats why I'm thinking about the change). I was thinking to upgrade to I7-12700k but is it worth the upgrade cost+motherboard? I'm a fps junkie and run a 240hz monitor so more fps I can pull the better. What are your opinions?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:27:36.043205Z"
  },
  {
    "source": "posts",
    "id": 626052,
    "title": "School issued Chromebook broadcasting Wifi network",
    "self_text": "My teen's Chromebook is somehow set to broadcast a wifi network, the school's. I'm sure it won't work, but why would they be set to do this, and are there any concerns I should have?",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T18:28:44.055947Z"
  },
  {
    "source": "posts",
    "id": 364530,
    "title": "Can't get my Google Account on my Pixel Watch",
    "self_text": "I've tried hard resetting my brand new watch 3 times now. I've tried resetting my password to see if that unlocked something. I can sync a random new account to it but not my decade plus old Google account. Just get a something went wrong try again later. Support has not been able to help. Any ideas?",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T18:29:21.963230Z"
  },
  {
    "source": "posts",
    "id": 354146,
    "title": "Suggestions For Dual Monitor Mounts?",
    "self_text": "I currently have one 24in monitor and was looking to get another one around Black Friday or Christmas. I want to get a decent monitor mount for two monitors so I can save some desk space. I would also prefer the months to be able to swivel so one monitor can be vertical for programming.  Thanks!",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:29:51.261607Z"
  },
  {
    "source": "posts",
    "id": 847570,
    "title": "Pixel shy after negative Pixel 6 experience. Is Pixel 7 really better?",
    "self_text": "After using iPhones for over a decade I'm wanting to switch to an Android. Last year I bought a Pixel 6 on release day and spent the next 10 months regretting it. When it worked I loved the device. Unfortunately my Pixel 6 plagued with bugs and glitches that each update couldn't seem to fix. The only issue that improved was the fingerprint sensor thanks to the March 2022 update. In July 2022 I just couldn't take anymore of this awesome yet extremely buggy experience. So I sold the Pixel 6 and bought an iPhone 13. The iPhone 13 works perfectly with no bugs or glitches, but is so boring and limiting.  Since the release of the Pixel 7, I've heard people say the Pixel 7 is the Pixel 6 fixed and best Pixel so far. I want to believe this. After all, when my Pixel 6 wasn't acting buggy/glitchy the experience was amazing. I want to make the permeant switch to Android. Specifically Google's version of Android due to the fact I currently use nearly all of Google's services. So the Pixel seems like the device for me, but I need to know this device is seriously reliable. I mean iPhone reliable. The iPhone is extremely boring, but it's also extremely reliable. Is the Pixel 7 reliable? If I buy one, will I spend the following months regretting it again???",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T18:29:55.020430Z"
  },
  {
    "source": "posts",
    "id": 480896,
    "title": "Orange DRAM Light",
    "self_text": "I updated my PC with some new parts. Replaced everything except my GPU, RAM, and hard drives. I got the PC to boot to BIOS and was messing around with the DRAM speed and changed the speed to 3600 MHz (ram is rated for 3600).  When I rebooted, I didn't get any video out and now have an orange DRAM Light on my board.   Is there a way to hard reset the BIOS since I can't get any video out? I tried reseating the ram a bunch of different ways and now have the CMOS battery out. Is there anything else I can do or is my Mobo/ram bricked?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:32:02.754818Z"
  },
  {
    "source": "posts",
    "id": 926145,
    "title": "ASUS MB, MSI GPU, Corsair RAM, one program for all the RGB?",
    "self_text": "I've got three pieces from three companies all with RGB on it, how do I control all the RBG with one program to get things to sync up?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:37:52.456790Z"
  },
  {
    "source": "posts",
    "id": 442879,
    "title": "Help me pick the parts for my bro in-law's PC!",
    "self_text": "Hi all, no stranger to building PCs, but always seem to have trouble on which parts to choose. I started down the \"Great AMD Gaming Build\" guide on PCPartPicker, but second guessed it based on some comments in that article. A few pieces of info:   Already have monitors, case (Corsair Carbide Series 400R ATX Mid Tower Case), video card (Sapphire 100352-3L Radeon HD 7950 3 GB)  He's not a PC gamer, just wants a fast machine with \"tons of RAM and power\"   What do you think?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:42:48.072374Z"
  },
  {
    "source": "posts",
    "id": 823031,
    "title": "Questions about Fans (Air cooling)",
    "self_text": "This is my first pc build, and don't know much about pc's, but i've gotten much of help from reddit posts and youtube video's to get to this,  https://pcpartpicker.com/list/JY8ppH  Im looking to buy this from amazon (maybe infiniarc's built pc's) at a budget lower than 1500 (Dollars) or 5600 (Sar) the less the better, I also don't care much about looks, and mainly concerned about:  1- What type of a good / quiet budget fans I should buy (I've seen posts saying arctic p12/p14 fans are great, but if I'm missing out on other ones be sure to tell)  2- How many fans I should have (140mm , 120mm) w/ Fan position  I think having 2 (140mm) fan on the front, 2 on top, 1 on rear are too many fans for a low-mid ranged pc.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T18:43:33.029279Z"
  },
  {
    "source": "posts",
    "id": 989237,
    "title": "Help me with an espresso machine",
    "self_text": "Hi, I am trying to decide on an espresso/grinder set up. I wonder if I can get help here.   Background: I drink one cup of latte drink every day and so does my husband. Sometimes from Starbucks/Peets and other times from a home Nespresso machine. We are not very happy with either. It just does not taste as good as it did in Italy. We like medium/dark toast and don't care for the acid flavor.  My question: If Starbucks with a much better machine can't produce a satisfactory espresso, will a home machine really perform better? I imagine they use high-quality grinders and freshly grind their beans daily. It is because they use lower-quality beans? I found it very puzzling.  My next question: I am eyeing Rocket 58 because I like the looks in its price range. Coming from Nespresso I know I have a lot to learn. Paring with Niche, is it a good setup?  Thank you very much!",
    "subreddit": "espresso",
    "selected_at": "2025-09-07T18:45:43.827004Z"
  },
  {
    "source": "posts",
    "id": 902658,
    "title": "What is once flaw about every gaming mice that you have owned?",
    "self_text": "Besides shape. What is missing from the current gaming mice industry? I am asking this cuz I am going to start a buisness",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-07T18:46:44.600347Z"
  },
  {
    "source": "posts",
    "id": 288503,
    "title": "is an i5 13600 + 3070 a good combo?",
    "self_text": "Im planning on building a decent gaming pc ranging from $1200 to $1400 and was wondering if these would be a good combo for gaming in 1440P with reasonable fps. (60+ on RDR2, Cyberpunk, 120+ on apex/fps) or is it worth waiting for the upcoming 4060?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T18:46:58.695919Z"
  },
  {
    "source": "posts",
    "id": 638521,
    "title": "Good versatile headphones for piano/drums",
    "self_text": "Hey everyone,  I am purchasing my first e-drums this month (probably a Roland TD-07dmk) and I'll be needing headphones. Thing is, I also have a piano, a Roland FP30, and it would be nice if I could find a pair that I could use for both. My budget is around 90 us dollars. I am purchasing this in Brazil, so smaller brands might be harder to find...  Thanks a lot for the help guys!",
    "subreddit": "HeadphoneAdvice",
    "selected_at": "2025-09-07T18:57:22.495447Z"
  },
  {
    "source": "posts",
    "id": 482256,
    "title": "Building pc’s",
    "self_text": "I’m currently in CC for free with a full time scholarship and with it I get $500 for participating in 5 school activities in a semester, $125 for completing a semester, $700 for school supplies/books and including my FAFSA which I got $1875 from it. So I really want to put this money to use. I started reselling sneakers around the end of my junior year of high school starting off using my dads money which I made a good amount on but it’s very difficult to even buy shoes. I been recycling for a couple years now still am, but its only a small amount. Ive been stuck with this gaming pc that I had since freshman year and been wanting to upgrade forever. I been using it as a casual pc because it literally cannot run games anymore. As Im looking around marketplaces for a gaming pc I realized that some sellers build pcs and sell them. I thought that is a great idea for a hustle since pc is the future of gaming and because I am not allowed to work due to my FAFSA, I as well do not want to keep asking my dad for money. I have gas, wrestling club, gym, and mma memberships to pay off, especially once im done with cc I have to transfer to a university so I may have to start using my own money. I also want to build/buy a new pc for myself to play with my friends again. Now my questions are Is this a good hustle to have?  If no, why?  Where do I learn about pc’s? How should I start?  Is there anything else that I should be aware of?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T19:10:31.531029Z"
  },
  {
    "source": "posts",
    "id": 990973,
    "title": "Help-a-noob?",
    "self_text": "looking to build, but don't know a damn thing about it. obviously i'd need a website where i can custom build one, but also a site with some sort of adviser who can recommend options without grossly overselling me something i may never need. am i crazy in thinking a site like this exists? if so is there a favorite?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T19:11:34.002938Z"
  },
  {
    "source": "posts",
    "id": 867108,
    "title": "Do you recommend this monitor for a 6800xt?",
    "self_text": "I am building a new pc rig ,  upgrading from a G15 5511 3060 laptop ,  this monitor looks nice on paper but my concern is:  Ive been looking at benchmarks and the 6800xt excels at 1440p but the 4k experience is ok-ish , around a 30 fps experience in 4k , which is fine to me (ive played on consoles all my life) .  https://www.newegg.com/p/N82E16824475253?item=N82E16824475253  I wanted to get this monitor , but my question is , can i set the resolution to 1440 if i want to play at 60 fps?  Since this is a 4k monitor i dont know if i can downgrade the resolution depending on the game , and do You recommend this monitor on a 6800xt?   My new rig specs are:  i7 12700k 16 gb ram ddr4 3200 6800xt 16 gb",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T19:15:05.653358Z"
  },
  {
    "source": "posts",
    "id": 858717,
    "title": "Advice request Asus VS MSI GPU choice",
    "self_text": "Hey all,   Looking to replace my graphics card I currently have an MSI GTX 1060 6gb in my desktop. I am currently looking at the ASUS Dual GeForce RTX 3060 12GB GDDR6 PCI Express 4.0 Video Card DUAL-RTX3060-O12G-V2 and the MSI Ventus GeForce RTX 3060 12GB GDDR6 PCI Express 4.0 Video Card RTX 3060 Ventus 2X 12G OC.  &#x200B;  Looking at the spec they seem 100% identical, but there is about a 75$ diff average btwn the two (asus being more)  Now I wonder if yall might have some advice here as to which might be better I don't mind spending the little extra if theres a good reason, as far as i can tell tho the only difference is asus has an overclock speed whereas the msi doesn't but I know there stuff typically can always be OC'd  &#x200B;  Which would you go with if you were me?   Games i play typically are like destiny 2, doom eternal  stuff like that",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T19:19:41.775149Z"
  },
  {
    "source": "posts",
    "id": 620229,
    "title": "Computer won't start. How fucked am I?",
    "self_text": "The PC won't start properly. Has anybody experienced something like this?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T19:42:29.599001Z"
  },
  {
    "source": "posts",
    "id": 615718,
    "title": "Cheapo build gaming lite PC",
    "self_text": "My 12 yr old daughter is into Roblox etc and has to use my work PC to game as her laptop wont run it. She has also shown some interest in building her own PC. I have built many PC's but not for a while.  I'm thinking of buying the components and helping her build it as more than just a present, but an experience.   Does anyone have any suggestions on a MB/CPU combo that would be cheap enough to get started.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T19:44:55.373363Z"
  },
  {
    "source": "posts",
    "id": 759317,
    "title": "Deco M9 Plus - What Am I Missing?",
    "self_text": "I'm a bit new to home networking, so please excuse me if I'm missing something obvious here.  I pay for 750mbps internet speed and I have a Deco M9 Plus mesh system set up. My main Deco is on the first floor, wired via ethernet to the modem in the basement. My 2nd Deco is in a room on the same floor, only about 40 feet away, and the 3rd one on the second floor essentially right above the main hub.  I get really good speeds when I'm in the same room as the main Deco, but the drop off to the 2nd one (on the same floor) is crazy. I only get about 15mbps, per a speed test. It's almost like the 2nd Deco isn't doing anything at all, and I'm just connected to the main hub. The speeds in the bedroom with the 3rd Deco are good, but I'm assuming it's because it's right above the main hub.  Did I not set everything up properly? Again, it's almost like the additional Decos aren't doing anything at all.  I can confirm I'm in Router mode with Fast Roaming turned on. Thank you for any help!",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T19:48:14.161707Z"
  },
  {
    "source": "posts",
    "id": 405006,
    "title": "Ryzen 5600x Future Build",
    "self_text": "Hi all,  &#x200B;  Looking to build my first PC (build link here) and after a few solid weeks of research, this is looking like the final product. I'm a bit nervous about getting some parts wrong so if anyone could clarify:  &#x200B;   The website I'm using is saying that the motherboard BIOS may need to be updated, but after researching it looks like that shouldn't be an issue if I buy a new one.  The case I have chosen should be able to fit a full ATX motherboard and the GPU.  The website is saying that the estimated watts used is 378 so a 750w power supply is more than enough even with other peripherals.  This PC will mainly be used for gaming and should have no trouble running games at 1440p with high settings.   Thanks for any advice you have!",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T19:48:15.306129Z"
  },
  {
    "source": "posts",
    "id": 917596,
    "title": "Need help finding gaming pc",
    "self_text": "Wondering if anyone can tell me what they think the best gaming pc you can get on Amazon with my budget no more then 1100",
    "subreddit": "gaming",
    "selected_at": "2025-09-07T19:51:27.740459Z"
  },
  {
    "source": "posts",
    "id": 917491,
    "title": "Would USB-C to DisplayPort adaptors bottleneck my GPU?",
    "self_text": "working on a somewhat unconventional build inside a briefcase that would use USB-C monitors. If I used DisplayPort to USB-C adaptors, would the monitors be able to be powered and ran off of them?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T19:52:31.883736Z"
  },
  {
    "source": "posts",
    "id": 800431,
    "title": "Upgradable PC for future",
    "self_text": "Hello, I was planning to get myself new setup after a while however I am extremely rusty when it comes to knowledge of current trends and specs in components.  The idea is next. I was planning to get a functional setup now which could be upgraded and expanded in future. The idea was to get iGPU like Ryzen 7 5600G, good MOBO and some speedy RAM (around 16GB at start). Later on hopefully GPU prices should drop so I could get a better deal in future.  What is your opinion on the idea? Would you prefer to get separate GPU + CPU combo now and think iGPU isn't worth it?",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T19:53:10.979311Z"
  },
  {
    "source": "posts",
    "id": 268527,
    "title": "How to cast (not mirror) from Android to Mac OS? Airplay equivalent",
    "self_text": "Wanted to watch a bunch of HD movies located in my phone, on my work MacBook pro since it's a better screen. I do not want to transfer them.   My android phone has native casting and the apps that use to watch videos (MX/kmp) also have native casting.   Question is how to make the Mac recieve it, is there an app? Tried X-mirage but it worked only for screen mirroring, which I'm not looking for.  Open to install apps on Mac/Android as long as it is free and seamless.",
    "subreddit": "mac",
    "selected_at": "2025-09-07T19:53:27.346397Z"
  },
  {
    "source": "posts",
    "id": 402425,
    "title": "does anyone here use speakers for gaming?",
    "self_text": "I'm looking to buy a decent pair of speakers for my PC I was wondering does anyone here use speakers for gaming I'm generally fed up with headphones as they are uncomfortable for me personally I'm also not interested in generic PC speakers I feel they don't sound good enough.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T19:55:20.756022Z"
  },
  {
    "source": "posts",
    "id": 958745,
    "title": "PC won't POST with CPU installed!",
    "self_text": "So, I have a PC that has been working fine for almost 2 years now. One fine day, I turn it on and nothing works. No power, nothing. I did notice the system time was incorrect the last time my PC booted up, so I was hoping that replacing the CMOS battery would work, but alas, clearing the CMOS and replacing the battery didn't help either.  &#x200B;  Obviously I had to strip everything and do breadboarding to check each component. I tried updating the BIOS using USB Flashback and that seemed to go through. Next, with nothing on the MoBo, I tried booting it up. It booted up fine, with the CPU Debug light on.  Now, when I install the CPU and try to turn on, nothing gives? No power, no debug LED, nothing!   I've also tried plugging everything back in to make sure it's not missing any component, but I still see no power. The only time there is any sign of life on the MoBo is when I take out the CPU.  &#x200B;  Do you reckon my CPU has died on me? Or is this a motherboard failure?   Thanks for any help!  &#x200B;  Specs:  Ryzen 5 5600X  RTX 3080  8x2 3200Mhz RAM  B550 Gaming Edge WiFi motherboard",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T19:57:19.703886Z"
  },
  {
    "source": "posts",
    "id": 607032,
    "title": "13 Pro Max vs. Samsung s20+",
    "self_text": "So I just transitioned from the Samsung s20+ to the iphone 13 Pro Max, and I have to say that I am kind of disappointed. I switched because I was having difficulties getting Uber to work, along with some other apps, and since I work close to mobile infra engineering I know that there is far more investment in iOS vs. Android. I had an iphone a few years ago but was surprised at how much had changed since my last phone. This seems like a supercomputer compared to the Samsung running Android, however, it is almost too much. The Samsung was easier to use and just simpler over all, plus I'm shocked at how bad the screen is on the iphone. The Samsung screen is far and away better. It is sharper and the colors are way more vivid. The colors on the iphone are so pale and sad. In addition to the screen, I cannot for the life of me get the Do Not Disturb/Focus thing to stop turning itself on. Moreover, when I go to the Focus control in Settings, there isn't an easy way to turn it off. It is maddening! I'm not wondering if I should send the iphone back and just stick with the Samsung which is so much easier to navigate. Sigh.",
    "subreddit": "ios",
    "selected_at": "2025-09-07T20:03:51.731034Z"
  },
  {
    "source": "posts",
    "id": 628614,
    "title": "New Pixel Watch Update begins rolling out",
    "self_text": "Here are the details. Note, this is an app update, so you'll have to go into the Play Store to update it. Also, the update will be rolled out over the next few weeks and can't be forced like you can on your phone, so you may not get it right away. Just be patient.",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T20:03:52.997945Z"
  },
  {
    "source": "posts",
    "id": 852730,
    "title": "Work Laptop Thinkpad T480 - Battery 1: 0%, Battery 2: 49%. Not charging. Anything I can do to avoid getting a replacement?",
    "self_text": "As titled, my batteries no longer charge but the laptop remains fully functional when plugged in. Sometimes it will immediately die when disconnected from the power, sometimes it won't. That's weird.  I've troubleshooted by trying multiple chargers including a Targus Dock and a 65w portable charger.  I've removed the battery and pressed the emergency reset button which was a possible solution found by googling, but unfortunately that didn't resolve it.  Because my laptop is all set up just right, I really don't want to report this to IT and have them take the easy route by replacing it. I'm far too busy at the moment to be dealing with that hassle! Therefore I'm hoping for some advice in here. Could it be the charging port? Would I just need a new battery? Is the CMOS battery responsible (seen this mentioned in my searches and I'm skilled enough to change it but would rather avoid opening the laptop up unless I have to).  Any help is gratefully received, even if it's a way of me proving to IT that it's something easily fixable so I can keep this specific laptop.   Thank you",
    "subreddit": "thinkpad",
    "selected_at": "2025-09-07T20:45:51.329398Z"
  },
  {
    "source": "posts",
    "id": 611180,
    "title": "What parts should I upgrade next?",
    "self_text": "I built my pc about 2 years ago and I'm starting to feel a little slow since I am getting into gaming a bit more. I play MW2 and Overwatch 2 mostly but am looking for more frames in COD. This is why I think I need a graphics card upgrade but am unsure if that would also me to get things such as a bigger Power unit, Cpu, or Ram.   AMD Ryzen 5 2600 Six-Core Processor  3.40 GHz  Zotac rtx 2060  Thermaltake SMART 600W ATX 12V Power supply  Asus Rog Strix B450-F Gaming motherboard  16 Gb DDR4 Ram  I'm looking to upgrade to a RX 6750 XT as there's one on Amazon for 410 right now. Is this a good upgrade? Would I get significantly more frames at 1440 fps and will it last. I do not care about Ray-Tracing but am open to Nvidia cards if I am proven that the higher price point for the 3070 or 3070ti is worth it.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T20:45:53.552552Z"
  },
  {
    "source": "posts",
    "id": 960257,
    "title": "Scripts functionality",
    "self_text": "I took the Unix principle at heart for many years. Even when I was managing windows servers.   I have always created small scripts that do one thing only and I had a script for each need.   At this point I have to resolve an issue that requires a lot of programming (web scraping, ssh, scp, run commands on multiple devices, parse the output, etc)  I need to have it in one file / script because other people will need to use it. I decide to create a cli program. I write one function for each functionality.   That raise a couple of questions:   what you prefer smalls scripts that serve one purpose only or bigger solutions that resolve a multitude of problems?  How do you deal with global issues that involve many parties? Do you try your best or do you say out of my pay grade?    Thanks in advance for your insights .   Edit:     I know Bash, GO, Lua, PowerShell and Python.   Existing infrastructure is in Python/Bash.  All involved systems run different versions and distribution of Linux.   I decide to write the script in Python.",
    "subreddit": "sysadmin",
    "selected_at": "2025-09-07T20:46:00.995589Z"
  },
  {
    "source": "posts",
    "id": 286698,
    "title": "Clock Alarm Settings",
    "self_text": "Did something change to the display of the basic clock app alarm function? I recently upgraded from a P5 to the P7. I've always used the clock Alarm and it would be full screen so I could swipe to snooze or stop the alarm. With the P7, I get a very small pop-up on the top of the phone with a button to click to stop or snooze. It also no longer sends my screen back to the screensaver after I snooze. I've tried to find a setting to revert back to Fullscreen, but I have not had any luck. Can anyone help me 😆",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T20:46:03.065264Z"
  },
  {
    "source": "posts",
    "id": 725876,
    "title": "best 16gb ram kits",
    "self_text": "title, and make sure they are compatible with xmp with no problems and also be a good a match for i5 12400f im looking for more budget ones around 60-75 us dollars. i like rgb but dont mind no rgb if its the better option in that case.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T21:03:07.857410Z"
  },
  {
    "source": "posts",
    "id": 952489,
    "title": "Best possible computer specs for a $2,000 - $2,500 budget?",
    "self_text": "I’ve been looking to build a new computer and finally saved up enough money. Since I am not too good with computer building, does anyone know what parts I should get for my budget or where I could find them?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T21:04:39.342791Z"
  },
  {
    "source": "posts",
    "id": 1002572,
    "title": "Re-Setting up PS5",
    "self_text": "Just got a PS5 for myself and my wife. We have such spotty internet as of now and long story short, we made a profile to get started and started playing a game from a disk we’d had, and logged into the PlayStation account later, which made another profile. I accidentally started a downloaded game on the local profile and made a decent bit of progress I don’t want to lose. My question is, if we log out of the PS account, and log back in on the local profile with our progresses, will the progress be reset to what it was on the other profile?",
    "subreddit": "playstation",
    "selected_at": "2025-09-07T21:10:15.354632Z"
  },
  {
    "source": "posts",
    "id": 351811,
    "title": "Connecting a 3 SATA cable",
    "self_text": "My psu has came with SATA cables, 2 of them being the same type. They have 3 sata power connectors on it. I only need to use one. Would it be okay to just use one connector and leaving the other two unplugged?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T21:11:20.894975Z"
  },
  {
    "source": "posts",
    "id": 469303,
    "title": "PC Case with no top I/O or airflow",
    "self_text": "I currently have a work provided Dell XPS mounted under my desk using a PC hanging strap kit and I love having it there. I intend on building a PC soon though and I'd like to keep the PC where it is at. What is a good ATX solution with no top airflow and all of the front I/O on the front of the case and not the top?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T21:19:27.304816Z"
  },
  {
    "source": "posts",
    "id": 847187,
    "title": "My battery health dropped %5 in a month after upgrading to iOS 16",
    "self_text": "I have an iphone 13 Pro Max was bought in november 2021. Up until now, the battery health was quite good and showing %97. Now after upgrading to the iOS 16 i felt it drains faster and today i saw the battery health is now at %92. How come? I’ve been using belkin 7.5 Watt magsafe wireless charger since last summer.",
    "subreddit": "iphone",
    "selected_at": "2025-09-07T22:12:20.441862Z"
  },
  {
    "source": "posts",
    "id": 782786,
    "title": "I recently upgraded from a rtx 2060 to a 3080TI. After installing the 3080 TI, the middle fan is making this loud noise. I made sure nothing is touching the fan. This is off of the first boot of the day too. Ignore the bad cable management, I wasn’t sure if i was going to have to send this back yet.",
    "self_text": "Title and a few other things to note.  When I first turned it on, the middle fan didn’t spin at all, even under load. I saw a suggestion to try and spin the middle fan while the PC is off so I tried that and now it spins. However it makes this noise now.  I’ve had weird issues in games too like more frequent crashes. Also I played halo infinite yesterday and the temp went up 82 degrees. I figured this was unusually hot so I shut it off until I can get other opinions on it. Another thing is that I expected even a slight performance boost over my 2060. I know it wouldn’t be a huge jump because my CPU is still bottlenecking it but the performance seems pretty identical to my 2060. On top of that, everytime I open a game, it has a “very high power usage” in the task manager. Also the gpu usage would spike randomly to like 20% even while idle.  I bought it from amazon about 2 weeks ago and got around to installing it yesterday. I have a month to return it. Should I just return it to amazon or contact MSI?  Motherboard: MSI B550 Tomahawk CPU: Ryzen 3600 (i have a 5900 but haven’t had the time to install it yet) New GPU: MSI RTX 3080 TI Gaming X Trio Power supply: EVGA 850w gold  Here is the video: https://cdn.discordapp.com/attachments/780233666437185556/1043974120112656404/IMG_9774.mov",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T22:14:04.521743Z"
  },
  {
    "source": "posts",
    "id": 346452,
    "title": "Can Ryzen 7 3800x and 3070ti together not cause overheat?",
    "self_text": "Okay so I was just researching on the internet to see the possibility of hardware replacement in the future. I have a Ryzen 7 3800x CPU and a 5700xt Sapphire Pulse card. And I found out that the perfect match to my R7 processor is a 3070ti or 3080 card. So I have 3070ti saved in my amazon list, but before I finalize my decision I need to know if my R7 cpu and 3070ti won't cause any overheating like the 5700xt has been doing the last couple of months. I was hoping this ends my overheating problem.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T22:44:16.619276Z"
  },
  {
    "source": "posts",
    "id": 980775,
    "title": "High Upstream Power Levels",
    "self_text": "If my 8x4 modem has been posting 51-54 dB upstream on all 4 channels, is this something I should take action for? It's been like this for a couple months now when I checked my diagnostics page after a legitimate ISP outage I was notified about. Power Level is between 0-2dB and SNR 38dB. I haven't had any connection issues and would like to prevent losing my internet and having to call Comcast, a company that thinks a 3 day wait for a technician is acceptable, but I don't want to get charged because \"I see nothing wrong here.\" Usually the upstream power level is 48. I was under the impression anything over 51db is awful.  In the past every time the upstream power levels spiked I had constant connection issues, but it would swing +/-5 constantly, this seems to be stable which puzzles me.",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-07T23:04:01.208867Z"
  },
  {
    "source": "posts",
    "id": 647809,
    "title": "What do YOU put on your nvme SSD?",
    "self_text": "Recently I discovered nvme SSD’s and their speed compared to SATA SSD’s. I already own 2 Samsung SATA SSD’s. 1tb and 500gb.  I’m not short on storage space at the moment, but it did make me think.  What kind of storage benefits from an nvme SSD? For instance, is it certain types of games, certain types of programmes, etc.   What have you got stored on your nvme SSD?   Perhaps black friday offers a good deal on an nvme SSD and I might just go for it if it offers me a benefit.  Thank you in advance!",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T23:05:58.015463Z"
  },
  {
    "source": "posts",
    "id": 846225,
    "title": "VirtualBox 7: \"restore snapshot\" option gone in shutdown menu",
    "self_text": "In VirtualBox 7 is there anyway to get the \"restore snapshot\" option back when closing a VM? It used to be there in previous versions. Now the only options during machine closure are \"Save the machine state\", \"Send the shutdown signal\" or \"Power off the machine\".",
    "subreddit": "linuxquestions",
    "selected_at": "2025-09-07T23:06:11.161704Z"
  },
  {
    "source": "posts",
    "id": 889222,
    "title": "On the low end of AM4, should I upgrade to AM5 now with Black Friday Sales or wait?",
    "self_text": "Quick overview of my system:   Motherboard - X470 M7AC  CPU -  5600x  GPU - 3060ti  RAM - 32gb of DDR4 @ 3000mhz  Memory - 1tb of SSD, 2tb of HDD  Been looking at Black Friday Deals and considering if its worth for me to upgrade to AM5 and replace my Motherboard, RAM, and CPU. Doing so will total out about ~$750 based on the deals I found so far. The price isn't too much of a concern for me but I just want to know if its even worth considering the parts I already have. I've seen some people with similar specs to mine say they're gonna skip out on AM5 but they're on the slightly higher end of AM4 with 5800x's and 3080's. I do play on a 360hz monitor w/ GSYNC on so I would like to maximize it to it's fullest but if I won't get that much of an upgrade in most modern games I probably won't bother. Or should I just stay in AM4 and maybe upgrade my CPU and call it a day and wait till AM5 is cheaper?  TLDR: On low end of AM4, do I upgrade to AM5 or just wait? Or should I upgrade to higher end AM4?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-07T23:07:12.451104Z"
  },
  {
    "source": "posts",
    "id": 699182,
    "title": "Monitor setups.",
    "self_text": "Just a random question and thoughts from others. I have a pretty beefy PC, i9900 cpu, 32gb ddr4, rtx 3080 founders edition.  Currently I’m running a 27” 2k 144hz monitor for my main display. Then I have two 22” 1080p 60hz side monitors.   My question is. I would like to upgrade the two side monitors to be higher HZ, would getting another 2 2k monitors be too much for my pc to handle. Could I make the two side monitors downscale to 1080p and have the high hz? I basically have a pretty cheap way to get the same monitor I use as my main display. Just wondering if that would run well. Thanks everyone.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-07T23:08:41.417470Z"
  },
  {
    "source": "posts",
    "id": 895863,
    "title": "How much could two old ps3's sell for?",
    "self_text": "I am not selling them here, but how much could they fetch for on Craigslist since they are pretty much old hardware and no one's really playing on these systems anymore AFAIK.  Would it even be considered in the $50-100  range?   Am I better off waiting a few more year to sell it as an antique to some game collector?",
    "subreddit": "ask",
    "selected_at": "2025-09-07T23:13:59.992339Z"
  },
  {
    "source": "posts",
    "id": 911114,
    "title": "Pixel 7 Promos - Verizon",
    "self_text": "Has anyone had luck trading in a Pixel 3 for the Pixel 7/pro? I've heard many reports that people had previously been able to trade in the P3 (or even p2) for a free Pixel 7, and now that doesn't seem to be the case. It appears I waited 3 weeks too long to trade.   The best Verizon promo I can seem to find is $400 via 36 months of promo credit (ick) - 24 months is no longer an option.   Has anyone seen anything better?",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-07T23:15:53.190211Z"
  },
  {
    "source": "posts",
    "id": 823302,
    "title": "ELI5 How do videogame or software developer find bugs?",
    "self_text": "Especially on videogames. Do they really have play tester that try to do everything in the game? Imagine that would took quite some time",
    "subreddit": "explainlikeimfive",
    "selected_at": "2025-09-07T23:16:18.030001Z"
  },
  {
    "source": "posts",
    "id": 1016445,
    "title": "High cpu temps",
    "self_text": "I'm running a ryzen 9 3900 with an aio. I keep getting Temps of 100-106c and my computer shutting down playing mw2. I have removed and reapplied thermal paste and it helped a little but still getting Temps 100-103. In my bios I have aio rpm indication. Can anyone provide further guidance on where to look next?",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-07T23:16:28.749966Z"
  },
  {
    "source": "posts",
    "id": 582665,
    "title": "Parts check for my friend",
    "self_text": "My friend asked me for help with his first build, and I helped him pick out a list of parts, and I wanted to check with people more experienced if it’d work or if there’s a recommended alternative.  Parts list:  CPU: AMD ryzen 5 4500 MB: MSI B450M Pro-M2 Max micro atx am4 Memory: Corsair vengeance lpx 16 Gb (2x8) Storage: crucial BX500 1 TB 2.5” ssd GPU: msi geoforce gtx 1630 ventus xs 4G OC Case: NZXT H5 10 ATX mid tower PS: corsair TX550M gold 550 W 80+ semi modula WiFi adapter: TP-Link WiFi 6 AX3000 PCIe WiFi Card  Thank you in advance!  Edit: his budget is to stay under $800",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T13:40:19.354588Z"
  },
  {
    "source": "posts",
    "id": 600431,
    "title": "Any thoughts on this build?",
    "self_text": "Im currently building a ,,dream pc'' but i was never into hardware so with some help of youtube reviews and different forums I have managed to set up this build. I ask you guys for thoughts and advices of what can be changed for something better from the same price range and save me from making huge mistake (if any of those are shit). Here are all the parts:   CPU   1x  Intel® Core i7-12700K, 3,6 GHz (4,9 GHz Turbo Boost) socket 1700 processor  € 449,00    MOTHERBOARD   1x  MSI MAG Z690 TOMAHAWK WIFI DDR4, socket 1700  € 313,00    CPU COOLER   1x  Noctua NH-D15 chromax.black  € 119,90    GRAPHIC CARD   1x  GIGABYTE GeForce RTX 3080 Gaming OC 10G  € 949,00    RAM   2x  G.Skill 16 GB DDR4-3200  € 158,90    MEMORY   1x   SSD:  SAMSUNG 980 PRO, 1 TB SSD  € 154,90   1x   SSD:  SAMSUNG 980 PRO, 2 TB SSD  € 279,00    CASE   1x  be quiet! PURE BASE 500DX  € 119,90    POWER   1x  be quiet! Straight Power 11 Platinum 850W  € 179,90    SYSTEM   1x   Windows:  Microsoft Windows 11 Home",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T13:41:32.802979Z"
  },
  {
    "source": "posts",
    "id": 499495,
    "title": "Rate My Build / Liquid vs Air",
    "self_text": "My current custom PC is around three years old and the flashed RX 5700 regularly sounds like an airplane taking off; it's time for an upgrade! This started out with doing a price check on the components of some popular prebuilt systems, as a family member told me they saved money by buying prebuilt; my cynical self wanted to prove that all the hours I've spent building my own computers weren't wasted.  So, without further ado, here's my build: PCPartPicker Build  I'd love any feedback - is the CPU overkill? An AIO CPU cooler is listed, but I'm toying with the idea of building my first open liquid loop, as I figure I'd want liquid cooling on my GPU if I'm going to bother at all. So, lovers of air and liquid, I'd appreciate your thoughts on what makes sense. Thanks in advance!",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T13:42:41.680279Z"
  },
  {
    "source": "posts",
    "id": 454568,
    "title": "Formatting a laptop with broken screen",
    "self_text": "Im trying to upgrade my laptop hdd to an ssd, my problem lies in formatting it as I don’t have access/ can’t see the bios to be able to install windows since an external monitor only displays when it reach the login page on windows.  My Laptop is rog g56jk, the screen is busted. Other than that everything is fine.  Workarounds done: I already tried using VGA or hdmi to be able to see the actual start of the PC to access bios, Removed the screen so it forces to recognise that there is no screen, but still doesn’t do, my current setup is everything is exposed since i kept the screen disconnected. Tried cloning the hdd for some reasons it always fails or says success but doesnt really work, i think the hdd has bad sectors ald.  Please help.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T13:44:32.801798Z"
  },
  {
    "source": "posts",
    "id": 903498,
    "title": "Is The Gigabyte M27Q-P Discontinued?",
    "self_text": "I've been lookin at the M27Q-P from gigabyte for a while now as my first monitor to jump over to 1440p, but I've noticed it's literally out of stock everywhere? Has it been replaced by something else I'm not aware of, or is it just done?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T13:45:00.122866Z"
  },
  {
    "source": "posts",
    "id": 987758,
    "title": "Best Band to Get \"Official\" From Apple?",
    "self_text": "I'm probably getting my first Apple Watch today and I'm trying to decide which band to get. I anticipate that I'll probably end up getting a bunch of third party bands, but is there a band that Apple really does better than the knockoffs?  Edit: Thanks for the comments. Went with a Nike Sport Loop!",
    "subreddit": "AppleWatch",
    "selected_at": "2025-09-08T13:45:30.910943Z"
  },
  {
    "source": "posts",
    "id": 792673,
    "title": "Durable daily use headphones?",
    "self_text": "My SHP-9500s are a little bit broken and I was kinda wanting an upgrade anyway, so are there any nice comfortable open backs that will last a few years of being thrown in a backpack or slept in? They need to be open back, have thick ear pads, and have a detachable cable, and my budget is $250 max, cheaper would be nice. It would also be nice if they were low resistance so that the battery in my Bluetooth DAC lasts longer.",
    "subreddit": "HeadphoneAdvice",
    "selected_at": "2025-09-08T13:45:32.991020Z"
  },
  {
    "source": "posts",
    "id": 430590,
    "title": "480s Touchpad compatible with T480?",
    "self_text": "Hi fellow thinkpadders, I own a t480 and my touchpad peeled and scratcjed off too much to be useful. My local repair shop has a t480s touchpad, will it work as a drop in replacement?",
    "subreddit": "thinkpad",
    "selected_at": "2025-09-08T13:48:39.442422Z"
  },
  {
    "source": "posts",
    "id": 1051803,
    "title": "Firecuda 530 500gb",
    "self_text": "Hi. I finally decided the ssd to buy.  I chose the firecuda 530 500gb ssd.  Should i buy it with the factory heatsink or one without the heatsink and they buy an aftermarket heatsink? It will be used mainly for heavy writing on it.  Thanks",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T13:49:32.287919Z"
  },
  {
    "source": "posts",
    "id": 406815,
    "title": "Copying photos from the photo app in mac",
    "self_text": "Hi All,  I have a question, how do i copy photos from inside photo app in a mac?  When right clicked i dont see an option of copying, am i missing something. Can someone please help me here?",
    "subreddit": "mac",
    "selected_at": "2025-09-08T13:51:39.268597Z"
  },
  {
    "source": "posts",
    "id": 1046060,
    "title": "How would I write code that scrapes the address from a block of text/webpage and automatically inputs the data in the relevant fields (name, street name, street number, postcode, etc) on a delivery website? (DHL/FedEx)",
    "self_text": "I have no idea how to go about making something like this, or even if there's software that'll do it for me. But I think it would be a fun project to try and develop something like this if it's not too hard for a complete beginner.   So, how would I begin? What coding language would you recommend? Is there a tutorial you could point to for something like this?  Thanks!",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-08T13:54:22.810330Z"
  },
  {
    "source": "posts",
    "id": 732894,
    "title": "New GPU Running Hot?",
    "self_text": "Just upgraded from a 3060ti to a 3080. I bought the 3080 used online, with a 30 day return window. It came looking completely clean, and honestly looks like it was brand new and returned. However, I'm definitely noticing that it seems to be running way hotter than my 3060ti did? For example I'm playing dishonored 2 and it's hovering around 80-81 degrees Celsius. MW2 it's hovering around 83 degrees. The fans are also extremely loud compared to the 3060ti. How can I know if there's something wrong with this used GPU? Or are loud fans and higher temperatures normal for the 3080.. For what it's worth the card is definitely performing much better than the 3060ti in terms of FPS. I'm kind of new to upgrading my PC so any help is appreciated.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T13:54:28.143598Z"
  },
  {
    "source": "posts",
    "id": 814881,
    "title": "GTX 970 just died, need a decent replacement for the new few years",
    "self_text": "My PC unexpectedly shut down earlier today and won't turn on unless I remove the graphics card, so I'm guessing it's caput. The rest of my build is all >6 years old (specs below). I am in the process of saving up for a full rebuild, but that's likely at least 2 years away so I'm needing a suitable replacement that will get me that far, preferably beyond.  I don't tend to play that many recent titles, so my GTX 970 had been doing well enough. When it died I was playing modded skyrim at 4k, 40-60fps, which is fine by me. I'm basically happy with a card that can handle stuff like dark souls 3, subnautica, the RE2 remake at similar framerates and resolution, though if it could also cover more recent games that would be good too.  The rest of my build is:   Z75 Pro3 LGA 1155 motherboard pcie3 graphics card interface  Not sure of the CPU, an i5 of some kind, probably 8 years old  EVGA 750W G2 PSU  2x4GB Corsair 1866Mhz RAM   For a new graphics card, I was thinking either the RX 6650 XT (or this one, I'm not sure what the difference is), or splurging a bit more on the RX 6700 XT. AFAIK my PSU is good enough for these.  What do you think? Are there better cards I am missing? Should I aim to buy on Black Friday or are the saving illusory? Thanks in advance.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T13:59:19.260143Z"
  },
  {
    "source": "posts",
    "id": 730498,
    "title": "Printers are evil, but need help on a proof of concept",
    "self_text": "My idea:   Our company has 18+ sites, sometimes people migrate from one location to another without our knowing, and there is a change in AD through our third party service that HR makes changes in. However the devices have to be manually moved to Site OUs and they get printers that way, could there be an automation setup to move these devices to the site OUs after a change from HR.   &#x200B;  So my proof on concept:  -Dynamically assign printers based on device location in the OUs (already setup as GPOs and this works)  -Dynamically moving Devices to the proper OU based on X field/change on the User OU (This is not setup, and I am unsure how to have a device tied to a person in AD).   The devices are not directly tied to the person. Was contemplating a PS script that senses IP address subnet on login and migrates the Device to that locations OU. Certain I'm over thinking this, just seeing if anyone in the community has designed or setup something like this.  I will add more information if requested.",
    "subreddit": "sysadmin",
    "selected_at": "2025-09-08T13:59:30.297164Z"
  },
  {
    "source": "posts",
    "id": 326766,
    "title": "Arctic liquid freezer ii 240 vs Cooler Master Masterliquid ml240l v2 ARGB",
    "self_text": "For the CPU it will be for a 5 5600X",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-08T14:00:21.729803Z"
  },
  {
    "source": "posts",
    "id": 771607,
    "title": "Big Hands Wireless Gaming Mouse Problem",
    "self_text": "Hi People!  As the title states - I have a problem with wireless and big mouse's. I went through DeathAdder Essential where the scroll broke in few months. Now the Basilisk x HyperSpeed - I love the grip, as I loved it in DeathAdder but the Bluetooth connection is now broken, and also the mouse needs hard reset in every few hours (remove and insert the battery again). As the Black Friday is close, I though about changing the mouse. I quite don't like the Logitech series - my brother has g502 and this mouse is little tricky - I might get used to it, but I prefer the \"Razer-styled\" design.  And here goes the problem. There a little to none big wireless mouse's - The Corsair DarkCore has been hated merrily everywhere where I looked for reviews due to quality problems. My biggest need is the mouse to suit my big hand - the grip for Basilisk or DeathAdder as I said was perfect. My budget is around 100 Euro, as I live in Poland and the average price for a high end mouse is around 400/500 PLN. I'd love some suggestions as I find myself almost blind in all of those models. Cheers!  &#x200B;  EDIT: My hand size - length 190mm and width 100mm.",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-08T14:01:49.862580Z"
  },
  {
    "source": "posts",
    "id": 740700,
    "title": "3 pin rgb header to 4 pin rgb",
    "self_text": "recently i got a 6800xt and a AIO they both take 3 pin headers for the rgb but my board only takes 4 pin headers, is there a way i can get my gpu and aio RGB to still work with my pc. right now i got it plugged into my old case rgb controller but the problem is it registers my gpu as a pc case and causes some issues with the rgb",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:04:19.779658Z"
  },
  {
    "source": "posts",
    "id": 1013457,
    "title": "AW4 LTE with its own number but paired with iPhone",
    "self_text": "I have 3 phone numbers with 3 different carriers (let's call them A, B and C). Only A supports AW LTE in my country. I can't add cellular using SIM B or SIM C  My plan is to insert SIM 'A' into the iPhone, pair it up and add a cellular plan. Once setup, take out SIM 'A' and use the iPhone with SIM B and SIM C only.  Will there be any problems I should know before trying this?",
    "subreddit": "AppleWatch",
    "selected_at": "2025-09-08T14:05:56.022165Z"
  },
  {
    "source": "posts",
    "id": 437836,
    "title": "Need Some Help/Advice on Which Mouse to Buy Next",
    "self_text": "I started out only buying ergo mice (EC2-A, NP-01, MM720, Orochi) but then got a couple ambi ones (GPW, Viper Mini). I have small 16.5 x 9cm hands and play with a relaxed claw grip. I am still waiting for the Viper Mini Wireless as I love that shape, but the clicks feel cheap and I wasn't a fan of the cable all that much. I recently switched back to the NP-01 and am loving it. The mouse I'm thinking of buying are the NP-01S because the grip width sometime feels to wide on the NP-01. Or sometimes I feel with a mouse of that size I want it to fill my palm out more so its between the EC3-C or the Outset AX. The new MM712 looks nice, but if the clicks and scrollwheel are anything like the MM720 I am NOT a fan. If anyone has owned the mouse I mentioned please let me know your experience + pros and cons of them, thanks!",
    "subreddit": "MouseReview",
    "selected_at": "2025-09-08T14:06:18.423103Z"
  },
  {
    "source": "posts",
    "id": 727267,
    "title": "Help please",
    "self_text": "Ive just built my first PC.  And all went well until I installed windows from a USB boot drive.   It allowed me to go through the full set up even getting into the windows main screen but then the screen goes blank and I can’t get back into windows.   The sound is still evident and after rebooting it just boots back into a blank screen.   I’ve repeated the install now 3 times and I get the exact same end result.  Any ideas please I’ve sat all day on google but find nothing   Running: ASUS Strix x670e-e Ryzen 7700 Palet gamerock 3090  I’m gutterred and lost what to do.  I maybe thought a display driver but I can’t even get time to download from Nvidia and why would it work at a point  I am able to access the bios menu",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:06:41.856800Z"
  },
  {
    "source": "posts",
    "id": 651534,
    "title": "Keyboard help.",
    "self_text": "So I used swiftkey for the longest time on android and then came over to iPhone a couple years ago. It become so buggy over the years it’s almost completely not worth it to use it. So I use the default keyboard now. I really really do not like it at all. Any other options out there I don’t mind paying for an app once but not interested in a monthly subscription for a keyboard. Any help is appreciated.",
    "subreddit": "iphone",
    "selected_at": "2025-09-08T14:06:58.169598Z"
  },
  {
    "source": "posts",
    "id": 346390,
    "title": "Seeking a consensus from everyone. I want everyone's opinions on a potential upgrade!",
    "self_text": "So I've tried doing my own research, and it just sends me down a huge rabbit hole of PCIe versions, bottleneck percentages, and cpu types until I feel like i am getting nowhere. So I turn to you wonderful folks at r/buildapc to get some advice. I generally find that en-mass consensus is more important and helpful than one or two people's opinions, so I'm looking for as many people as possible to respond!  &#x200B;  I'd like to do some upgrades to a gaming PC i built 6 years ago. I'm starting to notice that modern games are outstripping my PC's capabilities, so I'd like to get a meaningful boost  to FPS and load times and get another 5-7 years out of my current PC before a full rebuild. With a new baby on the way I'm trying to get some meaningful upgrades for not too much money. My current specs are as follows:  MOBO: Asus M5A97 R2.0 (2 PCIe 2.0 X16 slots)  CPU: AMD FX-8370 Eight-Core Processor, 4000 Mhz, 4 Core(s), 8 Logical Processor(s)  GPU: ZOTAC GTX 1070  RAM: 16GB DDR3  Keep in mind my monitor runs at 1440p and 60hz, so I'm not one of those types who NEEDS 120 fps to play. I'm happy at 60, so long as it stays relatively close to 60 throughout the experience. My most demanding games are things like Destiny 2, Racing Sims, and big Strategy Games with a lot on screen at once.  &#x200B;  I was thinking of putting in an NVMe M.2 SSD using a PCIe converter (my MOBO doesn't have an M.2 capable slot as is.)  Overclocking the CPU to 4.5 ghz, and a RTX 3070 Ti into the current MOBO, going for a load time reduction in the SSD and some extra GPU power to see me through the next 5-7 years or so. Is this a decent upgrade in everyone's opinion, or will I experience too much CPU bottleneck for this to be worthwhile? I feel like a 4.5ghz CPU should still be very fast, but I've heard that my particular brand of CPU isn't great, which leaves me worried the extra GPU money would be wasted without also buying a new CPU. I've tried to find out myself, but i feel get so much different information i get overwhelmed and can't figure out exactly what to do.   &#x200B;  So in the all-knowing opinion of build-a-pc, what do y'all think? Is this a worthwhile upgrade or not?",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:08:14.869406Z"
  },
  {
    "source": "posts",
    "id": 548787,
    "title": "Is it wise to buy a PC?",
    "self_text": "Hi guys, not sure if this is the right sub but it is one of the largest.   I am considering buying a PC this black Friday but am kind of conflicted about what to get. Just to give some context, I use to game on a laptop but I then bought a PS5 and play exclusives and the AAA games on it exclusively. I traded in my laptop for a macbook for work and such but I still use my Mac for multiplayer games like WoW.  I am considering getting a PC because of new exclusives like Starfield and Game Pass. Plush, the mac heats up too quickly. I tried getting a pre-built but the prices are a bit outrageous for older harder when I would mostly use it for multiplayer and exclusives.  So my question is, should I even get a PC? It is a pretty big investment and I don't plan on splurging more than 700 especially when I don't know much about the hardware",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T14:12:37.634276Z"
  },
  {
    "source": "posts",
    "id": 822549,
    "title": "How to emulate 60fps using your TV?",
    "self_text": "So, I had a Panasonic TV 43inch 4K with my PS4 and there was this setting called movement enhancement with 3 options: low, mid and high, when you were playing any game at 30fps like RDR2 or Fallout 4 for example, and you set it on high, the game magically seemed like 60 fps even if you move, you were able to play any 30fps game for hours looking like you're playing at 60fps, it was amazing. So now I bought a PS5 and a new TV Sony 65inch 4K, so when I started playing Fallout 4 it looked really slow, like 30fps, the same for RDR2 it's not the same smoothness and I don’t like it at all, I mean how is possible that a 200$ TV is looking better and smoother than 1K one?  What can I do? Return the Sony TV and buy a Panasonic or the problem is that the PS5 doesn’t allow this 60fps emulation kinda like? Sorry if it is too long, but I was used to play at “60fps”, now my games look so slow.",
    "subreddit": "playstation",
    "selected_at": "2025-09-08T14:13:47.265090Z"
  },
  {
    "source": "posts",
    "id": 706849,
    "title": "Ethernet Not working",
    "self_text": "Bought a new PC recently but the Ethernet cable is not working properly. I think it's a loose concact cuz it connects for a brief moment when I wiggle it around. Is it a Problem with the mainboard?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T14:14:31.217928Z"
  },
  {
    "source": "posts",
    "id": 471394,
    "title": "AIO freaks out when I plug an external drive in...",
    "self_text": "So, super weird question, and I have no idea what's wrong. Whenever I plug an external hard drive in, my AIO ramps up to 100% speed and gets loud, it only happens with my two WD externals, not flash drives or anything else, and it doesn't stop when I unplug them.  Any ideas?",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T14:26:50.213380Z"
  },
  {
    "source": "posts",
    "id": 1014791,
    "title": "Google is heavily screwing me over",
    "self_text": "Bought like 8 pairs of pixel buds for the office as Christmas gifts. Saw Best Buy had better price nearing up in Black Friday. I decided let me return the  8 pairs and just buy in Best Buy. Google store then decides after a month of back and forth that they will not be refunding me for my Ear buds nor sending back the returned items to me. Sent proof of tracking for credit card dispute. Now a month later and dispute has been denied.   I don’t get it I returned all items and have proof from tracking and gave all RMA numbers to credit card company. Out about $1000+ and wouldn’t mind if I just had the damn earbuds I returned…",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-08T14:30:13.675943Z"
  },
  {
    "source": "posts",
    "id": 768624,
    "title": "I was an early adopter from iOS 2.0 - iOS 11, and have been on Android since. Today I just got an iPhone again. What did I miss?",
    "self_text": "A lot is familiar, a lot isn’t. I consider my self a pro user, so to all the pro users out there, what are some things I missed? What do you do to be a “pro user”?  For one, I made a lot of shortcuts that run automations. Just cant figure out how to disable it notifying me every time it runs.",
    "subreddit": "iphone",
    "selected_at": "2025-09-08T14:30:47.646261Z"
  },
  {
    "source": "posts",
    "id": 291457,
    "title": "Mac Trackpad Gone Crazy",
    "self_text": "So I recently. noticed that my trackpad has been playing up and doing this (see below) I contacted apple and they told me to do an SMC reset and try safe mode, but that didn't work so now I have to give it to an apple certified technician, but I would rather avoid the 200 dollar fee. this only happens when I touch the trackpad, an external mouse doesn't have the same issue. any ideas?  https://reddit.com/link/yk028v/video/ij9b2luw5ix91/player",
    "subreddit": "mac",
    "selected_at": "2025-09-08T14:31:31.469020Z"
  },
  {
    "source": "posts",
    "id": 323704,
    "title": "Unity Shaders for UI",
    "self_text": "Is it a common practice to create UI elements with Shaders? I've started creating my buttons and some backgrounds using shaders instead of image assets, and i begin to wonder if that's a solid practice or not worth the burden on the GPU.  What's the most comoon practice in the industry?",
    "subreddit": "gamedev",
    "selected_at": "2025-09-08T14:33:08.011685Z"
  },
  {
    "source": "posts",
    "id": 544111,
    "title": "GPU Upgrade",
    "self_text": "So my build is… CPU i5-12600K GPU GTX 1660Ti Cooler DeepCool AK620 PSU EVGA 500W BR Bronze RAM T-Force Vulcan Z 3200MHz Case NZXT H510  My monitor is 1080p 165Hz so I’m not trying to hit the best stats but I’ve notice my GPU is lagging. I’m shooting to kinda cap out around those limits or at least get a noticeable upgrade. What kind of upgrades should I be looking at if I wanted to upgrade my GPU? I was thinking a 3070 (specifically GIGABYTE Gaming GeForce RTX 3070 Ti 8GB GDDR6X PCI Express 4.0 ATX Video Card GV-N307TGAMING OC-8GD) but I don’t want to bottleneck. Also would I need to upgrade my PSU/case?  I also don’t really want to spend more than 1k on the GPU. I mostly play fps/VR games (EFT, MW2, NMS, Destiny 2, Saints and Sinners, HL Alyx, Boneworks, but lately been getting into a few story games, RDR2, Spider-Man, GoW).   EDIT  I forgot to mention my motherboard is a B660M from gigabyte",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:36:00.182268Z"
  },
  {
    "source": "posts",
    "id": 670417,
    "title": "DeepCool AS500 PLUS - Temp difference between cores - Intel 12600K",
    "self_text": "Hey guys, I just received  my DeepCool AS500 PLUS yesterday and installed it. everything went smoothly and it looks way more badass.  Temps are way better than Cooler master H410, Idle temp is around 23-25C compared to 30-30C on the Cooler master H410.  Load temps with cinebench r23 running for around 10 mins is way better with the AS500P :  Load temps with CM H410 is around 82-85C at 125W stock PL  Load temps with with Deepcool AS500p is around 65-74C,,,where there is around 9c core temps difference between the coolest and hottest cores.i'm honestly not sure if its mounting issue? or should i ignore it and consider it normal even though  i think 9c deference is not normal.  Thanks,,  &#x200B;  Edit: Im talking about core temps difference between the P cores BTW.",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:38:00.517186Z"
  },
  {
    "source": "posts",
    "id": 882739,
    "title": "2nd router Vs mesh Vs access point",
    "self_text": "Gathering advice on setting up my home network. I game, a TV streams 4k, a little one on the way and because she wants two, another will be added to the family in the future. .  Currently my router (Virgin's super crap) gets sketchy WiFi upstairs at best.   Options that I'm thinking is to: Hard wire a cable from downstairs, up into the attic, where I can then wire in several ports, one in each room and a 2nd WiFi router next to the gaming pc.  WiFi mesh which is new stuff to me but I'm getting put off of WiFi after experiences.  Or something I've not looked into yet, access points?  Suggestions please?",
    "subreddit": "HomeNetworking",
    "selected_at": "2025-09-08T14:38:45.213125Z"
  },
  {
    "source": "posts",
    "id": 889428,
    "title": "password problem on gg pixel 3a",
    "self_text": "So seems pretty strange, i am using my phone and turned it off. After try to sign in again ( like usual ) its said my pass was wrong, eventhough im pretty sure it was the right one ( i’m not a guy that have a lot of pssw btw and my memory muscle can still remember how to unlock it since i do it every single day ) now s on 42 times and lock me each 1 mins  What should i do now…heard that factory reset will need to remember the passcode as well ?",
    "subreddit": "GooglePixel",
    "selected_at": "2025-09-08T14:38:50.054362Z"
  },
  {
    "source": "posts",
    "id": 907720,
    "title": "PC BUILD HELP-BEGINNER",
    "self_text": "Hello guys, This will be my first time building a PC. Here are some pieces of information that I think would be useful. -I am from PH  -I  plan to use 3 monitors at most  -I have a very small desk space  - I am leaning toward a micro or mini or small  -I use Solidworks, Catia, and NX for work, then I only play DOTA 2 mostly.  -NO RGB, please.  Thank you very much for the help.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-08T14:39:22.806199Z"
  },
  {
    "source": "posts",
    "id": 528414,
    "title": "Should / How Do I Set Up One 4k Monitor With Two Secondary 1080p Monitors?",
    "self_text": "Hi! I'm preparing to build my first PC and my vision is to have a 32\" 4K 240Hz monitor in the middle (Samsung Odyssey Neo G8) and have two 24\" 1080p 60Hz monitors (Dell UltraSharp U2414H) oriented vertically, one on either side. The other relevant parts will  hopefully  be an i9 13900K CPU, an ASUS TUF GAMING 4090 GPU, and an ASUS ROG MAXIMUS Z790 HERO motherboard.  I have a couple questions about how this multi-monitor setup would work.   Question the first   What would happen if I ran all three monitors off the 4090 (4K via HDMI, 1080p's via DisplayPort)?  Say I'm playing a game on the 4K monitor. Would I get higher FPS if I turned off the 1080p's? Also, do all the monitors have to run at the same refresh rate? Since two of the monitors are 60Hz, would it cap the 4K 240Hz monitor at 60Hz as well?  If the answer to any of the above is yes, would it be better if I ran only the 4K off the 4090 and ran the two 1080p's via the i9's integrated graphics (using the motherboard's two USB-C DisplayPort outputs)? Are there any downsides to doing it that way?   Question the second   Say I use the i9's integrated graphics to power the 1080p monitors as described above. Does dragging an application window from those monitors to the 4K monitor change which GPU it's running on? I feel like that wouldn't make sense but idk.   Question the third   Once I eventually get all three monitors working in whatever configuration is best, what do I need to do in order to make it so that the cursor and applications move seamlessly between screens? I know how to adjust display position and scaling in Windows. Is it just as easy as setting the display scaling on the 4K monitor to 200%?  Thank you for helping me live my multi-monitor dream/nightmare :)",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:39:55.178122Z"
  },
  {
    "source": "posts",
    "id": 524987,
    "title": "Need people's opinions - $2500 Custom PC Build versus $2500 Pre build PC found on Newegg",
    "self_text": "The gist of things, I am looking to purchase a gaming pc for about $2500. I want to have a high potential for gaming and I do not really have as much need for application processing.  The Newegg one has a   i7-12700K 3.6GHz paired with a 3080ti while my custom build has a Ryzen 7 5800x3D paired with potentially a Radeon Rx 6900 xt GPU, but I am waiting until mid December for the release of the next gen AMD GPUs. I haven't purchased anything yet, but would really appreciate the wise people of this subreddits advice. The custom one would definitely take the edge in aesthetics and likely cooling, with those both being important to me.  Throughout benchmarks I have viewed, the AMD cpu setup tends to barely beat out the Intel one in gaming, while the intel one crushes the AMD one in application processing.    Newegg pre build : https://www.newegg.com/abs-ali630/p/N82E16883360295?Item=N82E16883360295  &#x200B;   Custom PC  [PCPartPicker Part List](https://pcpartpicker.com/list/zwwQNc)  Type|Item|Price  :----|:----|:----  **CPU** | [AMD Ryzen 7 5800X3D 3.4 GHz 8-Core Processor](https://pcpartpicker.com/product/CZ3gXL/amd-ryzen-7-5800x3d-34-ghz-8-core-processor-100-100000651wof) | $406.20 @ Amazon   **CPU Cooler** | [Corsair iCUE H150i ELITE LCD 58.1 CFM Liquid CPU Cooler](https://pcpartpicker.com/product/GLjBD3/corsair-icue-h150i-elite-lcd-581-cfm-liquid-cpu-cooler-cw-9060062-ww) | $289.95 @ B&H   **Motherboard** | [Asus TUF GAMING X570-PLUS (WI-FI) ATX AM4 Motherboard](https://pcpartpicker.com/product/dmGnTW/asus-tuf-gaming-x570-plus-wi-fi-atx-am4-motherboard-tuf-gaming-x570-plus-wi-fi) | $191.46 @ Amazon   **Memory** | [Corsair Vengeance RGB RT 32 GB (2 x 16 GB) DDR4-4600 CL18 Memory](https://pcpartpicker.com/product/Bm2WGX/corsair-vengeance-rgb-rt-32-gb-2-x-16-gb-ddr4-4600-cl18-memory-cmn32gx4m2z4600c18) | $234.99 @ Amazon   **Storage** | [Samsung 970 Evo Plus 1 TB M.2-2280 PCIe 3.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/Zxw7YJ/samsung-970-evo-plus-1-tb-m2-2280-nvme-solid-state-drive-mz-v7s1t0bam) | $109.99 @ Amazon   **Storage** | [Western Digital WD_BLACK 8 TB 3.5\" 7200 RPM Internal Hard Drive](https://pcpartpicker.com/product/jf4Ycf/western-digital-wd_black-8-tb-35-7200rpm-internal-hard-drive-wd8002fzwx) | $173.40 @ Amazon   **Video Card** | [XFX Speedster SWFT 319 Radeon RX 6900 XT 16 GB Video Card](https://pcpartpicker.com/product/WnrRsY/xfx-radeon-rx-6900-xt-16-gb-speedster-swft-319-video-card-rx-69xtaqfd9) | $669.99 @ B&H   **Case** | [Phanteks Eclipse P500A D-RGB ATX Mid Tower Case](https://pcpartpicker.com/product/GmhmP6/phanteks-eclipse-p500a-d-rgb-atx-mid-tower-case-ph-ec500atg_dwt01) | $177.88 @ Amazon   **Power Supply** | [Corsair RM850x (2021) 850 W 80+ Gold Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/26rRsY/corsair-rm850x-2021-850-w-80-gold-certified-fully-modular-atx-power-supply-cp-9020200-na) | $149.99 @ Amazon   **Operating System** | [Microsoft Windows 11 Home Retail - USB 64-bit](https://pcpartpicker.com/product/hMYmP6/microsoft-windows-11-home-retail-usb-64-bit-haj-00108) | $139.00 @ B&H   | *Prices include shipping, taxes, rebates, and discounts* |  | **Total** | **$2542.85**  | Generated by [PCPartPicker](https://pcpartpicker.com) 2022-11-10 15:53 EST-0500 |",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:41:43.145778Z"
  },
  {
    "source": "posts",
    "id": 773224,
    "title": "random crashes with planes in mixed-battles",
    "self_text": "Hey guys! i have some problems since the last update and it driving me nuts. It doesn't happen every time but while in game (several rounds finished with no issue) i crash for about 2-3 seconds on the desktop (game is still running) and then jump into the game again.   The last time i crashed on desktop the game crashed total and i got the error \"3d card not found\" and the error message \"cant reset 3d device\"  All the suggestions by gaijin are not working (cache clearing, etc)  Does anybody have any clue what could be the problem? Does anybody have the same issue??  Primarily it happens in mixed battles when i fly a plane. If i stick with tanks it never happens. Weird!  My drivers are all up to date and plenty of free space  my specs: i3-12100F 16 gb ddr4 ram gtx 1070  i have no problems in other games and the 3dmark stresstest runs 1 hour without any problem.  it worked fine days ago. Since the latest update with \"fixes\" it crashes all the time.",
    "subreddit": "Warthunder",
    "selected_at": "2025-09-08T14:42:15.367696Z"
  },
  {
    "source": "posts",
    "id": 586015,
    "title": "newly installed Debian 11 doesn't show Windows install in GRUB",
    "self_text": "I've tried twice with the same result, a few times, the GRUB bootloader shows up with just Debian and advanced options thereof, and nothing else, and then it stops showing up, going straight to Debian.",
    "subreddit": "linuxquestions",
    "selected_at": "2025-09-08T14:44:12.573805Z"
  },
  {
    "source": "posts",
    "id": 1013690,
    "title": "Can I use an external hdd as a 2nd internal drive for a pc?",
    "self_text": "Hello there! I'm quite new to building pcs so yeah, apologies in advance.  I found a external hdd of 2tb cheaper than a standard hdd cuz it was on sale. It is a toshiba canvio external. Can I just remove the hard drive inside the external out of its case and use it as a 2nd drive or is it a pass?  Thank you for answers :D",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T14:46:11.468559Z"
  },
  {
    "source": "posts",
    "id": 904853,
    "title": "Help with BSOD. Happens every few minutes or so. ThinkPad T490",
    "self_text": "Error code: secure_pci_config_space_access_violation What failed: wnpdriver.sys I'm on Windows 11 22H2 with the latest updates installed as of 25/11/2022. This was happening yesterday too and I uninstalled a quality update from recovery to fix it but surely there's gotta be a proper fix for this.",
    "subreddit": "thinkpad",
    "selected_at": "2025-09-08T14:46:47.411105Z"
  },
  {
    "source": "posts",
    "id": 712644,
    "title": "is this laptop any good for 750 cad?",
    "self_text": "Its an  HP 15-ef3017ca 15.6\" Laptop, AMD Ryzen 5 5625U, 16GB RAM, 1TB SSD, Windows 11 Home.  I'm looking for a middle of the road laptop with a decent processor, good memory and good storage. Wondering what people think of this one. It's normally 1000 cad or so this seller is advertising. It's from Staples.  Any input would be greatly appreciated!",
    "subreddit": "buildapc",
    "selected_at": "2025-09-08T14:50:19.525639Z"
  },
  {
    "source": "posts",
    "id": 914170,
    "title": "Game Jams?",
    "self_text": "Hi, very new indie game dev. I know that places hold conferences for game jams an people to show off there stuff but I’m too new to know about any of them. Are there any events coming up were I can meet other game devs?",
    "subreddit": "gamedev",
    "selected_at": "2025-09-08T14:50:59.050986Z"
  },
  {
    "source": "posts",
    "id": 348149,
    "title": "TV unit with PC space for living room?",
    "self_text": "Hi, I work from home and sit at my desk all day so when it comes to down time the last thing I want to do is stay at that desk where my PC currently is.  I'm thinking about hooking up my PC to my TV in my living room. However, I don't want my living room to look untidy. Currently the PC case etc will look out of place just sat next to my TV stand.  Does anyone know if any TV units that have a PC space? Or any possible suggestions. Thank you.",
    "subreddit": "PcBuild",
    "selected_at": "2025-09-08T14:52:42.125551Z"
  },
  {
    "source": "posts",
    "id": 858075,
    "title": "5G cellular signal and FM radio frequency conflict",
    "self_text": "I was on break earlier and her radio seems to make a horrid buzzing noise when my new S22Ultra 5G is in the vehicle. Anyone know why that might be? Does 5G interfere with FM radio frequency?",
    "subreddit": "NoStupidQuestions",
    "selected_at": "2025-09-08T14:53:18.954394Z"
  },
  {
    "source": "posts",
    "id": 441171,
    "title": "Can I change the alarm duration with iPhone 14 Pro at iOS 16.1?",
    "self_text": "Hello, I was wondering if it's possible to change the alarm duration to be less than 15 minutes? Couldn't find any new information about this.  Thanks",
    "subreddit": "iphone",
    "selected_at": "2025-09-08T14:54:41.971647Z"
  },
  {
    "source": "posts",
    "id": 579710,
    "title": "Unity or Unreal 5 for Mobile Game?",
    "self_text": "Hi, im want to create a mobile game but i have to choose with Unreal Engine 5 and Unity. What Engine you are gues reccomedet for new creators? Thank you if you answer for this!",
    "subreddit": "gamedev",
    "selected_at": "2025-09-08T14:58:41.490178Z"
  },
  {
    "source": "posts",
    "id": 781315,
    "title": "Switch Joycon type controller for the PC?",
    "self_text": "I have a ton of nerve damage in my arm. So it starts to cramp up after extended play. However, using a Joycon for my switch is very comfortable because I don't need to keep my hands close to each other.  Is there a blue tooth controller for the PC that is in two parts? Even if it have a wire between the two pieces I'd be fine.",
    "subreddit": "pcmasterrace",
    "selected_at": "2025-09-08T15:00:30.973666Z"
  },
  {
    "source": "posts",
    "id": 882822,
    "title": "SteelSeries Nova 7 Wireless vs HyperX Cloud Alpha Wireless",
    "self_text": "Hello, I'm looking for a wireless headphones and can't choose between nova 7 Wireless  and cloud alpha wireless. I have blackshark v2 pro now.  My budget is 200$.  Cloud Alpha costs 180$ and Nova 7 200$ in my country   I use headphones on my laptop for movies, music, gaming.  I don't care about microphone, bluetooth. I care about sound quality, comfort and especially battery life.  &#x200B;  Thanks.",
    "subreddit": "HeadphoneAdvice",
    "selected_at": "2025-09-08T15:01:39.021187Z"
  }
]