[
  {
    "id": 665230,
    "post_id": "ywlx5f",
    "title": "31B Demiroglu and Physics 1A Bauer",
    "self_text": "easy money for you, come on. 🥹 win win",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4202504579459534357
  },
  {
    "id": 921138,
    "post_id": "z4srf5",
    "title": "Den pass mbb tickets",
    "self_text": "I have a den pass, but i’m not sure how to secure a ticket for a home game. Do i line up at pauley day of the game and physically ask for a ticket? Or are people waiting outside pauley just for better seats?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1924933804696727895
  },
  {
    "id": 860260,
    "post_id": "z2txwx",
    "title": "Dismissed from UCLA and can't see a counselor before the appeal deadline..",
    "self_text": "Hey everyone-  I was dismissed from the school after failing 2 quarters in a row, and not attending the next 2 quarters (the second quarter I didn't attend is the current fall term).   I finally started writing my Multiple Withdrawals Appeal to explain the 2 quarters I failed last year. But I just saw a MyUCLA notice from a month ago saying I'm dismissed from the university.  I'm kinda panicking because the deadline is in two days (November 25th), and there aren't any counselors available by then. I met a counselor way back in March, when I was planning to submit a Multiple Withdrawals Appeal. Now that I'm dealing with a dismissal , I'm worried that the school will view my appeal poorly because I didn't seek help regarding my dismissal.  I was looking for advice from anyone who's succesfully appealed for dismissal. I'm wondering if it matters whether I saw a counselor, as long as my appeal demonstrates that I've taken action and grown in other ways..   Any help would be appreciated!  tldr: can't see a counselor before submitting my dismissal appeal. scared that this will greatly lower my chances of being readmitted. looking for advice/experience",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 758150717329728969
  },
  {
    "id": 995983,
    "post_id": "z7745b",
    "title": "Strike Question",
    "self_text": "Want to start off by saying: SUPPORT THE TAs!!! They are literally just trying to make a living and are being severely underpaid by the UC system.   With that being said, I was wondering if anyone had any estimates as to when the strike will end? Will it go into winter quarter? End this week? Next?   Any insight would be appreciated. Thanks",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 869952975406992356
  },
  {
    "id": 471642,
    "post_id": "yq0h8t",
    "title": "Found Car Key",
    "self_text": "If anyone lost their car key to their Honda, I found it and gave it to the lost and found in Ackerman Union A level",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4332333472696844448
  },
  {
    "id": 602050,
    "post_id": "yufea6",
    "title": "Graduation Dresses",
    "self_text": "Do we have to wear white dresses under our gowns? I was considering finding a blue dress that matched the sash just as an accent but wanted to make sure before getting anything.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2318090394172978674
  },
  {
    "id": 510055,
    "post_id": "yr8s48",
    "title": "strike on Monday",
    "self_text": "If I have a disc sesh that day should I still go? And would the TA normally notify us if they are planning on participating?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7936744336413607018
  },
  {
    "id": 972549,
    "post_id": "z6gdsg",
    "title": "Eps Sci 101",
    "self_text": "Anybody have any insight on how this class runs? Grade scheme, difficultly, etc  Anyone take it with Paige DA",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7603551373296055459
  },
  {
    "id": 683707,
    "post_id": "yx979n",
    "title": "How to sell USC UCLA Den Guest Ticket?",
    "self_text": "Accidentally bought an extra ticket and am looking to resell it. Not sure if you use the UCLA ticket avenue site and transfer to friend or if you add it to your Apple Wallet first? Thanks.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7069649421194481536
  },
  {
    "id": 981833,
    "post_id": "z6qmzu",
    "title": "uaw strike's impact on finals",
    "self_text": "lurking through r/berkeley, i noticed the academic senate released this document outlining how instructors are expected to reorient their courses. has there been any communication from ucla? i'm also curious about everyone's thoughts on how faculty might approach this",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4237516296217517258
  },
  {
    "id": 554183,
    "post_id": "ysq4db",
    "title": "Part-Time First Quarter",
    "self_text": "I wanted to drop a class in my first quarter as a transfer which would put me at 8 units (part-time). Is it required to be full-time/12 units your first quarter, if not what will it affect?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7386562442847130879
  },
  {
    "id": 425995,
    "post_id": "yof2lt",
    "title": "BASKETBALL STUDENT TICKETS",
    "self_text": "How do I buy a student ticket for the home basketball games? Like to sit in the student section? I don’t see that option on the CTO website, unless I’m looking in the wrong spot. I only see the option to buy specific “seat” tickets.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7741476750335717470
  },
  {
    "id": 629423,
    "post_id": "yvev9t",
    "title": "mimg 101 vs 102",
    "self_text": "i have to take a life science elective next quarter for my major and am just wondering which of these would be easier (for someone w virtually no background in microbio). 101 is with bradley and a new prof named soroosh. 102 is with fregoso and li. if anyone has any input, mostly on exam difficulty, pleasee help me out",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6368572392959527941
  },
  {
    "id": 844058,
    "post_id": "z2a5r8",
    "title": "am looking for someone to move into rieber hall classic double with me.",
    "self_text": "looking for another girl who is overall respectful of the room and who will respect my sleep and study times as much as I’d respect hers!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5449495896343764211
  },
  {
    "id": 288450,
    "post_id": "yjw39b",
    "title": "How to activate edu email?",
    "self_text": "I tried signing into mine but it doesn't exist apparently. I remembee choosing my personal one as the main one to receive emails but I thought the other one would exist still.   any help appreciated",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2097606132329681657
  },
  {
    "id": 516688,
    "post_id": "yrii6u",
    "title": "MCDB 140 + MCDB 168",
    "self_text": "Did anyone take MCDB140 and MCDB168 in one quarter? How was the workload?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2351273362123253567
  },
  {
    "id": 495924,
    "post_id": "yqtzxt",
    "title": "German 3?",
    "self_text": "I wanted to take German 3 for FL but it says German 2 is a prereq. Has anyone who's taken this class confirm?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4084367400725654307
  },
  {
    "id": 637092,
    "post_id": "yvn39j",
    "title": "Willing to pay for physics 5a spot",
    "self_text": "Hi, I need to take physics 5a this upcoming quarter and willing to pay for a spot. PM me",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4893575501582545141
  },
  {
    "id": 1006377,
    "post_id": "z7ifzn",
    "title": "14cl reilly final",
    "self_text": "hi hi is anyone in 14cl with reilly right now? i need to take her final for this class due to having an incomplete from spring quarter but she hasn't been responding to emails or campuswire so I'm completely in the dark about what she's testing on or where the final is going to be. I emailed the chem department and they said just to wait til friday week 10 😭😭💀 if anyone has any info pls help thank youuuu",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2320128935635442419
  },
  {
    "id": 693877,
    "post_id": "yxlrxm",
    "title": "Any other students play poker? I want to start a group so I can play with others online",
    "self_text": "Not sure if this is against the rules but I started a discord server for students that want to play poker online. Would be happy to play with you guys so feel free to join and we can get some games running and get to know each other  https://discord.gg/uRhqwcPm",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5936981428412888148
  },
  {
    "id": 654318,
    "post_id": "yw9ux7",
    "title": "usc ucla student section",
    "self_text": "lookin to buy 4 tickets, lmk !!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5709282555754547278
  },
  {
    "id": 1013154,
    "post_id": "z7s7tn",
    "title": "how long does it take for bruinwalk to be updated?",
    "self_text": "i’m a transfer and this quarter was my first experience with bruinwalk, ngl it’s annoying compared to ratemyprofessor because you have to wait for the class to be listed under the prof’s name to review them?? also none of my profs for next quarter have reviews and it’s making me a lil nervous lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9106580427451047465
  },
  {
    "id": 301340,
    "post_id": "ykbdqz",
    "title": "website that shows how fast classes fill up",
    "self_text": "what is that website that shows how a fast class will fill up or something like that",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1017590835441322066
  },
  {
    "id": 652626,
    "post_id": "yw822k",
    "title": "Begging for a UCLA v USC ticket!",
    "self_text": "please dm me if you aren’t planning on going and are sitting in the student section, I will reimburse and give  competitive offers 🥹",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3349281380967960854
  },
  {
    "id": 628400,
    "post_id": "yvdowg",
    "title": "EngComp 100W",
    "self_text": "Does anyone know if it's easy or not to get off the waitlist for a 100W class? Currently fourth on the waitlist for McIver's class so I want to see how likely it is I can actually get in.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8935510447870677020
  },
  {
    "id": 558566,
    "post_id": "ysuqnr",
    "title": "How likely is it that I can switch into my friend’s apt next quarter?",
    "self_text": "My friend lives in a university owned apartment and one of her roommates is graduating at the end of the quarter. I’ve decided I want to leave my dorm during winter quarter and I have a legit medical reason for it- the food has been upsetting my stomach so many times and I can’t pin it down to specific foods. I wish I could otherwise it would be so much easier to work around this.   I need access to a kitchen and plan on having my doctor vouch for me on the CAE form to speed up the process of me moving out. I don’t want to have to wait until the CAR for winter quarter opens. Frankly, it’s ridiculous that students are getting housing offers for winter quarter now but I have to wait 2 months to submit my CAR. I’m hoping to fill the space in her apt next quarter but I’m concerned it has or will be given to someone who applied for winter quarter housing.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1633425754685836995
  },
  {
    "id": 655733,
    "post_id": "ywbgkh",
    "title": "Strike FAQ",
    "self_text": "Hi everyone! I've been seeing a lot of questions about the UAW strike and I wanted to provide some clear answers. I'm a fourth-year undergraduate student who has been working closely with UAW organizers to build undergraduate support for the strike, so feel free to DM me any other questions you might have as well.  &#x200B;    What does \"crossing the picket line\" mean? Should I go to class or not?    I want to make it very clear that UAW  has not called for a student boycott of classes.  If you would like to skip your class and join the picket line, I would personally certainly encourage that! But there has not been an official call to skip classes, and if you have a professor who is requiring attendance or something similar, that is their fault, not yours, and you shouldn't feel bad about going to class.  Picket lines are public demonstrations by striking workers to visibly show their power in numbers and let others know that there is a strike happening at the business they are picketing. 'Not crossing the picket line' varies from strike to strike, but typically means not supporting the business currently being picketed. At UCLA, this means not buying things from campus stores & restaurants, and not going to any discussion sections still being held during the strike.  &#x200B;    How long will the strike last for?    The strike will last until the UC administration agrees to bargain fairly with the striking workers. This entails the UC agreeing to stop their  illegal  interference in the bargaining process, and coming to the bargaining table with actual proposals that workers might be willing to accept. Every single striking TA I have talked to has told me they are very worried about their students and do not want a long strike, but that is not their decision at this point - it's the UC's. Whether the strike lasts for a week or a month will depend on when the UC agrees to bargain fairly. Basically, if you want a shorter strike, support our TAs and tell the UC to bargain fairly now!  &#x200B;    Isn't academia a cushy profession? Why are TA's striking?    This is a very common misconception. Some facts: the average yearly salary for a TA at the university of California is  below the poverty line for Los Angeles .  90%  of all UC TAs statewide are classified as Rent Burdened, meaning they pay >30% of their income in rent, and many pay up to  70%  of their income on rent. For those who live in university-owned housing such as Weyburn Terrace in Westwood, this is money going out of their paycheck right back to their employer. Academic workers also have terrible protections against workplace harassment, insufficient support for working parents, huge financial costs for international scholars, and a laundry list of other terrible conditions they are fighting against. A full look at the horrible treatment of academic workers by the UC can be found here. While academic work has never actually been a \"cushy ivory tower\" job, the historical collapse of state funding for the UC coupled with its increasing privatization has made workers' conditions worse and worse, resulting in the high exploitation we see today.  &#x200B;    Will higher pay for academic workers increase my tuition?    Our striking workers' current proposed wage increases would only constitute a 3% increase in the UC's entire $44 billion dollar budget. The work done by TAs, Student Researchers, and Post-Doctoral Students makes up the majority of teaching and research done at the UC, bringing in record-setting grant funding for our schools, and yet their pay is 22x less than average UC Chancellor salary and 58x less than the average UC hospital CEO salary. California is increasing the UC's funding by $602.3 million in 2022-2023, but currently that money is not being invested fairly: chancellors will receive a 9% wage  increase  while grad workers will receive a 5% wage  decrease  under the current proposal. While 90% of grad workers are rent burdened, the UC just bought President Drake a  $6.5 million dollar mansion . More examples of the horrific pay inequity at the UC (and sources for the above claims) can be found here.   TL;DR: No, the workers' current proposed wage increases would come from a fair reallocation of UC's vast resources, not an increase in our tuition.   &#x200B;    How can I support the strike?    The best way students can support the strike is by  joining our TAs on their picket lines!  There are 6 picket lines on campus that will be going from 8am-4pm every day of the strike. They are at the Broad Art Center, Bunche Hall, LuValle Commons, the Inverted Fountain, Engineering VI, and the Gonda Building. A map of all the pickets can be found here. Joining a picket line is super easy: just walk over to the picket, grab one of the many signs laying around (they're there for you to use!), and join the march!  Another critical way to support TAs is through donations. You can donate money to their strike fund here. Donations of food, water and coffee are also always needed on the picket lines! Simply show up to any of the picket lines with some food or drinks and the organizers there will be more than happy to accept them.  You can also sign this undergraduate petition to support our TAs that has nearly 1,500 signatures currently: tinyurl.com/SupportOurTAs. If you'd like to get plugged in to organizing information and bargaining updates, feel free to select the \"get involved\" option on the petition as well.  &#x200B;  Thank you so much r/UCLA! Solidarity!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 969308045571681078
  },
  {
    "id": 562613,
    "post_id": "yszwlc",
    "title": "Hold a Spot in Chem 153B",
    "self_text": "DM me if you are able to hold a spot in Chem 153B until the 14th, I will pay and am negotiable with price.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3257502703908217032
  },
  {
    "id": 1033263,
    "post_id": "z8fs2j",
    "title": "Vigil for Urumqi fire victims happening this Thursday 12/1",
    "self_text": "Hi y’all please share this info with ur Chinese/Chinese American friends/anyone who might be interested. Here’s what happened in China and why we’re so angry about it:  https://amp.cnn.com/cnn/2022/11/26/asia/xinjiang-urumqi-china-lockdown-protests-intl-hnk/index.html  https://www.bbc.com/news/world-asia-china-63766125.amp  Please please we need to stand in solidarity with other protestors in China who are facing the threat of being arrested but are still brave enough to stand out and protest against the 0-Covid policy. This is very important to us and we would really appreciate your help!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8120004236966411097
  },
  {
    "id": 848501,
    "post_id": "z2en0l",
    "title": "HIST 1B with McClendon?",
    "self_text": "I signed up for this class bc I initially saw a 4.5 rating for this class and prof on Bruinwalk, but when i looked at Bruinwalk, McClendon has 3 different ratings for 3 history 1B classes with the same exact title which is making me rlly confused 😭. It shows that one of her History 1B classes has a 2.8 rating, and another has 4.5. Anyone have any info on this class?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1082435078710720680
  },
  {
    "id": 787621,
    "post_id": "z0iejk",
    "title": "Physics 5C seats",
    "self_text": "Ay what's up guys - been trying to get a spot in physics 5c for winter but it was completely full by the time my first pass rolled around :/ anyone planning on dropping the class by any chance?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1779644530066124103
  },
  {
    "id": 693530,
    "post_id": "yxl9vj",
    "title": "Did someone fall off a bird scooter on the hill",
    "self_text": "Just saw EMS on the way up the hill (12:30am, de neve drive a bit below de neve crosswalk) with a girl in a neck brace and wheelchair. There was a bird toppled next to the situation(a lot of ppl leave it like that but idk)  Anyone know what happened? Everyone around looked really distressed. Hope she’s okay :(  Also reminder to wear a goddamn helmet when you use a scooter",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2656709795250830561
  },
  {
    "id": 317039,
    "post_id": "yks2ce",
    "title": "Random questions",
    "self_text": "Did anyone ever go into lecture halls and classrooms late at night? Like I swear the doors to many buildings were never locked. Is this normal of colleges?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7275441337636379143
  },
  {
    "id": 360630,
    "post_id": "ym7q5r",
    "title": "Psych 115 &amp; 100B",
    "self_text": "Is this doable? Along with research and extracurriculars.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1204611872903764016
  },
  {
    "id": 525290,
    "post_id": "yrs5my",
    "title": "holding classes",
    "self_text": "i have my first pass tonight but one of the classes I want is filling up right before my eyes 😭😭. it has no prereqs so plz lmk if anyone would be willing to help a girl out!! willing to pay!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7499595062932927013
  },
  {
    "id": 685294,
    "post_id": "yxb1p0",
    "title": "UCLA vs USC",
    "self_text": "looking for 2 ucla vs usc tickets! preferably a student tickets and from ucla students (in person transaction)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5176792367981177526
  },
  {
    "id": 833794,
    "post_id": "z1zemf",
    "title": "My friends are boring af",
    "self_text": "My closest friend group is boring as fuck. We’ve become complacent into not doing anything, as all some of them want to do are “walks in Westwood”. There’s only so much to do in Westwood. They say they’re so busy that they don’t have time for anything else. Welp, I guess you don’t have time to maintain friendships either because this shit is wack.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5760026541097480302
  },
  {
    "id": 424344,
    "post_id": "yocxdh",
    "title": "fishbowl studying",
    "self_text": "Psa: If you’re gonna talk to your friends please do it outside of the fishbowl room at the study 😁",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4126857434192841512
  },
  {
    "id": 608276,
    "post_id": "yumykb",
    "title": "Math 132",
    "self_text": "Which one is easier between Math 132 and 131B? Also how is Shlyakhtenko for 132?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8502412219655017032
  },
  {
    "id": 940357,
    "post_id": "z5fzde",
    "title": "When is CS 31 enrollment restriction lifted?",
    "self_text": "It said it at the least lifts the 23, but is there any specific date they said?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5580695700387545139
  },
  {
    "id": 700516,
    "post_id": "yxuo2z",
    "title": "bplate is like a warm hug in the morning",
    "self_text": "it’s so warm, quiet, and smells delicious 😭 it feels the same as when you go downstairs to a hotel breakfast… but better",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6078095177668689680
  },
  {
    "id": 630308,
    "post_id": "yvft5q",
    "title": "Credit for W2 as Ethics",
    "self_text": "Anyone who's switched into Engineering managed to get their W2 as credit for Ethics?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4602768632818912623
  },
  {
    "id": 533077,
    "post_id": "ys00z5",
    "title": "Need someone to hold Physics 5B, will Pay",
    "self_text": "Basically the title, however, there’s seems to be something going on this quarter so that you cant enroll if you’ve already taken the class before. This may be incorrect but it’s what I’ve been told by someone else trying to hold classes",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5324651721995406209
  },
  {
    "id": 767628,
    "post_id": "yzv5tb",
    "title": "How to give a good campus tour on a Sunday (tomorrow)",
    "self_text": "Hey everyone,  I’m a student at UPenn doing a fall internship in LA. A cousin of mine is visiting the LA area and asked if we could see UCLA’s campus. Looks like the only option for a tour would be following this self-guided map. I don’t have a BruinCard though so I’m assuming we wouldn’t be able to go inside any buildings?  Does anyone have any tips for how to make this an interesting experience for my cousin? Anything cool to do on campus on a Sunday?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4271699936213514316
  },
  {
    "id": 1056097,
    "post_id": "z97g8p",
    "title": "Coffee machine in dorm",
    "self_text": "I assume that ucla staff will check inside my dorm during winter break, could I stick my nespresso in my closet or drawer and be safe?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5355500694828582789
  },
  {
    "id": 967503,
    "post_id": "z6au02",
    "title": "mailing center",
    "self_text": "is the mailing center on the hill open today?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4415804998830433042
  },
  {
    "id": 437667,
    "post_id": "yovgfj",
    "title": "UCLA's yield rate this year is 50.3%",
    "self_text": "Yield Rate: the percentage of admitted students who choose to enroll at UC.   | Campus | Admitted | Enrolled | Yield Rate % | Acceptance Rate | |:-|:-|:-|:-|:-| |UCLA|12,844|6,462|50.3%|8.57%| |UCB|14,568|6,791|46.6%|11.36%|  Other campus data not yet published.  https://apb.ucla.edu/campus-statistics/admissions  https://opa.berkeley.edu/campus-data/uc-berkeley-quick-facts",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3475144676285624245
  },
  {
    "id": 624397,
    "post_id": "yv9ddh",
    "title": "MCDB 104AL Questions",
    "self_text": "Is it required to attend lectures? What is the class like and how difficult is it?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2321689744971274821
  },
  {
    "id": 795927,
    "post_id": "z0rveq",
    "title": "Is discussion mandatory for lifesci 30a?",
    "self_text": "I just need a GE and just enrolled in it randomly but the discussion has no TA so either imma crash another TA or just skip it. But is there anything I need to know? Like does it take attendance?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1050542550671471521
  },
  {
    "id": 708420,
    "post_id": "yy2rgo",
    "title": "Class with Pinter-Wollman",
    "self_text": "Has anyone taken a class with Pinter-Wollman and if so how was it? Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5240161173052400546
  },
  {
    "id": 627294,
    "post_id": "yvck57",
    "title": "MUSCLG 125B Winter Quarter",
    "self_text": "If anybody is taking Musicology 125A right now and was able to enroll into 125B next quarter, how were you able to do it? I’m trying to enroll before all the spots get taken and I keep getting an error message. Do you need to get a PTE# from the professor?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6132775248174201786
  },
  {
    "id": 411919,
    "post_id": "ynz8zr",
    "title": "currency exchange",
    "self_text": "i have some euros from back home that i need to exchange for cash, does anyone know where i can do that on campus or in westwood",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3104390706062440539
  },
  {
    "id": 685197,
    "post_id": "yxawzk",
    "title": "Anyone got a rooter bus ticket for the USC game they arent using?",
    "self_text": "I got my ticket for the game and completely forgot to get a bus ticket. Plz dm me or reply if you have one you can give me. Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1624439443804259830
  },
  {
    "id": 794075,
    "post_id": "z0pht6",
    "title": "best quotes from Andre, aka the \" Can I Ask you a question?\" guy?",
    "self_text": "\" another day all eyes on Dre \"",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6756337872975792665
  },
  {
    "id": 677484,
    "post_id": "yx2514",
    "title": "How do you “sell out” of rooter bus tickets?",
    "self_text": "I thought the point of the reservation was so then they could determine how many busses they needed to get?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8563531165743820325
  },
  {
    "id": 578558,
    "post_id": "ytl0ig",
    "title": "CS M151B second pass",
    "self_text": "Will there be spots?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1576487201154498783
  },
  {
    "id": 659248,
    "post_id": "ywfcdp",
    "title": "Stats 100a",
    "self_text": "Taking it with Sanchez next quarter any tips on how to survive the Bruin walk reviews are making me nervous asf",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4961018547170546824
  },
  {
    "id": 427496,
    "post_id": "yoh4xc",
    "title": "CS 180 w/ Hsieh?",
    "self_text": "Context: Cogsci major who wants more of a CS background, I really enjoyed math 61 but obviously cs180 is a lot harder and varies in topics covered. Hsieh is teaching it next quarter but all his reviews are from online, has anyone taken him in person and what was the difficulty level?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8931466229811114814
  },
  {
    "id": 640370,
    "post_id": "yvrnjv",
    "title": "Where can I get doUSChebags tshirts?",
    "self_text": "I know there were sold last year but where are they rn 😔",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4267935361991227563
  },
  {
    "id": 364960,
    "post_id": "ymcavq",
    "title": "What should I first pass?",
    "self_text": "I am trying to get Chem 14b, Chem 14bl, Psych 100b, and Physics 5b. Not sure what I should prioritize. What do yall suggest",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1939124077062809266
  },
  {
    "id": 818908,
    "post_id": "z1hyua",
    "title": "Are there any places on campus w a CD reader",
    "self_text": "Title. Tryna get my disposable pics uploaded to a Google drive",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1497836729449184545
  },
  {
    "id": 626542,
    "post_id": "yvbqio",
    "title": "180 with Hsieh",
    "self_text": "How is he? Mixed reviews on Bruinwalk",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8013930075191852179
  },
  {
    "id": 309552,
    "post_id": "ykkc0n",
    "title": "Play some tennis",
    "self_text": "Anyone interested in hitting some balls? I have a utr rating of 10.5 and I'm also working on my itf coaching certification, so I'm open to a practice partner or players at any level of the game. Feel free to dm me!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5779840330694848399
  },
  {
    "id": 481431,
    "post_id": "yqbjq5",
    "title": "ashe nurse line",
    "self_text": "does the 24/7 nurse line at ashe still work? i've called multiple times and the first few it wouldn't connect me at all, then when i did connect and stayed on to talk to a nurse it just went silent. it said to hold for a representative, but i figured there would at least be like... hold music and not just dead silence...",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3989605355748433007
  },
  {
    "id": 838896,
    "post_id": "z24fxh",
    "title": "just saw a squirrel jump out of a trash can holding a can of 7up, lift it up to drink it, and immediately fall back into the bin",
    "self_text": "What are y’all feeding these blokes holy fuck",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 446989962672817064
  },
  {
    "id": 469584,
    "post_id": "ypy7uj",
    "title": "parking permit through babysitting job?",
    "self_text": "Has anybody living on the hill successfully obtained a parking permit through having a babysitting/nannying job? If so, what steps did you take?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6008766006160578676
  },
  {
    "id": 718084,
    "post_id": "yyde4z",
    "title": "to the girl screaming outside of hitch / centennial",
    "self_text": "pls shut up 😭 sorry ur breaking up w ur bf or ending a friendship, but not everyone needs to know that lol… it’s so inconsiderate & disrespectful. have that conversation in private! also telling someone they’ll have no one in their corner without you?? who says that",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7530344617666923493
  },
  {
    "id": 422678,
    "post_id": "yob5um",
    "title": "What are the job prospect like after graduating with a degree in Computational and Systems Biology?",
    "self_text": "Title^  Sincerely, a confused bruin <3",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8767245063863990906
  },
  {
    "id": 454840,
    "post_id": "ypff28",
    "title": "any recommendations for good bars and clubs in LA?",
    "self_text": "I’m a 22yr old transfer looking for safe and fun places to go out",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8701712138576746619
  },
  {
    "id": 436123,
    "post_id": "yotsc1",
    "title": "Com Degree Jobs",
    "self_text": "Hey I just graduated with a Communications degree and I am looking for a full time job. I’m also interested in grad programs and leadership development programs. Lmk if your job is hiring or if you know of any opportunities. Also, if you have a Com degree what direction did you take with yours? 🙏🏼",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3707767411888680373
  },
  {
    "id": 687455,
    "post_id": "yxdjz6",
    "title": "Buying 2 USC/UCLA student section tickets!",
    "self_text": "DM me, willing to pay $100-115",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7491379883323448823
  },
  {
    "id": 653845,
    "post_id": "yw99ti",
    "title": "bennoun or jukka for ls30b?",
    "self_text": "any advice would be appreciated!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3901159895096023569
  },
  {
    "id": 633448,
    "post_id": "yvj8dp",
    "title": "Lmk if anyone's dropping 5C or a 5B spot please!",
    "self_text": "I can also trade my spot in LS23L for this. DM me :')",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 396500109382024788
  },
  {
    "id": 574131,
    "post_id": "ytg2yd",
    "title": "I am interested in UCLA, but I had some issues in sophomore year in high school.",
    "self_text": "Hello, I am a student in Florida and I been highly interested in UCLA for being one of the best universities for psychology, the major I want to get, but during my Sophomore year I suffered from extreme depression and chronic migraines, that and taking 4 college level and honors courses made extremely difficult for me to keep up and I failed most of my grades for the first semester, I did better in almost every class except one, AP Statistics, during the second semester. My current GPA in Junior year is 3.24 unweighted and 4.2 weighted, my PSAT that year was 1260 and I waiting for the one this year, I feel I did way better so I am expecting a higher score. This year so far I have done way better since I have gotten used to the migraines and I have dealt with my depression to the best of my abilities. I have gotten almost all “A”s except for one “B” this past quarter for a mistake I made. I am expecting to get all A this quarter and the rest or close enough to that goal. I am taking two APs and one honors this year and have take some slightly easier classes in case I hadn’t been able to deal with my migraines. I expect to take some more APs next years. I am positive I can get higher than a 3.4 GPA before my senior year starts. Are my chances of getting into UCLA possible? Is there any scholarships I should be looking for that could help me or that I may meet the requirements for? Thank you, my school advisors aren’t that helpful, sorry for the long message",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2343652541419812758
  },
  {
    "id": 930083,
    "post_id": "z53uiy",
    "title": "Anyone wanna split an Uber for The 1975 concert on Monday (11/28)?",
    "self_text": "To and from the venue! I’m female and going alone so wondering if anyone would be down for this. PM me please :)  Edit: OR if anyone would be willing to let me carpool with them, I’ll help pay for gas and parking",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7678290660049694326
  },
  {
    "id": 502441,
    "post_id": "yr0rki",
    "title": "Any easy upper div class recommendation for general bio major?",
    "self_text": "Also, would anyone know how is geog 106 and eebiol 129?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3810327252968260123
  },
  {
    "id": 261458,
    "post_id": "yj149m",
    "title": "poli sci professors for winter 2023",
    "self_text": "Has anyone taken or heard of pol sci courses with any of the following professors: pagden, lohmann, blair, sherrer? If so, please let me know if you recommend these professors and why or why not. thank you",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 767613175361700076
  },
  {
    "id": 318134,
    "post_id": "yktbz7",
    "title": "Will academic probation affect my chances of being admitted as a transfer?",
    "self_text": "Hello! Im filling out my application for transfer and I got a bit worried when it asked about academic probation. My first semester of community College in 2018, I was put on academic probation. But I got back into \"good standings\" the next semester and was never on probation again after that. I got the deans honors too. I have a good GPA and my counselor said my personal insights are very strong, but will the academic probation from my first semester ruin my chances? 😭",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 983938082507536684
  },
  {
    "id": 545561,
    "post_id": "ysgaqc",
    "title": "Help with picking classes",
    "self_text": "Which class is going to fill up faster math31B or Econ 1? Or which one should I be selecting first in my enrollment appointment?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6468178188698583414
  },
  {
    "id": 529360,
    "post_id": "yrwc4c",
    "title": "harry styles carpool 11/11",
    "self_text": "hi! i’m looking for someone to uber / lyft with to the forum tomorrow! just send me a message pls!  harry styles love on tour 11/11 friday uber lyft general admission pit",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3691231583294682665
  },
  {
    "id": 545068,
    "post_id": "ysfmde",
    "title": "(VENT) To the person that elbow checked me on a scooter",
    "self_text": "Ayo I'm just here trying to walk and this person on a scooter just speeds past me and elbow-checks me.  Y'all are already spending fewer brain cells by just STANDING on a moving vehicle.  Can y'all at least pay attention to the other pedestrians?  I'm not asking for much.  Just don't fucking hit me while I'm walking.   Thanks <3",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2171932504360863971
  },
  {
    "id": 602069,
    "post_id": "yuff24",
    "title": "Best Bars for Bruin Football Games?",
    "self_text": "Hello all,  I am writing this post as I am wanting to gather some information as it pertains to best bars on campuses around the nation to create a website so college football fans know where the best bars are at for their favorite college football team.  Below are some questions I am looking for a response.  Best pregame bar before UCLA football games? Why is it the best pregame bar?  Best bar to watch UCLA football games? Why is it the best watch party bar?  Best postgame bar after UCLA football games? Why is it the best post game bar?  Any information is extremely helpful and appreciated. I can’t wait to see some of the responses.  Thank you",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2500171101496985551
  },
  {
    "id": 681098,
    "post_id": "yx66yl",
    "title": "Comm 1 Arbabzadah",
    "self_text": "What is the workload like in Comm 1 with Arbabzadah? Is the grading of the speeches easy?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8926221233282693159
  },
  {
    "id": 825595,
    "post_id": "z1pnyx",
    "title": "willing to pay for ling 1, 20, or psych 100a",
    "self_text": "plz hmu 😭",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2976074438271034503
  },
  {
    "id": 628019,
    "post_id": "yvdbwc",
    "title": "M151B vs. 116C",
    "self_text": "Is there a difference in material when taught by the EE department vs the CS? I’ve heard differing things",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8122226833982137134
  },
  {
    "id": 817782,
    "post_id": "z1gvav",
    "title": "Mimg 101",
    "self_text": "Hi guys, I don’t need to take this class but I should in case I decide to go to PA or nursing school. How difficult is it? Thank you",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7979025880587379064
  },
  {
    "id": 655594,
    "post_id": "ywbakg",
    "title": "classes cancelled bc of strike",
    "self_text": "all for the strike etc., but can i get a tuition refund or something for the cancelled classes?   already missed fridays class last week bc of veterans day, now found out we won’t have it this friday bc of strike, and next friday is thanksgiving break….",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5963650773796568079
  },
  {
    "id": 553406,
    "post_id": "ysp9qq",
    "title": "UCLA EDM scene",
    "self_text": "Are there any groups or people who are into Raves/Edm concerts? feels like no one here is into that’s stuff so I wanted to know",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5381203682228008282
  },
  {
    "id": 552078,
    "post_id": "ysns91",
    "title": "Go to class",
    "self_text": "I am seeing alot of posts on the reddit page telling people that they shouldnt go to class. I am a TA and i encourage the strike. I also encourage everyone to go to class as their education matters. Going to class is not considered crossing the picket line. Crossing the picket line is TAs holding discussions or Researchers working in labs. Going to the class that u paid for is not crossing the line and I recommend u go to it.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 536659758828835494
  },
  {
    "id": 481908,
    "post_id": "yqc7n7",
    "title": "usc vs ucla tickets",
    "self_text": "i am currently looking for 2 tickets to the ucla/usc football game pls dm if you are planning on selling any!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2042838596559747812
  },
  {
    "id": 999184,
    "post_id": "z7aok9",
    "title": "Looking for roommate for studio",
    "self_text": "Hey you guys I’m looking for a roommate for a studio. I’m a junior female",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7322017194718777746
  },
  {
    "id": 302186,
    "post_id": "ykc5l8",
    "title": "How good is Hyunki Min for math?",
    "self_text": "Thinking of taking him for math 33b but from what I know he’s a new prof teaching math 115a rn and has no reviews",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1354021560608037932
  },
  {
    "id": 469866,
    "post_id": "ypyjfy",
    "title": "Is anyone flying out of Burbank on 11/21",
    "self_text": "I’m looking for someone to split an Uber with",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3291404705894576877
  },
  {
    "id": 611592,
    "post_id": "yuqqw5",
    "title": "To Com Sci Majors",
    "self_text": "I've just basically finished my lower divs (35L next quarter) and am figuring out how to shuffle the following around:  CS M151B  CS 180  CS M152A  CS 111  &#x200B;  Would it be better to do M151B after 152A and 111? They're recommended pre-reqs. Considering doing it next quarter (taking 33 right now) but then I wouldn't have that OS or Verilog background for it.  Considering just taking CS 180 next quarter, M152A and 111 in Spring, and M151B in Fall. Would this be a better plan or taking M151B next quarter?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1129129833412573730
  },
  {
    "id": 260221,
    "post_id": "yizh17",
    "title": "spotify wrapped.... but for dining hall swipes",
    "self_text": "itll tell you your top 5 most swiped places, how many times you got meal vouchers, most ordered take out item, etc etc 😩😩😩😩😩",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1165715400397272847
  },
  {
    "id": 437905,
    "post_id": "yovpc6",
    "title": "Where to Find ASUCLA Nutritional Information?",
    "self_text": "I'm a gluten free vegan so i basically rely on nutritional information to eat. I can't seem to find information for any of the ASUCLA Restaurants though. Does anyone know? Also for the food trucks please. I can find some of their menus online but never what they actually serve at UCLA",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5135973278078432758
  },
  {
    "id": 547904,
    "post_id": "ysixa7",
    "title": "Second Interview for ADP",
    "self_text": "is this a good sign? what should i expect?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2658323406272571156
  },
  {
    "id": 389259,
    "post_id": "yn6pl7",
    "title": "Ateez Concert Honda Center 11/8",
    "self_text": "Hello! Me and my friend are going to the Ateez Concert on 11/8 and we’re looking for a ride or someone to split an Uber/Lyft with! Please let me know if you’re interested. We’ll chip in for gas if needed.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4300465379987950305
  },
  {
    "id": 277253,
    "post_id": "yjkeb9",
    "title": "halloween squishmallows at ralphs",
    "self_text": "$5.10 each for 12\"  I felt the duty to share this information   there is however, very little sale halloween candy",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6367899040825419876
  },
  {
    "id": 282271,
    "post_id": "yjpp39",
    "title": "Has anyone here ever done a (Bus) Econ major with Film minor?",
    "self_text": "Trying to work out some academic/career goals and would like to pm someone :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8853852922419674871
  },
  {
    "id": 606021,
    "post_id": "yukh6g",
    "title": "For Pol Sci students, do i have to take the part 1 of the class before i take part 2",
    "self_text": "What i mean by this is, for part 1 classes (early modern political theory, american political thought 1), do i have to take those classes first or can i take part 2 classes (american political thought 2, late modern political theory) and then take part 1 classes  i am asking this because the part 2 classes are not full while the part 1 classes are…  and the other classes offered have awful professors :(",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8151876235714673670
  },
  {
    "id": 518545,
    "post_id": "yrkwsq",
    "title": "Holding a class",
    "self_text": "Hi can someone hold me a spot in Econ 1 until nov. 15? I’m willing to pay 100+. I really need this class, so lmk if you can hold it. Price is negotiable. Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 389633346463789479
  },
  {
    "id": 943332,
    "post_id": "z5j3mz",
    "title": "love machine in covel/Ackerman",
    "self_text": "Are they open during thanksgiving weekend?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1147912931366160351
  },
  {
    "id": 682763,
    "post_id": "yx84i2",
    "title": "People who set 7 alarms and wake up just to snooze their alarms and sleep in for another hour, why?",
    "self_text": "I'm not annoyed; I just don't understand.  Either get up like an adult or skip class like a boss.  My roommate today had two alarms going off at the same time (multiple phones).  Kind of funny tbh.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6931356343269134699
  },
  {
    "id": 688207,
    "post_id": "yxeexj",
    "title": "Airpods",
    "self_text": "Someone left their AirPods on bruinwalk near Drake stadium",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5465408619610786908
  },
  {
    "id": 283794,
    "post_id": "yjr8ah",
    "title": "Target Parking",
    "self_text": "Anyone know how much parking is at target after the first two hours? ?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1729015689938821723
  },
  {
    "id": 357870,
    "post_id": "ym4zwl",
    "title": "CS 111 with Reiher?",
    "self_text": "Did anyone take the class with reiher? If so, how was it? Would u recommend taking him now over other professors? And do you know who usually teaches the class in the spring?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5662779807166893030
  },
  {
    "id": 431438,
    "post_id": "yondby",
    "title": "Questions about study abroad? Feel free to ask me :D",
    "self_text": "I’m currently studying abroad in Berlin through UCEAP and am having an absolute blast! I remember that around this time last year I was applying for programs so I wanted to give back - feel free to ask me any questions you might have",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9097463860726591292
  },
  {
    "id": 313182,
    "post_id": "ykoc8j",
    "title": "To all skateboarders that rode to class this morning, RIP your bearings",
    "self_text": "Also if you’re the dude that was zooming down bruinwalk on an e-skateboard to Wooden, I hope you’re doing okay. You took a pretty bad fall while going like 20mph.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3826425866189658135
  },
  {
    "id": 522665,
    "post_id": "yrpf6t",
    "title": "Do Foreign Language classes offer pte numbers?",
    "self_text": "P.S this is a small class about 20 btw and I already completed the first course",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2560112903773364900
  },
  {
    "id": 577250,
    "post_id": "ytjhk4",
    "title": "Any places with good tutoring nearby?",
    "self_text": "Asking for a friend haha but said friend has a midterm for 31A Calculus on Friday and they think they need a little extra help. Anyone know of any recommendations on or off campus? Would prefer in person. TIA",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 738819453604467724
  },
  {
    "id": 452048,
    "post_id": "ypbjrv",
    "title": "Raising Money in Gayley Heights",
    "self_text": "Hi everyone. I'm trying to raise some money to pay for college expenses by delivering drinks and snacks (in Gayley Heights only). If anyone wants to buy something I'm doing this 8pm - 10pm every day: bazzled.com",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4127255345136395392
  },
  {
    "id": 599737,
    "post_id": "yucafo",
    "title": "To the striking TAs",
    "self_text": "This'll be an unpopular opinion on this sub, but I know it's an opinion many other undergraduates, and even some TAs I've talked to, share with me.  You are a graduate student. You're here studying ... whatever. Doing research on .... whatever. You're doing this because you're interested in learning it, for whatever reason - post-graduate academia or industry.  You TA for one class (as far as I know), and you hold one 1-2 hour discussion section a week along with 2 hours of OH every week. On a different post, I saw a TA state that they work 15-20 hours a week. That's great. You get paid for 20 hours a week. There's 3 quarters, 10 weeks long, plus finals week, plus let's add a week after finals week just to be safe, that's 36 weeks total. You make approximately $26k for it. 26000/36/20 = $36/hr. If you're a GSR, you get paid even more. You even get paid for your research. On top of that, your tuition is subsidized (as far as I'm aware, if you're in Engineering at least).  You're a student, doing research (and getting paid for it), and working a part-time job besides (and getting paid quite heavily for it), and you want more.  Again, you're a student. You signed up for this. You went to graduate school. You wanted this. In a few years, you'll reap the rewards. For now, this is your situation. You cannot expect more from this when this is a situation you put yourself in to further yourself in life. It's not about how expensive rent is. We all know rent in LA is expensive, but you put yourself here. Take some responsibility for your situation. It's benefiting you to be here, and deep down, you're doing it for no one else.  You want to get paid more? For what? For rent? The solution there is to have the university offer housing, as it does for undergraduates, not an increased demand of $$$ for the amount (20 hrs/wk) that you work that you already get reimbursed for quite generously.  This strike isn't taking anything away from you, but it's taking everything away from us undergraduates. For that reason, in my mind, this strike is a completely entitled, selfish thing to do. Convince me otherwise, but that's where I stand.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7000029270446325331
  },
  {
    "id": 679979,
    "post_id": "yx4wto",
    "title": "usc game ticket",
    "self_text": "much like everybody else, i am also looking to buy some usc game tickets, lmk if you have some 🥲",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1269094313042088562
  },
  {
    "id": 683647,
    "post_id": "yx94ra",
    "title": "Andre watching lines of people parade down Bruinwalk complaining about getting money unfairly taken away from them",
    "self_text": "&#x200B;  https://preview.redd.it/0ankajmn8e0a1.png?width=307&format=png&auto=webp&s=63a11f61856b3b36a87b92b9a7e75b99d11496da",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 888705647047580076
  },
  {
    "id": 388661,
    "post_id": "yn5zj2",
    "title": "Fun things to do with visiting college friends",
    "self_text": "I’m a freshman and one of my friends is coming to visit from SLO. Does anyone have any ideas for cool things to show off LA/UCLA? Preferably in walking distance :p",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8807265012832657774
  },
  {
    "id": 522799,
    "post_id": "yrpkjy",
    "title": "Holding PIC 10C",
    "self_text": "Hi is anyone able to hold PIC 10C for me until Monday 11/14? I really really need this class and am absolutely open to paying, price negotiable. You have to have taken 10a and 10b in order to enroll, but please lmk if interested, thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8566363864313105050
  },
  {
    "id": 538660,
    "post_id": "ys6m41",
    "title": "Soc majors: easiest methods course",
    "self_text": "I have dyscalculia (a math learning disability) and so I’m anxious about the 1 methods course I must take for the major. What is the easiest methods course? I’m enrolled in social networks rn but am considering if conversational structures would be easier",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2733028975031229601
  },
  {
    "id": 331894,
    "post_id": "ylanv5",
    "title": "The Study: Saturday Hours",
    "self_text": "Is the study’s studying area open Saturday morning? I know the food area isn’t. I got a zoom at 8 AM and I don’t wanna disturb my roommates if it requires me to speak lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7696094124438606137
  },
  {
    "id": 584540,
    "post_id": "ytri10",
    "title": "Guys on bruindating are interesting.. to say the least",
    "self_text": "So i decided to try it out, and I'm surprised that most guys were rather gentlemanly, charming and kind.  Sure, some were plain boring but at least no one sent any d pics although some had to flaunt their chest pics or their material wealth for some reason.   Finally, I actually went on 4 dates that were pretty decent! Honestly I'm just surprised that guys on Reddit (at least here) weren't the incel or virgin weirdos that media portrays.  Not sure what the point of this post is, just wanted to let it off my chest",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 725770777656635899
  },
  {
    "id": 474332,
    "post_id": "yq3ew0",
    "title": "Graduating Early",
    "self_text": "I just ran my DARS and saw I have senior status. I am totally down to graduate early but does anyone know the process for that?   Also is it true you can graduate spring even if you have a class or two you’re planning to finish and take over the summer?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2324064223410896189
  },
  {
    "id": 811075,
    "post_id": "z19lzf",
    "title": "I made a website specifically for sharing stories in support of UAW 2865 Strikes",
    "self_text": "Hey guys,  I was inspired by the recent strikes and drove to UCI as soon as I could last Monday. Spoke to couple of you guys and the UAW leaders about housing as I'm a big geek on improving housing for all and how we can go about that.  I've noticed some of the personal stories should be shared and more recognized, so I created a forum for people to anonymously share what they've experienced so we can create awareness and do something about it. Completely anonymous accounts not tied to any reddit or other social media platforms.  https://studentrefuge.com/  I'm also hoping it'll be a meeting place for whenever we need it if the strikes stop for whatever reason (we're gonna keep fighting though!).  *edit: added a useful social media post filter app where you can get the latest news from all of UAW's social media posts.  https://studentrefuge.com/forums/uaw-uc-social-media-feed.21/?directtosearch=1  &#x200B;  Let me know if there are any topics I can add on there. To the moderators of UCLA's subreddit, would love to give you moderator permissions on my site, please reach out.  See yall on Wednesdays when I'm free again. Going to be out there with you again but this time holding a sign.  &#x200B;  Last Monday meeting after the strike at UCI.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6749367748880361374
  },
  {
    "id": 633236,
    "post_id": "yvizz6",
    "title": "Math 170S, Tianqi Wu",
    "self_text": "Has anyone taken Prof. Wu's math 170S? Could you go over the class workload, midterm/ final exams difficulty, and his grading scheme? Are lectures clear and easy to understand?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8337214170005457012
  },
  {
    "id": 305869,
    "post_id": "ykfzeo",
    "title": "Class help",
    "self_text": "Thinking of taking MATH 31B, CS 32, and MATH 32A for winter. Is this doable? Thank you in advance!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7204591665282923753
  },
  {
    "id": 795976,
    "post_id": "z0rxnr",
    "title": "PSYCH 120A",
    "self_text": "If someone plans on dropping this class, please pm me!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 679638825033783384
  },
  {
    "id": 734036,
    "post_id": "yyvc5j",
    "title": "Math 61 w/t Mariana Vicaria or Kim Tuan Do?",
    "self_text": "I checked Bruinwalk... no info on either of them. The web has very little info about them, but I like Do K's website, that's funny lol.   &#x200B;  Any advices, experiences with either of them?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4999560836124093784
  },
  {
    "id": 604773,
    "post_id": "yuj30v",
    "title": "holding a spot for stats 13",
    "self_text": "would anyone be willing to hold a spot for me in the TR 9:30 lecture for stats 13?? i’m willing to pay or swipe someone in lol. would be very appreciated :))",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8961007321934029217
  },
  {
    "id": 611163,
    "post_id": "yuq7ae",
    "title": "Will there be people on campus tomorrow?",
    "self_text": "Are people still attending classes and all that, or has the strike affected that?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3099889344262232223
  },
  {
    "id": 336252,
    "post_id": "ylf9vq",
    "title": "tung physics 5 series",
    "self_text": "if youve had tung for any 5 series course in person does he do exams during lecture? i might have an overlapping discussion next quarter (taking 5c with him) n just want to find out",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4022155528824193913
  },
  {
    "id": 637999,
    "post_id": "yvo7cb",
    "title": "holding chem 14BL for me",
    "self_text": "could someone who's taken chem 14B possibly hold chem 14BL for me plz! would be a huge help as all my classes are filling up ahh, thank you!! message me ASAP",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9199012811117017426
  },
  {
    "id": 629514,
    "post_id": "yveysg",
    "title": "Conflicted about strike",
    "self_text": "I fully supported the staff strike that occurred last year. Those university employees are significantly underpaid and, in my view, were taken advantage of by the university. They also work full time jobs. These are people's (potentially life-long) careers and they deserve commensurate compensation for themselves and their families. I also fully believe that lecturers here are significantly underpaid and mistreated while essentially doing the same job as full-time professors. But I'm more conflicted about striking of TAs and GSRs.  24k is an unacceptable amount to pay someone for a full time job -- but being a TA is not a full time job. As others on this sub have attested, the workload varies from 15-20 hours a week, which means most TA's hourly compensation is actually excellent. The vast majority of grad student's tuition is also covered by the university in exchange for research. Ostensibly, the tuition for these programs would normally run somewhere between 20-50k. Therefore we can deduce that most TA's really make between 45-75k a year, assuming their grad programs' tuition is covered.  Getting a PhD/Masters is also a privilege: these degrees usually to high-paying, even lucrative careers. No one is forcing anyone to go to grad school -- people apply here on their own whim to study, do research, graduate and then advance their professional careers (and make money). TA jobs are transitory (not permanent) jobs, and grad students get them without any prior teaching experience. Grad school is also out of reach for the vast majority of Americans: most people need to start their professional careers immediately out of undergrad (or graduate with student loan debt). Many people work low paying public service jobs or join the military to get government aid to subsidize their grad school education.  In my opinion, there is a distinction between underrepresented blue-collar workers striking for fair treatment and compensation, and graduate students demanding more pay for what is essentially part time work. I fully believe graduate students are essential to the function of the university, and maybe they should be paid more than 24k. I'm sympathetic to grad students who struggle financially. However I'm not sure the current salary demand of 55k for 15-20 hours of work per week is a realistic or fair ask (the post-doc lecturer pay demand of 70k I fully agree with).  Please let me know if I'm misinformed...",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2356373771430625445
  },
  {
    "id": 454202,
    "post_id": "ypebzc",
    "title": "Hue Bridge/ethernet IOT device setup help",
    "self_text": "Does anyone have experience setting up a hue bridge in the dorms/apartments or have experience with setting up ethernet devices on the RES_IOT network?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 496081557108507447
  },
  {
    "id": 281892,
    "post_id": "yjp93d",
    "title": "Psych 110",
    "self_text": "Has anyone taken Psych 110 with Trott? What are your thoughts? Also if any one has taken 110 in general how was it?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4193813909194305291
  },
  {
    "id": 340645,
    "post_id": "ylk9wg",
    "title": "Psych 115 w/ Adhikari",
    "self_text": "Can anyone give insight into psych 115 with him? How are his exams?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2427308606903963380
  },
  {
    "id": 862215,
    "post_id": "z2vtqz",
    "title": "Anyone willing to sell or drop Public affairs 10 or 30?",
    "self_text": "I am trying to get into one of theses public affairs courses but 10 was already full before i could try and my laptops wifi screwed me over this morning when i tried for 30. If anyone is willing to generously drop either please let me know, im also willing to pay as well",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1054845571531670941
  },
  {
    "id": 877739,
    "post_id": "z3casb",
    "title": "Is anyone else unable to…",
    "self_text": "drop a course for the winter quarter?  Keep getting an error message…",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5698292246315069964
  },
  {
    "id": 929930,
    "post_id": "z53my8",
    "title": "is power turned off in the dorms during winter break?",
    "self_text": "do i need to empty my fridge?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6177392829527858004
  },
  {
    "id": 693847,
    "post_id": "yxlqb9",
    "title": "Dear Everyone,",
    "self_text": "It's quiet hours, stfu.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3453546502700404893
  },
  {
    "id": 628229,
    "post_id": "yvdje0",
    "title": "Mixed messages about strike",
    "self_text": "Why are some people saying undergrads should skip their regular lectures and not even go to campus because that would be crossing the picket line?  Others are saying it’s fine to go to classes held by professors as long as you’re not expecting your TAs to be teaching/working.  Imo skipping class (unless you’re coming to campus to actually stand with the TAs) doesn’t help the strike at all and is counterintuitive for everyone…  It’s confusing why there are such mixed messages on this.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4808940200454778563
  },
  {
    "id": 579863,
    "post_id": "ytmheu",
    "title": "Football Tickets",
    "self_text": "hi is there by chance a groupme of some kind that re-sells football tickets. I'm trying to cop some ucla usc football tickets.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4348089850879613353
  },
  {
    "id": 479850,
    "post_id": "yq9gpm",
    "title": "Hold a Class",
    "self_text": "I will pay $30 or more (negotiable) if someone can hold a spot on Phy Sci 13 Lab Section 1A, just until November 14th. DM if interested.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2003585597703464775
  },
  {
    "id": 706955,
    "post_id": "yy17qt",
    "title": "i know this is a long shot",
    "self_text": "but plssss let me know if you are thinking about dropping MCDB M140!! I really want to take this class for grad school (and general interests)!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1464696635111128868
  },
  {
    "id": 1036096,
    "post_id": "z8j9kj",
    "title": "Parking",
    "self_text": "I’m thinking about bringing my car next quarter. Are there any apartments or garages that sell parking spots for non residents?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4858841062729973724
  },
  {
    "id": 312133,
    "post_id": "yknbsq",
    "title": "still struggling with the wifi",
    "self_text": "does anyone else have to fight the urge to cry when both your university apartment and every ucla study spot you know and love provides you with no wifi connection whatsoever and then you spend the next 10 minutes trying to regulate your emotions and not resort to tears as you lose entire hours of work because not even your hot spot works? is that just me",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6948936468792617197
  },
  {
    "id": 837986,
    "post_id": "z23hkn",
    "title": "What do you think will happen to all the Nic addicts?",
    "self_text": "Given that there was a ban on all flavored vape products in California, do you think people will resort back to cigarettes?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4250553968393790181
  },
  {
    "id": 736859,
    "post_id": "yyy5sn",
    "title": "Found Bruin Card!",
    "self_text": "I found a Bruin card in front of the Semel institute near the ucla hospital for Ryan Wang! If you are him or know him please let me know so I can get him the card!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3515776196028881344
  },
  {
    "id": 894147,
    "post_id": "z3w3kk",
    "title": "Anyone on campus got an airfryer?",
    "self_text": "Really wanted to cook some food for tonight but couldn’t reserve hitchen:/",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8015781912581383838
  },
  {
    "id": 354606,
    "post_id": "ym1l0o",
    "title": "enrolling in classes with finals 30min apart",
    "self_text": "has anyone ever done this? would you strongly recommend against it or was it not that bad?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2063031771356822822
  },
  {
    "id": 711771,
    "post_id": "yy6fxa",
    "title": "cs 188 w/zhou",
    "self_text": "is it recommended to take cs 188 w/ beginner python knowledge? I'm math of comp & need cs upper divs lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2372693775967495137
  },
  {
    "id": 834855,
    "post_id": "z20gp1",
    "title": "ive noticed hella ppl on scooters getting tickets from police",
    "self_text": "what are y’all getting ticketed for? 😭😭 it’s been happening so much lately I literally scooted past a cop giving one out on midvale yest and it’s making me scared to ride my scooter",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3415695925215693601
  },
  {
    "id": 256847,
    "post_id": "yivw3m",
    "title": "Best Building for Single Pods?",
    "self_text": "Which buildings on the Hill with single pods (single dorms) have the best view?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 50512564384129225
  },
  {
    "id": 450945,
    "post_id": "ypaahr",
    "title": "How long does a replacement Bruin card take to arrive?",
    "self_text": "I think I lost my Bruin card and will probably need to get a replacement. How long will it take them to print it out and get it to me? Or is it instantaneous?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3424838049282282207
  },
  {
    "id": 445965,
    "post_id": "yp57na",
    "title": "STEVE LACY UBER",
    "self_text": "is anyone going to steve lacy on friday at the greek theatre and want to uber together",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7379695776814796037
  },
  {
    "id": 290770,
    "post_id": "yjz4mj",
    "title": "Makerspace",
    "self_text": "Can I go design a t-shirt in the maker space? I remember someone saying they’ll even let you use a free t-shirt but i don’t know anything about what i need to bring or where it is",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7191648016312511634
  },
  {
    "id": 476420,
    "post_id": "yq5noe",
    "title": "NEUROSC-179",
    "self_text": "Hi! I am an exchange coming to ucla for winter and spring quarters. I was wondering if anyone had a NEUROSC-179 course syllabus with them which they could send me because I need it to get it approved for a course equivalent at my home university. I have already tried looking for it in ccle system and emailed the prof but haven't gotten a response and it is locked in ccle. I would appreciate any help!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 236200946630460719
  },
  {
    "id": 345531,
    "post_id": "ylp9jq",
    "title": "service",
    "self_text": "literally no service for the past few hours",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5420528545962403696
  },
  {
    "id": 602320,
    "post_id": "yufs5k",
    "title": "Why exactly are TAs striking?",
    "self_text": "They make $26k a year for a 20/hour a week part-time job (though realistically less) that is 36 weeks a year (generously), coming out to >$36/hr. I am not counting research or academia. GSRs get paid more on top of that.  In the end, TAs are students too, and they’re here to learn, get a better degree, and move themselves up in life.  Why exactly is there this expectation that they be paid more for this little work that they do when they are students too and here for their own benefit? They even get their tuition subsidized (in Engineering) as far as I know.   It’s kind of ridiculous to ask for more than that. You’re pursuing your Master’s/PhD and have this part time job on the side where you’re making good money per the hour (more than most people ever make). Why is there this expectation of more? I genuinely do not understand.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1500197390411023559
  },
  {
    "id": 718861,
    "post_id": "yyeju3",
    "title": "is there isolation housing for university apartments?",
    "self_text": "title. just tested positive on rapid.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2674813796422919008
  },
  {
    "id": 682264,
    "post_id": "yx7ix9",
    "title": "Lost Airpod Case",
    "self_text": "I lost my airpod case this morning on campus probably outside Anderson Cafe. It has some stickers a d one has my full name on it. I have tried to use find my devices on my phone and have asked around but have not been able to find it yet. Please let me know if anyone has seen it or turned it into somewhere.  Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6188830830102235193
  },
  {
    "id": 257465,
    "post_id": "yiwhf7",
    "title": "Covel piano",
    "self_text": "Whoever is playing anime openings on the piano by Covel, you’re amazing",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 733596596994140702
  },
  {
    "id": 506752,
    "post_id": "yr52id",
    "title": "Poli Sci Department is useless",
    "self_text": "Why is the poli sci department so fucking useless? I have been trying to reach a counselor or anyone in the poli sci department this entire quarter.   Now I can't fucking register for classes because they still have not approved my major application. idk wtf to do, I've literally tried everything, have even been stood up in-person and zoom meetings. Does anyone have some advice for me? This is beyond infuriating, I will not graduate on time if I can't register for the classes I need next quarter.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3889510287451737237
  },
  {
    "id": 270810,
    "post_id": "yjd1af",
    "title": "rubin for chem? advice?",
    "self_text": "i'm thinking of taking chem 30b with rubin, and almost all of his reviews are from 2006 and say he's terrible. has anyone taken rubin recently? any input on his classes?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2616944056541518
  },
  {
    "id": 454050,
    "post_id": "ype4hm",
    "title": "Is anyone selling their ticket to the usc game?!",
    "self_text": "Im dying to go so help me out!! :)))",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7674604073816068417
  },
  {
    "id": 865247,
    "post_id": "z2yrc6",
    "title": "Welcome to uni apartment (Tipuana)",
    "self_text": "Left behind some “presents” before going home for thanksgiving. I love my roommates.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6427295161290778266
  },
  {
    "id": 557178,
    "post_id": "ystc48",
    "title": "Math 33A with Hatice Mutlu-Akaturk",
    "self_text": "Has anyone taken classes with Hatice Mutlu-Akaturk? Is it worth taking now or waiting for future quarters? She and Wang are the two options for 33A atm but Wang's lectures overlap with my other classes.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2533102477356762238
  },
  {
    "id": 937938,
    "post_id": "z5do1a",
    "title": "How is this as an option?",
    "self_text": "So I am an IB Student from India. I am considering a variety of options for college, but UCLA is my dream school, and I know for sure I will not get admission rn cuz of my stats (31/45 predicted, if anyone could let me know about a good ib predicted to have for UCLA, that would be good too), and I am trying to save money as well.   I am considering taking a year off and doing Community in the bay area and transfer from there to UCLA. Is this a common occurence? and How hard is it. I am currently applying for polisci, so I'm wondering how difficult that is to get in as well, provided that I am able to quality for in-state. Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 970435463519989139
  },
  {
    "id": 415055,
    "post_id": "yo302c",
    "title": "CCC to UC transfer requirements",
    "self_text": "Do I have a chance to be accepted into UCLA, I am a transfer student and my major is Biology, I have a 4.0 GPA but I am missing one semester of organic chemistry which is a prerequisite that I won't be able to take before transfer. I will be taking chem 200 this winter and chem 202 for spring which gives no room for chem 206 (organic chemistry) before transfer. Due to this will my application be denied? and is there any way I can maximize my chances of being accepted?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1030234887008851631
  },
  {
    "id": 373841,
    "post_id": "ymmltq",
    "title": "First pass?",
    "self_text": "Which classes should I first pass? Im planning on taking Math 33A, Chem 14B, LS 7B, and Frnch 1 & any advice would be great!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8047803133669185925
  },
  {
    "id": 429991,
    "post_id": "yokzwj",
    "title": "David Hamilton or Zhongbo Kang for PHYSICS 1C?",
    "self_text": "Reviews are very positive for both of them, and I’m torn between the two.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6419965335065156477
  },
  {
    "id": 811121,
    "post_id": "z19n1u",
    "title": "PSYCH 137C with Bradbury?",
    "self_text": "Anyone taken this class? How was it?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7673243709558086692
  },
  {
    "id": 631513,
    "post_id": "yvh6bf",
    "title": "What’s the deal with housing??",
    "self_text": "I need to switch out of my dorm into a uni apt cause I need a kitchen- like I have medical reasons for needing a kitchen. I can do an emergency switch but why the fuck is my RD telling me I can’t choose what room I want?? My friend has this one roommate that’s graduating at the end of the quarter so there will be a vacant spot but my RD said I can’t chose to go there until the room swap period. WTF I am calling housing tomorrow. I’m not giving up just yet. This is ridiculous. There will be a vacant spot after the quarter ends but for some reason I have to go through this bullshit long process to get it?? Landlords are less restrictive than campus housing FFS.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6590410032600542218
  },
  {
    "id": 358807,
    "post_id": "ym5w0o",
    "title": "where can i find a chem tutor for high school student?",
    "self_text": "my coworkers son needs help w his chem class and she asked me to see if i can find a tutor from school for hire. is there a department list or somewhere i can go to ask? or put up on bulletin?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2235122373605978042
  },
  {
    "id": 808583,
    "post_id": "z1730g",
    "title": "How do I buy basketball tickets without a den pass?",
    "self_text": "Basically title. I don’t have a den pass and I’m looking to buy men’s basketball tickets, but I can’t find the student tickets online. Thanks.  Edit: i walked right into this but pls stop spamming me with dms",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2909800293350212645
  },
  {
    "id": 386978,
    "post_id": "yn45uz",
    "title": "Physci 107",
    "self_text": "Hi  So I totally bombed midterm one of physci 107 and I noticed a lot of people don’t post about grades but I was wondering how common it is for people to not do well on those midterms. Also how likely is the class to get scaled. Thanks.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6519967897594674157
  },
  {
    "id": 385039,
    "post_id": "yn20oo",
    "title": "Lectures for Physics 5C (Tung) and Psych 115 (Adhikari)",
    "self_text": "I’m assuming that lectures for both of these classes are recorded, but I was wondering whether lecture attendance was mandatory/monitored in any way. Like do they do clicker questions, or give you extra credit for attending (I rmr Tung doing this when J took him for 5A, but I wasn’t sure if that was just an online thing)?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2384988707129806799
  },
  {
    "id": 874446,
    "post_id": "z38jba",
    "title": "Anyone dropping Psych 100A?",
    "self_text": "I need this class this quarter I'm willing to pay! plz hmu 😭",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7178351760284123516
  },
  {
    "id": 612825,
    "post_id": "yushsc",
    "title": "Yang, Ding, and Liu for Pic 10A",
    "self_text": "If you have any of these profs, would you please go into the grading structure/teaching styles from what you’ve seen so far?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 524341411935542746
  },
  {
    "id": 623705,
    "post_id": "yv8m02",
    "title": "Picket Line Clarification",
    "self_text": "Is there an actual picket line that we shouldn’t cross to show solidarity? It seems most of them are forming circles around things that aren’t buildings etc.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 149855376464640341
  },
  {
    "id": 745958,
    "post_id": "yz82qy",
    "title": "Classes before Grad qstn",
    "self_text": "I'm graduating spring 2023, but I am able to finish my DARS and required classes in winter 2023. Would I still be able to attend school and sign up for classes during spring 2023, given that I am done with everything?   I would like to still be a student till spring 2023 due to housing and financial aid and I'm not sure if this would affect it.   I also want to take some fun and interesting classes without much stress before I graduate",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 688512145773406749
  },
  {
    "id": 975091,
    "post_id": "z6j4y5",
    "title": "MCDB 50 w/ Lee",
    "self_text": "has anyone taken MCD Bio 50 with Lee recently (in-person?) Was it hard? It seems like the class was much easier during covid but I was wondering if the prof switched back to before-covid ways of teaching?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1529379977793538872
  },
  {
    "id": 435813,
    "post_id": "yotf38",
    "title": "roommate came home last night and got puke on my towel, would it be okay if I asked her to wash it?",
    "self_text": "title basically, came home last night after throwing up and went to shower, got it on my towel. there’s not a lot but it’s kind of… in there and i don’t know if there’s more besides the chunks of food i can see (sorry) and i don’t really want to touch it",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3951049837524807900
  },
  {
    "id": 518959,
    "post_id": "yrlfcv",
    "title": "Lectures during TA strike",
    "self_text": "Just to be clear, I know we aren't supposed to go to discussions to support the TAs, but are we supposed to skip lectures too? Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6246491368504373661
  },
  {
    "id": 453679,
    "post_id": "ypdmnz",
    "title": "Can med schools see if you have extended time on exams due to CAE?",
    "self_text": "I am worried it might be viewed as an \"advantage\" if I pursued extended time on exams, even though right now I am at a complete disadvantage compared to my peers who can get through an exam like normal.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 728666455064434295
  },
  {
    "id": 701356,
    "post_id": "yxvky8",
    "title": "music at rieber at 4am",
    "self_text": "hi so i live in terrace, and the workers at rende start playing music at around 4am-6am+ on the outside speakers most days. it always wakes me up, and i'm kinda at my limit at this point lol. is there any way to get them to stop/ someone to complain to?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7634088924601022565
  },
  {
    "id": 686664,
    "post_id": "yxcnsf",
    "title": "Research Revealed Undergrad Research Prep Program",
    "self_text": "Anybody done the Research Revealed Undergraduate Research Preparation Program (for humanities)? What did the program consist of and did you feel it actually prepared you to do research? Did it give you connections to actually start doing research? Was it worth your time? Was it competitive?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2217187186834381172
  },
  {
    "id": 421990,
    "post_id": "yoaf2u",
    "title": "Min for Math and Bauer for Physics",
    "self_text": "If anyone's had either, please let me know what you think of them!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7613349281640364340
  },
  {
    "id": 356751,
    "post_id": "ym3unv",
    "title": "I need a LS7B bio tutor!",
    "self_text": "How can I find a one-on-one tutor for hire that has taken the LS7A-LS7C series at ucla? I know that the school has tutoring resources but I’m looking for something a little more personal and focused. Please let me know!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7280498823903741978
  },
  {
    "id": 783598,
    "post_id": "z0dzu4",
    "title": "beeping on kelton",
    "self_text": "i live on kelton and there has been a beeping noise going off since ~5AM. it beeps every 3 seconds and has not stopped AT ALL. i have no idea where it’s coming from, does anyone know what it is/where it’s coming from?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7320642233425739197
  },
  {
    "id": 316815,
    "post_id": "ykrt8d",
    "title": "Gym buddy",
    "self_text": "So I am a beginner to the gym, (I kinda know a few things but not enough). I’m a second year girl and I was wondering if any girls would be interested in being gym buddies!!! Lmk:)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7033792788792481633
  },
  {
    "id": 692603,
    "post_id": "yxjx1p",
    "title": "LS30B Lecture 3 + Any W/F Discussion",
    "self_text": "Hi guys! Just wondering if anyone would be willing to sell their spot to me? I goofed mega hard on enrollment, and am kindly requesting a spot in the class 🙏 Send a DM if you’re open or not in a rush to take the class! Tysm <3",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3643616942923199331
  },
  {
    "id": 709809,
    "post_id": "yy4cbe",
    "title": "Does anyone personally know some of the UCLA T-shirt contest finalists??",
    "self_text": "I tried looking for the people who created the Powell cat t-shirt designs (I will literally buy them all), but I can't find them on social media :,((( I just wanna support the artists if I can, I love their work",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2087251247715031212
  },
  {
    "id": 367499,
    "post_id": "ymf5m7",
    "title": "Hsa or core plan health insurance",
    "self_text": "For those who work for ucla, did you guys with the hsa or core plan and why?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3077600647079467370
  },
  {
    "id": 282197,
    "post_id": "yjplul",
    "title": "ateez concert!:0",
    "self_text": "is anyone going to the ateez concert? if so please hmu🫡",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3264007264291837991
  },
  {
    "id": 676036,
    "post_id": "yx0g6n",
    "title": "Need Physics 5A",
    "self_text": "If anyone is dropping it, please let know, had a bad enrollment time and it filled before I could get it. Would really appreciate it !",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1313370536168192029
  },
  {
    "id": 872371,
    "post_id": "z36d57",
    "title": "Got no plans for thanksgiving",
    "self_text": "Anyone down to come over and play some cards or games, have dinner. Recently got a card set of Shadow Era I want to test out. If interested, shoot me a DM.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8177824322910244169
  },
  {
    "id": 794019,
    "post_id": "z0pfqx",
    "title": "mgmt 108",
    "self_text": "can anyone hold mgmt 108 for me like RN!!! i will compensate",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4213857953060284935
  },
  {
    "id": 583222,
    "post_id": "ytq2bu",
    "title": "“Why is there a strike?”",
    "self_text": "I’m seeing lots on anti-union and misinformation regarding the strike on this subreddit. The strike is a direct result of  unlawful  behavior by UC. I’ve copied a previous comment I made which includes information regarding the strike—as well as how we got to this point.  There are copious documents, outlines and discussions on what UC has done to warrant a strike. This strike is a federally protected strike as UC has acted illegally in bargaining—which is why UC won’t attempt to stop it even though there is an anti strike clause (because they know it’s protected and they broke the law).  Document explaining the disparities of the unions’ demands and UC’s offers: https://www.fairucnow.org/wp-content/uploads/2022/11/UCOP-Update-Response-2022-11-10.pdf  UAW Powerpoint outlining the purpose of the strike and what UAW does: https://docs.google.com/presentation/d/11AsUP9NcVjirdWlIMxRX3IS8zxk-AcAo6chbxzNPfzs/edit  In short the reasons for the strike include:  -UC made unilateral changes to working conditions without negotiating  -UC refused to provide necessary information for negotiations  -UC obstructed the bargaining process (this contract has been in bargaining for over a year now) through failures to show up, deliberate attempts to mislead and stall as well as coming completely unprepared to bargaining meetings.  As a result, Academic Workers have filed 27 charges against UC with the Public Employee Relations Board (PERB), that status of which (and exact charges) can be seen here: https://www.fairucnow.org/ulp/",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4269656589539419388
  },
  {
    "id": 627546,
    "post_id": "yvcts4",
    "title": "Calling an Engineering student for help !!!",
    "self_text": "I really need to use solid works to design a plate for my lab. But I am a biochem student and they are not letting me use the seas net lab computers to use solid works! I am very fluent with the software I just need to use it to make a design. Is there anyone who can come with me to the seas lab in BH2nd floor and log me into one computer. Please let me know  This can really help me out",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4249308509231521982
  },
  {
    "id": 924982,
    "post_id": "z4x003",
    "title": "2022 JLPT Carpool",
    "self_text": "Would anyone like to split an Uber to the 2022 JLPT exam at CSULA on Dec 4?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8381963086945588689
  },
  {
    "id": 276460,
    "post_id": "yjjiks",
    "title": "Will the enrollment software prevent me from enrolling in a class that has its discussion overlap with another class?",
    "self_text": "I'm trying to avoid an 8 am. Will I be allowed to enroll in a class that has its discussion overlapping with  another class?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8007056877766597920
  },
  {
    "id": 657679,
    "post_id": "ywdmdy",
    "title": "@UAW - strike all that you want, but why are you guys walking around buildings with loud speakers and smashing classroom’s windows and doors 😭",
    "self_text": "I’m all in for the protest but it’s against the admins, not teachers and students who wanna just continue their normal routine.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2496261140393674437
  },
  {
    "id": 631718,
    "post_id": "yvhect",
    "title": "advice needed! public health minor/public affairs minor",
    "self_text": "poli sci student (second year) trying to find something to minor in. Planning to go to law school and interested in medical malpractice. Is public health minor pretty good to pursue? or should i just go for the public affairs route",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7549433521076301816
  },
  {
    "id": 980629,
    "post_id": "z6p0z6",
    "title": "Truthful Tuesday?",
    "self_text": "Why don't we all spill our deepest tea here (on Reddit or on this post even, whatever) on Tuesday, with names censored of course.  Just as a fun idea. What could go wrong 🤔? Or what could go VERYY wrong 🤭🙈???  Hehe looking forward to a hell of a Teas-usday this week 10 😝🤯🤯",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7966526173685189617
  },
  {
    "id": 625582,
    "post_id": "yvaneo",
    "title": "Space Invaders Wallet at BCafe",
    "self_text": "Whoever left their wallet at BCafe I dropped it off at the Sproul Front Desk :D",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6787957407970964830
  },
  {
    "id": 450773,
    "post_id": "ypa3vs",
    "title": "harry styles....",
    "self_text": "anyone going to harry on monday (11/14) at the forum & wanna carpool ? o__O <3",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8273288792035323934
  },
  {
    "id": 738165,
    "post_id": "yyzirl",
    "title": "Holding classes",
    "self_text": "Psychobio major can hold any psych or LIFESCI classes. Or GE’s or math 30 series and possibly other classes too. Dm me for what class and how much!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1918823497145472236
  },
  {
    "id": 864919,
    "post_id": "z2yfun",
    "title": "Class Schedule Suggestion",
    "self_text": "How manageable is Math 32B, Phys 1B, Phys 4AL, CS31, and Mgmt 1A in the same quarter?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1645902918272842454
  },
  {
    "id": 1027860,
    "post_id": "z89iv4",
    "title": "EEB 140",
    "self_text": "Anyone enrolled in EEB 140 in the Winter who is thinking about dropping please hmu I am willing to pay for your spot lmao",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1922809074501007245
  },
  {
    "id": 498653,
    "post_id": "yqws8c",
    "title": "Poli Sci Class schedule suggestions",
    "self_text": "Hi! I was wondering if I could get advice from a poli sci major. I am currently a freshman and am taking: Cluster 60A: America in the Sixties, Art History 25, and English Composition 3. I was wondering which courses would be suggested I enroll in next quarter to hit some of the major classes to be on track. Would Poli Sci 6, Poli Sci 40, and something else work well? Thank you!!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4182414318557526525
  },
  {
    "id": 441372,
    "post_id": "yozjld",
    "title": "Please give me back my black leather jacket",
    "self_text": "I left a black leather jacket for one hour (from 11 am to 12.15, Monday November 7th) on a chair in front of Royce Hall 190 and now it has disappeared. Please, for whoever took it, it has an extreme emotional and affective value for me, can you please give it back to me? I beg you. Leave it somewhere and please drop a hint under this post on where I can find it. I love that jacked with my whole heart and it was a gift from a very important person and it carries very good memories for me. You can find another black leather jacket anywhere.  Do you guys know if there is a lost&found here at UCLA?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3310869723384377762
  },
  {
    "id": 861504,
    "post_id": "z2v760",
    "title": "Korean 50- History of Korean Civilization",
    "self_text": "If you have taken this class before, was it easy or hard? heavy reading? I don’t know what to expect because there’s only one review on bruinwalk for Wang",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7468414780786282728
  },
  {
    "id": 772790,
    "post_id": "z01k94",
    "title": "Props to Korey Foreman",
    "self_text": "Props to Korey Foreman man. he literally had his BACK TO THE QB pretending to cover Charbonnet, and then at the last second busted his ass back to the slant to get that int. He KNEW THE PLAY WE WERE GONNA RUN THE WHOLE TIME and HE KNEW DTR WAS GONNA THROW IT THERE. Man, I thought DTR really fucked us up, but rewatching the play Foreman really had the GOAT play of the game.  gg man. well played.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 992519750369407204
  },
  {
    "id": 411038,
    "post_id": "yny7po",
    "title": "Is Smallberg doing flipped classroom right now?",
    "self_text": "I'd like to sit in on a lecture.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8188509540739399099
  },
  {
    "id": 279514,
    "post_id": "yjmohw",
    "title": "Has anyone taken classics 48 w blank?",
    "self_text": "It seems like an interesting filler class for my schedule. Has anyone taken it or had prof blank before? :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7096157187484723116
  },
  {
    "id": 299250,
    "post_id": "yk9ags",
    "title": "Roommates with 10 Alarms",
    "self_text": "Just why. Why do you put 10 alarms only to get up, turn it off, and go back to bed?? What do you gain from this? Are you not aware you have 2 other roommates?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3320635256909365540
  },
  {
    "id": 653325,
    "post_id": "yw8s3j",
    "title": "Math 33b and Math 61 in one summer session?",
    "self_text": "Is this doable?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2265637560808296503
  },
  {
    "id": 767971,
    "post_id": "yzvimu",
    "title": "On a more positive note, Dorian Thompson-Robinson is now UCLA’s all time leader in total offensive yards after tonight’s performance",
    "self_text": "Congrats, Dorian. Hope you can finish your career here with a bowl win.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6876813546047528859
  },
  {
    "id": 372341,
    "post_id": "ymkiv0",
    "title": "No Idea what I’m gonna do when I graduate",
    "self_text": "Does anyone else feel this way? Idek where to start with finding a job etc.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7683077796852719536
  },
  {
    "id": 463693,
    "post_id": "ypsanp",
    "title": "Is Math 31B hard to get?",
    "self_text": "I am considering in enrolling in math 31B on my second pass. However I was unfortunate enough to get a superr late second pass, and I need that class as a coreq to my chem class. Do you guys know if it is a hard class to get? (I want to enroll in my second pass because I want to do chem and the chem lab in my first pass)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3509915339674462961
  },
  {
    "id": 653546,
    "post_id": "yw8zhh",
    "title": "Stats 10 GE req",
    "self_text": "Does stats 10 cover both life and physical science or you get to choose which one you want it applied to? How does this work?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2776394142958405316
  },
  {
    "id": 632100,
    "post_id": "yvhtm2",
    "title": "Who the fuck is playing in Covel today",
    "self_text": "I’m sorry, but you’re such a nuisance. Please play good music or stop. You’re giving me a massive headache  Edit: Now it’s much better. Thank you 🙌",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4310041861962743450
  },
  {
    "id": 537310,
    "post_id": "ys4wi0",
    "title": "Drop in Week7",
    "self_text": "If I drop in week 7, will it affect my financial aid since they take census in week 3?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8787269870614842477
  },
  {
    "id": 255551,
    "post_id": "yiun7c",
    "title": "EEB 101",
    "self_text": "eeb 101 (6 units) has a lab already in it. would this count for the 2 lab requirement for the Bio BS? or does it have to have L in the name (like 109L)  also how was this class for anyone that's taken it - thx!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8052425232377291581
  },
  {
    "id": 358843,
    "post_id": "ym5xen",
    "title": "Psych 115 Adhikari",
    "self_text": "Are his exams cumulative?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 18007785141814071
  },
  {
    "id": 1011225,
    "post_id": "z7p1fh",
    "title": "rooftop access w a view?",
    "self_text": "any place on campus w rooftop access w a nice view? one of my favorite things to do but my fave spot (dykstra rooftop) closed mid last year (not sure if you can now force the door open again). the engineering building and ms building roofs are nice but kinda mid. looking for more suggestions 🎤🎤",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8552786522452978581
  },
  {
    "id": 494244,
    "post_id": "yqs6jk",
    "title": "Looking to have classes held for a Bio Major, you will be compensated",
    "self_text": "Basically the title, I’m looking to have to Physics 5B and Chem 14C held until my first pass. I’m also hoping to have Japan 2 held until my second pass which I understand is more demanding but again you will be compensated fairly for this. If you’re interested in holding any of these classes please DM me and we can discuss payment and times",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1503216071422467327
  },
  {
    "id": 416856,
    "post_id": "yo51c8",
    "title": "Where can you swipe in non-students",
    "self_text": "Has anybody been to a dining hall where they let you swipe in somebody who wasn’t a student? also do you have to swipe yourself in as well?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4423150678106548967
  },
  {
    "id": 846397,
    "post_id": "z2cj4r",
    "title": "Switching Apartments",
    "self_text": "Hey so me (male) and my roommate have an issue in regards to sleeping schedule, and it’s at a point where I can’t take it anymore and need to switch apartments. I tried everything I could to help me sleep better from noise cancelling earbuds but he’s extremely loud at night and I talked to him about it but it didn’t improve. If anyone has any space available for me to switch next quarter pls let me know",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2384559913341140325
  },
  {
    "id": 277990,
    "post_id": "yjl6al",
    "title": "How do you know when certain classes will be offered?",
    "self_text": "I need 2 specific major related classes to graduate, but looking through the winter 2023 course list I noticed they are not offered in winter. I’m just worried that if they are also not offered in Spring I wont be able to graduate on time",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2601202089153248229
  },
  {
    "id": 708776,
    "post_id": "yy3612",
    "title": "Can hold a 5-6 unit class",
    "self_text": "Will do it for free or if someone pays, whatever the best offer is",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 711647335624727408
  },
  {
    "id": 819808,
    "post_id": "z1itaa",
    "title": "psych 118 prereq",
    "self_text": "does anyone know if i'll die in psych 118 without having taken 115? or if the psych department will just kick me out anyway if i haven't taken 115?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5192953425868842272
  },
  {
    "id": 364959,
    "post_id": "ymcatl",
    "title": "Help on Awkwardness",
    "self_text": "One time I was walking somewhere, and it was just a one path road. Up ahead, like a hundred feet away, I see one of my TA's. It was a TA for a class where the TA taught the class and we never met the professor. We weren't friends, but we knew each other, so I wasn't sure if I should say hi or wave. Like, it would be rude to ignore him, but at the same time, it was an awkward distance. We were talking towards each other. But at the same time, it would be so awkward so far away.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5461257509821111199
  },
  {
    "id": 979801,
    "post_id": "z6nypv",
    "title": "Room swap for winter quarter (M)",
    "self_text": "Im a male with a classic triple in rieber hall, 7th floor. Im a pretty big person so i kind of want to swap into something with more space. Plz dm me  (Preferably any University apartment or a deluxe triple, but willing to think about other options)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3026959426896371575
  },
  {
    "id": 638216,
    "post_id": "yvohlw",
    "title": "Poli sci stats req",
    "self_text": "Do they accept ap statistics exams",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8762054927632993489
  },
  {
    "id": 1003276,
    "post_id": "z7f929",
    "title": "Petition to P/NP",
    "self_text": "Lol I’m fcked I completely mistook this week as Week 9 and forgot to change my class to P/NP. Is there really going to be zero accommodations for classes due to the strike tho lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 909307580033241092
  },
  {
    "id": 966849,
    "post_id": "z6a7i1",
    "title": "Super sick during finals",
    "self_text": "Currently in the hospital with who knows what. I can’t go to class (or generally think at all) and the doctors don’t have an estimate on when I’ll be better.   What should I do in this situation? Is there a particular office I should contact or should I just reach out to my professors?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6177453988924575851
  },
  {
    "id": 665799,
    "post_id": "ywmp66",
    "title": "If you are reading this and like someone, please for the love of god, just tell them.",
    "self_text": "They probably like you too.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7305465034211284375
  },
  {
    "id": 369591,
    "post_id": "ymhh3x",
    "title": "UCLA Rec Nike Hoodies",
    "self_text": "I want a hoodie!! How do I get one?  these go so hard 👀",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5627741178903598385
  },
  {
    "id": 477956,
    "post_id": "yq7b3g",
    "title": "2 Blackpink Tickets for sale on Sat 11/19 in LA",
    "self_text": "Hello!! Hoping there are blinks here. I have 2 Blackpink tickets for sale on Sat 11/19 in LA. My seats are sec 216, row A, seat 9-10. I have receipt and is ready to transfer to you on Ticketmaster. Row A is a nice row because no one is blocking you and no cameras in the way. Thank you so much for your help! I have to sell because of schedule conflict.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4455578800356480249
  },
  {
    "id": 665693,
    "post_id": "ywmjqg",
    "title": "UCLA vs USC football game.",
    "self_text": "Where can we watch it on tv? ESPN? PAC 12? Fox?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6946203786927853921
  },
  {
    "id": 883128,
    "post_id": "z3jnt3",
    "title": "entering engineering buildings",
    "self_text": "Why is engineering 4 /5 /6 always locked? How can i enter? Which card must i beep (l&s student)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8358925949239739056
  },
  {
    "id": 901593,
    "post_id": "z44rv2",
    "title": "TCAB Cedars - Sinai Volunteers",
    "self_text": "To whoever this applies to,   I have no idea how to get to Cedars - Sinai by bus. If anyone is down to show me how to get there by bus and show me the ropes, that would be greatly appreciated haha.   DM Me if you can (:",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 212296135437660057
  },
  {
    "id": 587917,
    "post_id": "ytvwi0",
    "title": "help",
    "self_text": "i am struggling so bad in my math class like ive been studying so much but i have a midterm coming and i dont think im going to pass it at all, nonetheless the class… im a pre-econ major 😭 should i take the L and switch majors fr",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7404959076290495273
  },
  {
    "id": 522360,
    "post_id": "yrp3ma",
    "title": "Has anyone taken a USIE seminar? What was it take?",
    "self_text": "I want to apply for one but not sure what it entails. It seems like a long process. Any insight would be appreciated. Thanks :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1797081126831720074
  },
  {
    "id": 676569,
    "post_id": "yx119l",
    "title": "Thoughts on Min Hyunki as a prof?",
    "self_text": "Hello! Thinking of taking math 33B next quarter. If anyone currently has this prof for 115A, how are they?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3310673660491618267
  },
  {
    "id": 666424,
    "post_id": "ywnkxw",
    "title": "Strike of 48,000 academic workers in California enters third day",
    "self_text": "Today marks the third day of the strike by 48,000 academic workers throughout the University of California (UC) system. The strike involves  postdoctoral and academic researchers, tutors, graduate student  instructors and assistants in the United Auto Workers (UAW). The academic workers are demanding adequate pay and benefits to address the  immense and soaring cost of living in California.  The strike is already the  largest university strike in US history  and includes half of  the roughly 100,000 academic workers in the UAW. It is taking place as  more than 1,700 part-time faculty and UAW members at the New School in  New York City will begin a strike on Wednesday, joining the 250  HarperCollins workers already on strike in the city.  In an effort to smother opposition, the UC administration on the first day of the strike requested that a mediator be brought in. Ryan  King, a UC spokesperson, said in a statement Monday, “At this time, we  believe that the best path to an agreement is with the aid of a third-party mediator.”  UAW officials have so far rejected the proposal for a mediator, but they have opened up the pickets to various Democratic politicians. The strike is, in fact, pitting academic workers in direct conflict with the Democratic Party, which controls the UC Board of Regents and California politics at the state and local level.  Reporters from the WSWS spoke with striking university workers, many of whom expressed concerns over the cost of living and intimidation from academic advisors. They also declared their solidarity with workers in  the humanities who are regularly paid less than their counterparts in  hard sciences.  Will and Richard, UC San Diego graduate students in the physics department, said workers were demanding a 100 percent increase in their wages. Will noted that he and his partner currently live in graduate student housing, but they are only guaranteed access to this housing for two years. When they are forced out of the lower-cost graduate student  housing, he said he could face a situation where rent consumes “75 percent of my current salary, for a rent of $3,000 month.” Off-campus  housing also comes with the costs of commute, and he noted, “I cannot  afford gas and a car.”  Richard said, “I live in Santee, I cannot  even afford to live in San Diego.” Monthly, he brings home $2,500 and is concerned particularly for the high costs of insurance for himself and  his partner.  Richard also stressed the importance of academic accountability. “Something I am passionate about is that I want to make  sure we get fair treatment for academic workers. Too many of my  colleagues have been gaslit or face deceit from their PIs [Principal  Investigators, or lead researcher in a grand project]. I’ve seen PIs claim ownership over the work of grad students, and it’s absolutely unfair. There are no protections for academic workers. And grievances go nowhere.”  Megan, a second-year graduate student in psychology at UCSD, said that one of  the main reasons she is striking is because she wants to see more  protections given to academic workers, particularly at the hands of PIs.  “We have no protections from academic bullying,” Megan said. She  explained that serious grievances that have been filed for abuse or from a PI claiming ownership of a TA’s work have fallen on deaf ears.  “For raising a grievance, I have instead been kicked out of my lab, my  entire degree is at risk. Sure I would like to be paid more, but because  of this issue I will not be finishing my degree here. I currently live  in graduate housing. My job and housing are at risk.”  Read the rest here.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 220955847599921803
  },
  {
    "id": 877619,
    "post_id": "z3c55j",
    "title": "Math 33a prereq",
    "self_text": "Hi, I am enrolled to take math 33a, but I just checked and it says math 31b is a pre req. If it let me enroll does that mean that it isn't enforced and I don't actually have to take 31b first?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 595672177584510406
  },
  {
    "id": 469772,
    "post_id": "ypyfkq",
    "title": "Looking to buy some Den Pass tickets to USC vs UCLA game",
    "self_text": "Pm me pls :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3790305458501798781
  },
  {
    "id": 300574,
    "post_id": "ykao8u",
    "title": "Masters Program",
    "self_text": "I'm applying for the masters program in education, and was wondering, for the letter of recs, does it matter from where it comes from? Like I have two educators down, but the third person doesn't work in education. It's someone that I've worked with, they're also credited, she's an engineer at northrop. I was wondering if that was like okay? Thaaaanks",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6130650343019377630
  },
  {
    "id": 729271,
    "post_id": "yyqv9t",
    "title": "if you need help with econ102",
    "self_text": "Please pm me. I am making up the final for econ102 this quarter.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7832358439185183870
  },
  {
    "id": 510307,
    "post_id": "yr94ua",
    "title": "CHEM 154",
    "self_text": "Is attendance in CHEM 154 mandatory and does Dr. Nakamoto record lectures? Thanks in advance!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6380920447363467074
  },
  {
    "id": 694230,
    "post_id": "yxm9c9",
    "title": "transfers: what did you write about in your PIQ’s?",
    "self_text": "I’m looking to transfer to UCLA next fall. I have pretty good grades, 3.9 gpa, no extracurriculars but that’s because I have a part time job. I know that these things are good but in order to be competitive I need to stand out in my PIQ’s. I’m struggling with what to write about, I just don’t feel like I’ve had many stand out moments in my life that would set me apart.   If you transferred what did you write about?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1616941709624483647
  },
  {
    "id": 420710,
    "post_id": "yo94ji",
    "title": "Chem 14B and Chem 14BL simultaneously",
    "self_text": "can you do Chem 14B and Chem 14BL simultaneously, and if so, what was one's experience with this or what some of heard from others? Workload a lot, too much, manageable? Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 688429372094965290
  },
  {
    "id": 843540,
    "post_id": "z29mng",
    "title": "is Carnesale Commons the building by Bplate",
    "self_text": "The shuttle is picking me up at Carnesale Commons tmr and idk if I’m thinking of the right place",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8196978423098031863
  },
  {
    "id": 896306,
    "post_id": "z3yoi3",
    "title": "Anyone whoever had taken Biomedical Research 5HB taught by Austin, T.R.",
    "self_text": "Does this course demand a lot of work and time? Is it tough class? Any midterms & final ? Also, is it possible to skip its Discussion class (not attending the discussion class) or it's mandatory since it will be group project & attendance required in the discussion class?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6555350433163665045
  },
  {
    "id": 541707,
    "post_id": "ysb7xz",
    "title": "am ind m10 w/ sladeck?",
    "self_text": "thoughts on this class/professor? Also if the lecture says “no location,” is the location tbd or are lectures posted online?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5227631001287385134
  },
  {
    "id": 995341,
    "post_id": "z76gld",
    "title": "If you lost your wallet",
    "self_text": "If you lost your Tommy Hilfiger wallet in Math Sciences 4000A today, we dropped it off at the lost & found at Boelter 6426 (SEAS OASA) :) here’s more lost and found contact info if you need!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1593250588139091892
  },
  {
    "id": 630216,
    "post_id": "yvfp3w",
    "title": "Math 31AL w/ Demiroglu",
    "self_text": "I’m not in the class but she’s teaching Math 31B next quarter and just wanted to hear how her class / teaching is.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5167706596490245415
  },
  {
    "id": 973998,
    "post_id": "z6hz47",
    "title": "Name of the textbook for History 9D? (Intro to Middle East)",
    "self_text": "Planned on taking this class as a GE, but it isn't being offered this quarter. Need to learn the material as soon as possible, so I was wondering if any former students remember the name of the textbook -- might have to buy it off of VitalSource or something. Couldn't find a syllabus online, so if anyone knows lmk. Appreciate it",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6516000375446183067
  },
  {
    "id": 873378,
    "post_id": "z37gap",
    "title": "professors and ta’s gone in class",
    "self_text": "hey! so i’m in a class where all the ta’s are on strike, but the professor is on a research trip to another country and won’t respond to emails or hold office hours. this class also has multiple homework assignments a week. does anyone know what the best course of action would be here? i really don’t want to get an incomplete grade. 😅",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9104834831353867883
  },
  {
    "id": 612179,
    "post_id": "yurkap",
    "title": "UCLA School of Music Dean sends secret email to undergrads and faculty telling them they'll face negative repercussions if they support the strike....",
    "self_text": "Apparently the dean for the UCLA School of Music has already done a number of interesting things including allegedly giving herself a large raise after getting the position, and is pretty universally disliked by the music students ... This evening, she just sent an email EXCLUDING all graduate students at the School of Music essentially telling students to not strike unless they want to face negative repercussions... thoughts?  &#x200B;   Edit : The part that I found concerning was #1) That the dean excluded ALL graduate students from this email, not just those with TAships or under GSR pay and #2) the following section of her email:   \"As a citizen, you can clearly act as you see fit.  Your rights as a citizen, however, do not obviate your obligations as contracted and paid employees of the University.   You are expected to be in class and to perform the duties for which the university pays you. Ladder faculty are contracted as salaried employees for nine months and include an agreed-upon number of courses as assigned by your chair. Temporary faculty/lecturers are hired and paid for the specific work of delivering the classes for which you were contracted.    The canceling of classes by anyone under contract to deliver them will be treated as absenteeism in violation of your work agreement.  The University and campus have the right to dock your pay should you not perform the duties to which you agreed when you signed your employment agreement.\"  This was surprising to me as many other departments didn't specifically discourage faculty support of the strike in their emails, and I know many professors who have already cancelled lectures in support of their TAs.  https://preview.redd.it/rw7q5ur48vz91.png?width=1262&format=png&auto=webp&s=426dcf97564e589fac2258f7232b25995d7d46dd  https://preview.redd.it/5cj8uir48vz91.png?width=1184&format=png&auto=webp&s=b792ba2c6a554bbfa88b934448020e55d67073ae  https://preview.redd.it/k7sxj4s48vz91.png?width=1178&format=png&auto=webp&s=648b7652bee43c497a9dc2f92f47e19167b59204  https://preview.redd.it/y4v4z2s48vz91.png?width=1170&format=png&auto=webp&s=ff1b5bcae53b6f96b56b120d4e9caf90956913d2  https://preview.redd.it/fcaybir48vz91.png?width=1220&format=png&auto=webp&s=74c1daf41987c1cb1fc8ea1da7425fd0cd865b68",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3721814800538275391
  },
  {
    "id": 729050,
    "post_id": "yyqnr7",
    "title": "Virtual Counseling",
    "self_text": "How does it work ^ I am trying to access online counseling but nothing seems to pop up and it’s kinda urgent , I’m not campus too  Appreciate any help thanks !",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3429108912854990524
  },
  {
    "id": 835234,
    "post_id": "z20u93",
    "title": "lower div math classes closing discussion sections???",
    "self_text": "bruh i literally used my first pass on math classes only to check that the math department closed the discussions enrolled in... is this normal or something???",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4860962142315930536
  },
  {
    "id": 257449,
    "post_id": "yiwgy4",
    "title": "Application essay error",
    "self_text": "One thing I found in my college essays is that I sometimes put one space after the period and others I put two spaces. It makes the start of new sentences inconsistent as there’s different spacing. This is a format error and if you look closely you can tell the difference in spaces after the periods. Will this affect my college admission at all? Will they hold this against me? Please be honest and let me know! Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3741842706199578244
  },
  {
    "id": 415070,
    "post_id": "yo30pn",
    "title": "how the fuck do i get to boelter library???",
    "self_text": "i’ve made it to the roof 3 times… am currently outside the william s klug seminar room please help 😭😭",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3741034824743188845
  },
  {
    "id": 756889,
    "post_id": "yzkai1",
    "title": "Ridesharing to Rose Bowl?",
    "self_text": "Hi all! Anyone looking to get Uber/Lyft to leave at around 1:30 or 2pm for Rose Bowl? Would love to share a ride - feel free to DM or just comment! Thanks :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3059138447269649252
  },
  {
    "id": 310299,
    "post_id": "yklba5",
    "title": "therapy",
    "self_text": "i have ucship and was wondering the best way to go about getting a therapist? i’m a little confused on the process and was wondering if anyone has any recommendations or advice? it would be greatly appreciated, really looking to start getting myself so help haha",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 206462419707274487
  },
  {
    "id": 338072,
    "post_id": "ylhivg",
    "title": "does the hilltop store have cold medicine",
    "self_text": "im dying",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 595737445073534350
  },
  {
    "id": 628038,
    "post_id": "yvdcq0",
    "title": "anyone planning on dropping psych m116a or 116b?",
    "self_text": "if anyone is planning on dropping these courses, please please lmk! i need one of these classes to graduate. thanks!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4157117017984571527
  },
  {
    "id": 468377,
    "post_id": "ypx302",
    "title": "Grad family housing for couples with no kids",
    "self_text": "I searched in the sub about this and found a couple other ppl with similar situations but I’m still curious about a few things.    Do they give any kind of priority to ppl with kids for the housing or is everyone all in one big lottery?  Has anyone had any problems with the documents you need to provide? My partner and I aren’t married but by the time we would apply/move in we’d have a lease agreement from the last year   How hard/easy is it to get an extra parking spot? My partner and I would both have cars.   Does the housing application open the same time as everyone else’s? So like May right ?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3238797430257860703
  },
  {
    "id": 440909,
    "post_id": "yoz15y",
    "title": "Stats 10",
    "self_text": "Has anyone taken Stats 10 with professor Somal? I can't find him on Bruinwalk. What was the class like? Did he record his lectures?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1100598395900946450
  },
  {
    "id": 787394,
    "post_id": "z0i4ld",
    "title": "room swap for next quarter (F)",
    "self_text": "have: double shared bath in Hedrick Summit  want: any double with a shared or private bath",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7386809344269931973
  },
  {
    "id": 785585,
    "post_id": "z0g5pk",
    "title": "what is a professional portfolio",
    "self_text": "How does one create a professional portfolio? Is a free Wix site official enough? I personally find the whole make-your-own website-to-promote-yourself to be a bit tacky, but my advisor assures me that it is not. I am working on a capstone project for the Professional Writing minor, but also want something I can send to potential employers to demonstrate my work. (I have a few published articles, and hopefully a research paper soon, but mostly personal pieces currently formatted as blogs.) Thoughts?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6665140897041333541
  },
  {
    "id": 303334,
    "post_id": "ykd9wq",
    "title": "Anyone taken Paul Tulipana before?",
    "self_text": "He’s teaching MCDB 60 for winter but there’s not a lot of bruinwalk reviews :(",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8563461810493814828
  },
  {
    "id": 971159,
    "post_id": "z6esyo",
    "title": "Advice for becoming a quant",
    "self_text": "Currently a first year looking into become a quant trader. I am planning on double majoring in math of comp and statistics. If anyone has recommendations on classes (lower and upper div) to take that are important for the field please let me know. Also any advice on how to go about being competitive for internships would be very helpful. Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5385809681488096359
  },
  {
    "id": 1020488,
    "post_id": "z81fon",
    "title": "Math of Comp Upper Divs",
    "self_text": "I'm preparing to switch into the math of comp major and I initially signed up for PIC10A, but I know that a lot of people recommend CS over PIC for the upper divs. What upper divs can you take with just the PIC series? Are they worth much in the job space?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1831893471957412355
  },
  {
    "id": 500529,
    "post_id": "yqyqni",
    "title": "HELP😭Would it be possible to rent out my room for Christmas/ the winter break?",
    "self_text": "I don’t really want to pay for my rent if I’m not staying, plus people who live on the hill are required to pay for their winter stay through   Any thoughts😭",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6827531097626994525
  },
  {
    "id": 745240,
    "post_id": "yz75zm",
    "title": "Found Apple Pencil at the Study",
    "self_text": "I found an Apple Pencil at the study today and it has an engraving. Dm me with what the engraving is if it’s yours!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5732776950636669073
  },
  {
    "id": 710975,
    "post_id": "yy5m5n",
    "title": "how much have you/would you pay for someone to hold your spot in a class?",
    "self_text": "i’m not in a position to do either but i’m seeing this so much. just nosy :p",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8716863878159317436
  },
  {
    "id": 265211,
    "post_id": "yj6hed",
    "title": "CS 31 major restriction",
    "self_text": "I’m switching into one of the allowed majors for the CS 30 series next quarter but as of now i’m restricted. Does anyone know how likely it is to get into  CS 31 after second pass when they allow restricted majors to enroll?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8306480227294375681
  },
  {
    "id": 493351,
    "post_id": "yqr9ci",
    "title": "Class Swapping",
    "self_text": "Is anyone willing to hold CS M151B for me? I'll use my priority pass to hold anything you like for you. I'd need to get into CS M151B second pass.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7124196261634745394
  },
  {
    "id": 328964,
    "post_id": "yl7j89",
    "title": "Easy Courses",
    "self_text": "Anyone have any suggestions for easy courses for me to take my final quarter to raise my gpa before graduation?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2925035265811192409
  },
  {
    "id": 712422,
    "post_id": "yy73io",
    "title": "Application audits",
    "self_text": "Has anyone ever been audited by the UCs for their employment in their application? I am asking because my job is Door Dash delivery driving and I don't know how I would prove my employment if I am just employed by a website. Thanks",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8486365436190225506
  },
  {
    "id": 286190,
    "post_id": "yjtp2i",
    "title": "UCLA v USC Football Game",
    "self_text": "Hey does anyone know how to purchase guest tickets for the UCLA vs USC football game? I’m a Den Pass Holder but there is still no option to purchase a guest ticket online?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2486798026492716805
  },
  {
    "id": 297213,
    "post_id": "yk77j9",
    "title": "Winter Registration",
    "self_text": "How do I figure out when it’s my turn to register for classes?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5928251704789748937
  },
  {
    "id": 1035185,
    "post_id": "z8i3lk",
    "title": "Saw something miraculous today",
    "self_text": "FUCK THE MODS  A guy sat next to a girl in my stem class 3 weeks ago. He was nonchalant, didn't talk her, didn't hit on her or anything.  For three lectures a week every week, i see him repeat this, and it's pretty obvious he likes her or something.  In week 9, he sat a seat away from usual, and the girl moved in as well as they continued sitting in silence with a space apart from anyone else.  Finally, this week, he talked to her a little after lecture yesterday, and asked for her number today .... Then continued sitting in silence together and not talking to her even after class ends.  Like fr, this is the first time I've seen a stem guy make a move on a girl irl, but ngl idek when they are gonna go on a date at this rate. Kudos to him though. Must've been a monumental milestone in his life",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5132728467530683049
  },
  {
    "id": 455123,
    "post_id": "ypfzru",
    "title": "SC Bonfire",
    "self_text": "Does UCLA still have the annual bonfire where you trade a red shirt and get a beat SC shirt. And they create a big fire in Wilson Plaza?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3356710769489760898
  },
  {
    "id": 429281,
    "post_id": "yojsw3",
    "title": "beginner guitar lessons in westwood?",
    "self_text": "starting from scratch and would love to take lessons from anyone in the area! pm me if you have any leads :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3455977412687419901
  },
  {
    "id": 863938,
    "post_id": "z2xgwf",
    "title": "educ 10?",
    "self_text": "anyone taken educ 10 with prof franke ml?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 640780667115173013
  },
  {
    "id": 671526,
    "post_id": "ywuq1j",
    "title": "Don’t jump rope inside John Wooden!!",
    "self_text": "No seriously, I can’t believe I’m making this post. Why would you want to obstruct the path and potentially hurt so many people by doing it right in the middle of jwc? There’s a courtyard for a reason.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4704638629546434972
  },
  {
    "id": 782673,
    "post_id": "z0d30h",
    "title": "how is eeb 129?",
    "self_text": "how’s the workload like? taking it with noa pinter-wollman",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4185103930385717605
  },
  {
    "id": 874524,
    "post_id": "z38m53",
    "title": "Stats 10 with H . Somal?",
    "self_text": "Pretty sure he’s a new professor since there’s no reviews on bruin walk but not entirely sure lol  If not , how was his class like ?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1880644323737909173
  },
  {
    "id": 452232,
    "post_id": "ypbrvp",
    "title": "who is in the joe bruin suit",
    "self_text": "reveal yourself",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3904343237705257090
  },
  {
    "id": 1001848,
    "post_id": "z7dpok",
    "title": "Considering math or stats",
    "self_text": "Im considering to declare math vs stats. If I do math, I will do PIC too. But I heard stat cant do pic. I also consider math or math/econ",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5362479783099962945
  },
  {
    "id": 304448,
    "post_id": "ykeewc",
    "title": "physics5B recommendations?",
    "self_text": "Does anyone have any insight or recommendations for the best physics 5B professor? I see a lot of conflicting reviews for all of them. Any suggestions are appreciated!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1549814057209483174
  },
  {
    "id": 872997,
    "post_id": "z371h8",
    "title": "How hard is Physics 1BH?",
    "self_text": "Physics 1B is closed for winter quarter, so I'm thinking about taking Physics 1BH. How hard is it and would it be worth it? Or should I just wait for spring quarter to take Physics 1B?  For reference I'm a freshman cs major and my only experience with physics was AP Physics C Mechanics in high school (I probably forgot most of it by now)  Edit: It's with professor 'Gutierrez, C.' who has no Bruinwalk reviews if that helps",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 91748027900329795
  },
  {
    "id": 475560,
    "post_id": "yq4svn",
    "title": "Anyone wanna go clubbing tonight?!",
    "self_text": "I have bottles and a table lmk if you wanna join :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7788318518860984954
  },
  {
    "id": 1009227,
    "post_id": "z7lx2t",
    "title": "does anyone know luskin’s position on strike",
    "self_text": "saw the praxis ucla post about the dean calling ucpd on protesters, so wondering if the school sent out an email to faculty (i know other departments have)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7261049874306916917
  },
  {
    "id": 1036550,
    "post_id": "z8jvfe",
    "title": "To the guy selling his apartment spot in front of the frat",
    "self_text": "PLS RESPOND, tell me if it's still there for availability or if it's taken",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6411900897912868926
  },
  {
    "id": 918797,
    "post_id": "z4q0ao",
    "title": "Research Proposal questions",
    "self_text": "I was selected for an interview for my research proposal. Has anyone been through these before and mind dm’ing me? I have a few questions bc I’ve never done this before",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7284906365132960425
  },
  {
    "id": 1008566,
    "post_id": "z7l079",
    "title": "First pass cluster spring seminar?",
    "self_text": "Thinking a little bit ahead but I believe that in Spring, clusters have seminars on different topics led by TAs. Is enrolling in these seminars the same as enrolling in a class, is it randomly given to you, or is there some other way they decide where you end up? If the first is true (and it likely is), is it worth it to use your first pass on an interesting topic and/or a good TA? For reference I'm in cluster 73 but this process is probably the same across all the clusters.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 48179132265169863
  },
  {
    "id": 717914,
    "post_id": "yyd6hq",
    "title": "usc game tickets (section 7)",
    "self_text": "i'm specifically looking for section 7 tickets. pm me if you have any available",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1087225252881510498
  },
  {
    "id": 847370,
    "post_id": "z2diob",
    "title": "housing $400 cancellation fee",
    "self_text": "can i petition this? i’m graduating this quarter and they are charging a fee. obvi wouldn’t be the same if i was graduating in june. doesn’t seem right. im graduating this quarter = i have to pay to move out? lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7590476653038887916
  },
  {
    "id": 685892,
    "post_id": "yxbq3m",
    "title": "Willing to buy UCLA/USC Ticket (Student Section)",
    "self_text": "Looking to purchase student section ticket ASAP. Payment ready 🫡",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3648589343235955786
  },
  {
    "id": 358565,
    "post_id": "ym5nyb",
    "title": "STATS 10 Wang -- Recorded Lecture?",
    "self_text": "I'm thinking of taking Wang for STATS 10 for winter quarter but I may have a time conflict. Are her lectures recorded? I know that Cha's are but wanted to make sure.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 375425915181926970
  },
  {
    "id": 386117,
    "post_id": "yn385n",
    "title": "PSA: you don’t need to fill in ALL the sections on a scantron (i.e. gender &amp; date of birth)",
    "self_text": "A recent post asking what info a TA can see reminded me of this. I recently had a midterm that had a section on the scantron that asks your name, UID, DOB, and gender. The professors and TA’s only need your name and UID. They do NOT need your gender or DOB. They TA did not mention this, it’s just implied but some people don’t know and just blindly start filling out all the sections asked. Just because there’s a field for it does not mean it’s required. This is good general advice for online forms and in-person forms.   Also, thewifisuckspowellcatisthebestandandresucks",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7078996002218820105
  },
  {
    "id": 848864,
    "post_id": "z2f0rp",
    "title": "Psych 118 vs eeb 100/129",
    "self_text": "hi!! i know eeb 100/129 is usually the recommended option for psychobio, but is psych 118 generally an overall worse class or is it specifically because of the professor? Apparently a pretty good prof is teaching it next quarter so I might chance it",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7726926614506510462
  },
  {
    "id": 926064,
    "post_id": "z4y98a",
    "title": "Peggy Gou tomorrow",
    "self_text": "Anybody here gonna go see her tomorrow? I’m tryna meet some people and have a good time together :) hmu",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6684214864547904374
  },
  {
    "id": 448914,
    "post_id": "yp8740",
    "title": "Vegans @ UCLA",
    "self_text": "Where y’all at? Trying to make vegan friends",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7342565378623700995
  },
  {
    "id": 364320,
    "post_id": "ymbme6",
    "title": "Drinking culture",
    "self_text": "I know there’s “lots of diversity on campus” and you can “always find your niche” but drinking here is so pervasive. It feels like the medium to every social interaction. I’ve tried to blend in at social events sober but once people realize I’m not drinking they act totally shocked and/or pressure me to drink.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7963398197244669461
  },
  {
    "id": 307301,
    "post_id": "ykhl2g",
    "title": "how is everyone so tall here",
    "self_text": "i just walked by a group of like 15 students and every was like a redwood tree",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4342556860605106903
  },
  {
    "id": 708689,
    "post_id": "yy32bn",
    "title": "Spot in EEB 100L Lab 3",
    "self_text": "Whoever can hold a spot in EEB 100L Lab 3 until the 19th. I will pay decently and am willing to negotiate as long as the spot is saved.   Edit: DM if interested",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3536002885240851731
  },
  {
    "id": 497353,
    "post_id": "yqvh97",
    "title": "A- vs. A",
    "self_text": "I will never understand why an A- is weighted lower, but an A+ is weighted the same :( BRUHHH I know it's a first world problem but... still....",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3753903043005872425
  },
  {
    "id": 629116,
    "post_id": "yvejik",
    "title": "Re the two people telling people to skip classes",
    "self_text": "If you want to support the strike by not going to class, by all means do so. But you can also just go to class if you want  As someone else has said, the UAW and FDSA havent recommended undergrads skipping class. Dont listen to the two people’s bullshit",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4882350801524551822
  },
  {
    "id": 903563,
    "post_id": "z47gsb",
    "title": "UC transfer (from cc) help!!",
    "self_text": "I only have a couple of days left to submit the UC ap and I’m stuck on the first step. I’m stuck on the part that asks to select term and level. By the time I transfer I would have more than 90 units which would put me at senior standing, but I had a major change after my first year at cc and some classes may not count towards my current major which may put me at a junior standing. For the senior level it says that there are limited campuses available. What should I do? Will it be a big disadvantage if I apply as a senior? Any help is appreciated, first time poster!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3963509967636996355
  },
  {
    "id": 604367,
    "post_id": "yuimv7",
    "title": "Help in choosing PoliSci Courses for Winter '23",
    "self_text": "Hi,   I'm a transfer student who was helped a lot by their NSA during the New Student Orientation when choosing my Fall '22 classes.   My first pass for Winter '23 is in less than 8hrs and I have no idea what to do.  I don't have a concentration nor do I know how to declare my major from pre-polisci to polisci. Can I even schedule my classes if I am not PoliSci?   What courses do you think I should take? What are examples of some Upper Division Electives I can take?  Are there any resources that can help me?   For reference, right now, I am aiming for Polt 114B and Polt 119 for first pass.   If you have the ability to help, I would highly appreciate it!   Thank you in advance!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1356263817596548154
  },
  {
    "id": 1020662,
    "post_id": "z81ny9",
    "title": "power in dorms during break",
    "self_text": "does anyone know if power will be shut off in dorms during break? i have a medication that has to be refrigerated so just wondering",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1147994721572556131
  },
  {
    "id": 601348,
    "post_id": "yuedt9",
    "title": "How’s prof Siting Liu been as a prof?",
    "self_text": "Can anyone that’s currently in 10A w/ her give some context into how she is as a prof/grading, etc.  Looking to potentially take 10B with her next Quarter.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3400726683832478167
  },
  {
    "id": 453128,
    "post_id": "ypcuii",
    "title": "How serious is UAN about roommates complaints?",
    "self_text": "I don't get along with my roommates and was wondering if housing can kick me out if they complain about me? I bring people over sometimes or even overnight guests. I don't follow their ridiculous schedules about cooking, cleaning, buying communal supplies. They have outlined some of the points in the roommate contract, but I haven't signed it or even wrote a word down while they were completing it. So, my question is, how strict are UAN about this and does this roommate contract do anything at all?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2049050470732103975
  },
  {
    "id": 606403,
    "post_id": "yukxki",
    "title": "friendly reminder to take your clothes out the dryer",
    "self_text": "this goes for everyone but especially courtside rn bc ive been waiting for a bit. get ur shit out the dryer pls and thank u. i would take it out myself but i dont want unnecessary problems / germs <3",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6448310449782536120
  },
  {
    "id": 843630,
    "post_id": "z29prs",
    "title": "UC academic workers: Build a rank-and-file strike committee to prevent a sellout by the UAW bureaucracy!",
    "self_text": "Dear Fellow Workers,   The strike by 48,000 academic workers in  the University of California system is a historic struggle that requires  the support of all workers. Your fight for the doubling of starting  wages, cost-of-living protection and affordable housing, health care and  childcare resonates with millions of workers across the US and  throughout world.   But a warning must be made: If your strike remains in the hands of  the UAW bureaucracy it will be isolated and betrayed like the 2020 COLA  strike and so many other struggles.   Strikers have already  informed me that the Student Researchers United has dropped the demands  for COLA and annual wage increases, defying the will of their own  members and breaking ranks with striking workers in other unions.   At  the same time, UAW bargainers have increasingly held secret talks with  management, ignoring demands by rank-and-file workers that every  bargaining session, in full, be live-streamed to the membership.   This  has provoked a firestorm of opposition with strikers denouncing the  bargaining committee and insisting, “No COLA, no contract!” Increasingly  there is a sense that rank-and-file workers must take control of the  situation or the strike will be betrayed.   The officers in the UAW  locals are currently under enormous pressure from the UAW “Solidarity  House” apparatus to drop everything and shut down the strike. The union  bureaucracy cannot tolerate academic workers winning major wages raises  and COLA because it will encourage autoworkers and other workers in the  UAW and beyond to demand the same. It would give an enormous impetus to  the rank-and-file rebellion that is already underway, and which is an  existential threat to the privileged positions of the pro-company police  force that runs the UAW.  But  this is precisely what is necessary. I urge striking UC academic  workers to follow the lead of autoworkers, railroad workers and  educators, who have formed rank-and-file committees as a new center of  democratic decision-making and workers’ power.   Read the rest here:  https://www.wsws.org/en/articles/2022/11/22/aisj-n22.html",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5410584845858956175
  },
  {
    "id": 548923,
    "post_id": "ysk0tl",
    "title": "Looking for a USC game student ticket for my friend",
    "self_text": "Looking to buy a ticket, feel free to PM me if you have any, thank you so much!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6568708243159539774
  },
  {
    "id": 949398,
    "post_id": "z5pjmt",
    "title": "uc to uc transfer",
    "self_text": "hi so basically i'm confused on the transferable credit section of the uc app. i took ap eng which covered two classes in english composition. it says i can only write down one ap class so i have that i guess but i have no idea what to fulfill the other english composition class since i never ended up needing to take one :/ i do have some writing Ge classes but none of them really match up to the UCLA writing 2 classes i feel like 😭 overall i am quite lost and would like some help on this",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 780462472764859383
  },
  {
    "id": 499205,
    "post_id": "yqxdot",
    "title": "Am I the only person who is hella lost in MGMT 1A with Woo",
    "self_text": "Kinda feeling dummy cause Bruinwalk was swearing by her but I have staring like a deer in headlights at the final project set for like 3 weeks now and I want to flush myself down a toilet",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3653471831689050258
  },
  {
    "id": 356887,
    "post_id": "ym40m3",
    "title": "Are there free rapid tests anywhere at UCLA?",
    "self_text": "I know there’s PCR tests in the front desks of dorm buildings, but I already had Covid earlier in the quarter so I can’t use these",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8907478227647193143
  },
  {
    "id": 664916,
    "post_id": "ywljf4",
    "title": "Strike Information Being Silenced",
    "self_text": "Mods are permanently banning supporters of the strike. They have given no answers to those trying to dispute the ban.  Who are the mods? They obviously are not impartial.   Follow https://www.reddit.com/r/UC_Strike/",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1769775502754394628
  },
  {
    "id": 650763,
    "post_id": "yw65iq",
    "title": "Any strike updates?",
    "self_text": "Does anyone have any updates on negotiations or anything, I’ve been trying to look online but haven’t seen anything",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3476452035706306711
  },
  {
    "id": 730405,
    "post_id": "yyrvva",
    "title": "How do I know tickets I'm buying are real?",
    "self_text": "I'm trying to buy tickets for the game Saturday. The guy's charging 40 bucks. How can I make sure they're real and not get scammed?  They sent me this  https://preview.redd.it/h6a7au5ndr0a1.jpg?width=767&format=pjpg&auto=webp&s=83a0bb99ddc9003ed74f376fd369195dd3e83a27",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3420534783042894839
  },
  {
    "id": 954023,
    "post_id": "z5uz8x",
    "title": "Ostracised in my major",
    "self_text": "Help a fellow bruin out!  So I'm in a pretty small major, and there is this prominent clique of friends who are more well known within the community. They are super involved in the major related club, also doing research and stuff with the more prominent professors in the major  For some reason, this clique of people don't really like me. I never did anything to them, or anything against them. I guess that I'm just awkward and shy, and I get that sometimes my social cues aren't the best and i might rub people off the wrong way (I'm working on it).  It's just that these people are in every major related event, and as much as i can and want to just live alone, they look at me funny and probably talk behind my back to peers or professors  Honestly don't know what to do, or how to salvage my reputation. I didn't expect people here to be so unsure l immature or have the mean girls complex like high schoolers...",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7758867569615638535
  },
  {
    "id": 583509,
    "post_id": "ytqd2f",
    "title": "Unable to enroll in class due to prerequisite I've already completed",
    "self_text": "I'm trying to enroll in upper divisions classes that have the lower division prerequisites which I have already passed, but it says I'm missing the prereqs. I had the exact same thing last quarter where I couldn't enroll in a class because I was \"missing\" a prereq I've already completed so I just moved on and enrolled in other classes. What do I do?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8038713462565381324
  },
  {
    "id": 493576,
    "post_id": "yqri71",
    "title": "Any environmental science majors?",
    "self_text": "Could I ask for advice?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6217364508104011179
  },
  {
    "id": 274537,
    "post_id": "yjhctb",
    "title": "Are UCLA students still able to use Photoshop for free?",
    "self_text": "For some reason, I opened up Photoshop and my subscription expired. I am still signed into my Adobe account too? Did anyone else experience this?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1312789087678931054
  },
  {
    "id": 633693,
    "post_id": "yvjhj3",
    "title": "Feast line",
    "self_text": "how is it rn?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 631417079011024544
  },
  {
    "id": 648890,
    "post_id": "yw47nf",
    "title": "Looking for Two Dinner Swipes",
    "self_text": "20 years ago my wife and I met as freshmen living in Sproul 6N. I think it would be a really fun, nostalgic date night for us to go eat in the dining hall and walk around campus. If any students have some extra swipes available I'd love to buy 2.  Edit: Found someone to swipe us in. The wife is thrilled. Thanks everyone :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8840328980727353715
  },
  {
    "id": 476111,
    "post_id": "yq5bqc",
    "title": "How does grade distribution work for classes?",
    "self_text": "I'm just now getting into the hang of things(post mid term bomb) but at the same time the second midterm and final are both within the next month so it's coming very very fast.  I'm a transfer student so I'm currently \"pre-major\" and need a C or better to oficially get into the major. Is there a limited amount of C's they can give too? Like if I get a 75 in a class but enough students do too then I would get like C-?  I'm just gonna study and do my best but i'm also scared im not sure where i'm at rn grade wise",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5237817220079264175
  },
  {
    "id": 1022887,
    "post_id": "z83vof",
    "title": "UC Reaches Tentative Agreement With 2 Groups of Striking Workers",
    "self_text": "https://www.sfchronicle.com/bayarea/article/UC-reaches-tentative-labor-some-agreement-with-17618723.php",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6161021100410625057
  },
  {
    "id": 679453,
    "post_id": "yx4bfs",
    "title": "usc rooter bus!!",
    "self_text": "looking for a rooter bus ticket to the usc game!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6311717445662429815
  },
  {
    "id": 849391,
    "post_id": "z2fo49",
    "title": "Resources for Cheaper Textbooks?",
    "self_text": "Hi all, first-year student here. I am taking Comp Sci 31 and Math 32A next quarter, and I just saw that they both require textbooks which, on UCLA store, are listed \"Inclusive Access.\" Even though the store claims that Inclusive Access books are cheaper, they still look hella expensive. Are there any websites or places where I can find cheaper alternatives (like upperclassmen selling their second-hand copies)? Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8950364648639352179
  },
  {
    "id": 732640,
    "post_id": "yyu0z8",
    "title": "will swipe you in anywhere if you can hold a class for me",
    "self_text": "5 units, just until my enrollment on 11/20 at 5:30pm  Pretty please, it's my only opportunity to take this class  Dm for details!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6234142728098056763
  },
  {
    "id": 309009,
    "post_id": "ykjmfc",
    "title": "Late class drop question",
    "self_text": "Hi guys!  I’m taking a non-impacted class, and I want to drop it. Is that okay? Do I need a form? It seems like I can just drop it from Myucla but I’m worried? Is there a fee or anything?   I’m just scared and I’ve never done this.  Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8333824010386299911
  },
  {
    "id": 495456,
    "post_id": "yqthau",
    "title": "STEVE LACY GREEK THEATER FRIDAY",
    "self_text": "is anyone else going to the concert and want to uber there/back together??",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8338931845506670985
  },
  {
    "id": 789729,
    "post_id": "z0ksvt",
    "title": "holding 4 unit class",
    "self_text": "i have some extra units and can hold a 4 unit class. pm me your payment offer if you are interested.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8348720480665560593
  },
  {
    "id": 523473,
    "post_id": "yrqb46",
    "title": "Class Waitlisted Already?",
    "self_text": "I’ve been planning my schedule for the winter quarter, and planned on taking AN N EA 15W which is asynchronous. Checking my class planner today, I noticed the class  is already waitlisted? How is that possible… is it a glitch… what can i do to ensure i get in?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5812044038409152631
  },
  {
    "id": 504271,
    "post_id": "yr2k0h",
    "title": "First pass Psych 116A or Psych 119V?",
    "self_text": "I was wondering how quickly each of these classes fills up, and whether I should prioritize one or the other for my first pass since I’ve already got 1 class that I plan to enroll in. I still need some elective credit for my major, but the Psych 119 classes have so few spaces. Any advice is appreciated!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4253453337184673377
  },
  {
    "id": 443817,
    "post_id": "yp2hjb",
    "title": "Kamala Harris is here?",
    "self_text": "Am I too late? If not, can someone tell me how to attend the election rally event she is holding?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3776560787118516754
  },
  {
    "id": 347621,
    "post_id": "ylrzbf",
    "title": "Easypay on the hill",
    "self_text": "Can non-hill residents buy food at the dining halls/takeout places with easypay or credit card?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1463238775268934988
  },
  {
    "id": 474642,
    "post_id": "yq3r4o",
    "title": "found airpod",
    "self_text": "found an airpod in the women’s restroom in campbell hall. pm me if it’s yours",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4917734945504125617
  },
  {
    "id": 861471,
    "post_id": "z2v5xe",
    "title": "Split Uber to LAX at 3:30ish PM today?",
    "self_text": "Anyone looking to split an uber? Comment or pm",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2388442312969561077
  },
  {
    "id": 637132,
    "post_id": "yvn541",
    "title": "UAW sugmadong",
    "self_text": "From the bottom of my heart, thank you UAW. Thank you for barging into my fluid mechanics midterm today with you chants and trumpets (or whatever the hell that was) and making me completely lose my train of thought. It's not like that exam was worth 25% of my grade or anything, right? Now I really want to support you! 🖕🖕 🖕🖕🖕🖕🖕",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 727803484731073528
  },
  {
    "id": 445513,
    "post_id": "yp4r2r",
    "title": "Is anyone, who knows how to waltz or dance other ballroom stuff from 18th-19th century, willing to dance with me?",
    "self_text": "Hello! I am a female and moved here recently. I have been in a ball club for 3 years now. But now that i moved, I don’t have anyone to dance with anymore, therefore, I have a dance starvation. Is anyone non creepy here willing to go dance?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6252117087477311814
  },
  {
    "id": 535400,
    "post_id": "ys2ho9",
    "title": "are midterms cancelled during strike?",
    "self_text": "so I have a midterm on Monday, but since the TAs usually help administer it I’m wondering if the strike will affect this or not, or if it’s an acceptable question to ask my professor? Asking here because I know TAs aren’t supposed to talk to professors or students about the strike and I don’t want to get anyone in trouble lol",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3155147870918545040
  },
  {
    "id": 797131,
    "post_id": "z0tjqz",
    "title": "Is a 5pm shuttle to an LAX flight boarding at 6:45 cutting it too close?",
    "self_text": "The other option is 3:30pm to be on the safe side but im just curious if I can board safely in time if I take the 5pm. Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1490386465358094528
  },
  {
    "id": 796702,
    "post_id": "z0sxwl",
    "title": "petition for grade change?",
    "self_text": "hiii!  does anyone know how to petition for a grade change for a mandatory letter grade? :(  it says online that the deadline is friday of week 6, but i saw somewhere that it was extended to friday of week 9.  does anyone know if this is true, and if so, how to proceed?  thank you so much!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 660583196247096251
  },
  {
    "id": 603414,
    "post_id": "yuhcbg",
    "title": "ECON 131 With Hackmann",
    "self_text": "Has anyone taken this course? Is it easy?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7798847151964276812
  },
  {
    "id": 1000690,
    "post_id": "z7ceyi",
    "title": "Rules regarding COVID and finals",
    "self_text": "Say that you're sick with COVID and have a final soon. Are there any official  rules regarding accommodations? Are professors allowed to require you to come in person anyway?  Thanks.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3002740603014566436
  },
  {
    "id": 816624,
    "post_id": "z1fn4i",
    "title": "University of California strike begins second week: “We need a society that works for everyone, not just the capitalists at the top”",
    "self_text": "Today  marks the beginning of the second week of the strike by 48,000   academic workers in the University of California (UC) system. The action   is the largest strike of academic workers in United States history,   pitting graduate student instructors (GSIs), postdocs, researchers and   other academic workers against the Democratic Party-controlled UC   administration and Board of Regents.  The  strikers, who are members of the three different locals of the  United  Auto Workers (UAW) union, are demanding a 100 percent salary   increase—from an impossibly low $24,000 a year to $54,000—to address   California’s skyrocketing rents and other living expenses. The strike   has galvanized workers throughout UC’s 10 campuses and far more broadly.  The UAW bureaucracy is attempting to smother the strike as it did the 2020 wildcat strike   and grade boycott by limiting the action to an “Unfair Labor Practice”   work stoppage, not a strike over economic demands. This would allow  the  UAW bureaucracy to shut the strike down any time it claims  management  has resumed “good faith negotiations,” even if UC  administrators  continue to reject the workers’ just economic demands.  However,   it is precisely the paltry wages and exorbitant costs of living and   hunger which have driven academic workers into struggle. But workers   have reported to the WSWS that UAW bargainers are already suggesting   they are ready to drop the demand for a cost-of-living adjustment (COLA)   to increase wages in line with inflation.  Anger  is mounting as  workers continue to be left in the dark about  bargaining. On Sunday  night, UAW bargainers canceled a planned  livestream bargaining session  for student researchers at the last  minute. The bargaining committee  arrogantly justified its secret talks  with management by declaring, “We  had to close the zoom room because  the university wanted to have a chat  with our bargaining team before  writing an on-the-record proposal. The  university wanted to discuss  concepts that we proposed this past week as  part of our wage proposal.  We had a lot of questions for them, too. The  conversation was  productive, and we hope that this results in them  responding with an  actual proposal very soon.”  If the  bargainers  really represented striking students they would have  replied to  management’s request for backroom talks with the statement:   “You can go  to hell. Anything you have to say to us, you can say in  front of our  membership.”  But  that is not what they did. Instead, they entered  into talks behind the  backs of striking workers. This shows the  contempt of the UAW apparatus  for rank-and-file workers. Livestreamed  talks are for show. When there  are issues of real substance, these will  be discussed behind closed  doors.  This only underscores the   necessity for striking workers at every campus to elect representatives   to a rank-and-file strike committee, which will oversee all   negotiations, ensure all talks are livestreamed, and empowers the   membership to countermand any undemocratic decisions to ram through a   bogus agreement, which ignores their essential needs.  Read the rest here:  https://www.wsws.org/en/articles/2022/11/21/fvlm-n21.html",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4553630997393877807
  },
  {
    "id": 612382,
    "post_id": "yuru74",
    "title": "NEED UCLA vs. USC STUDENT SECTION TICKET",
    "self_text": "Willing to negotiate please DM me thanks",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1943193312680228285
  },
  {
    "id": 740632,
    "post_id": "yz1zbc",
    "title": "Best way to get from UCLA to LAX on Thanksgiving day?",
    "self_text": "I'm trying to avoid taking an Uber because it's gonna be really expensive",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3044290148906399056
  },
  {
    "id": 633108,
    "post_id": "yviv7k",
    "title": "Has anyone taken math 170e with Jun Yin?",
    "self_text": "Or any other math class? What was it like? Were his exams fair? There are no bruinwalk reviews so I just want to be sure what I am getting myself into lol.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1381335766243800597
  },
  {
    "id": 594676,
    "post_id": "yu6h5s",
    "title": "Tung for Physics",
    "self_text": "Does Tung still do his multiple midterms every like 2 weeks for physics? I took him for 5A in the summer and we had a midterm every week, but I’m not sure if I should take 5C with him or 5B with Holczer.   I’m just looking for the easier A honestly and I’m also taking Chem 14d with Pham.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 997220959355099815
  },
  {
    "id": 345973,
    "post_id": "ylps09",
    "title": "Found wallet",
    "self_text": "found someone wallet at the chevron in Westwood today. Message me with ur name if u lost yours and think I have it🕺🏻",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5184533433324670606
  },
  {
    "id": 879048,
    "post_id": "z3e2n1",
    "title": "MCDB 50 with Lee, P.",
    "self_text": "Does anyone know which Prof Lee is teaching? On Bruinwalk there's a Pei Lee and a Peiyun Lee.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2329957367112460024
  },
  {
    "id": 623444,
    "post_id": "yv8b3d",
    "title": "PHYSCI 13 LAB SWITCH",
    "self_text": "Is anyone able to do a lab switch for PHYSCI 13? I need Lab 1B but I am currently in Lab 1A. Please message me if so! Or is there anywhere else I should ask about this? Or does anyone know if it is easy to do a lab switch once in the class? Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2664349000548417009
  },
  {
    "id": 600707,
    "post_id": "yudiva",
    "title": "Demiroglu Y for Math 31B?",
    "self_text": "Views on Professor Demiroglu Y for Math 31B?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2934906642964934877
  },
  {
    "id": 415794,
    "post_id": "yo3whp",
    "title": "Biochem 153a ucla extension",
    "self_text": "I'm currently taking biochem 153 at ucla extension and our recent midterm has been a shit show. TLDR, I suspect that 3 questions on the midterm were incorrect but the professor is hesitant to change them due to the fact that 7 people in the class received a 100%. Personally, I'm certain that the \"answers\" are incorrect and the 7 people cheated (you're able to see the solutions after the midterm ends so I suspect someone shared images).  What are your guy's thoughts and if you also believe the answers are incorrect, how would you go about addressing this?   Questions:   https://imgur.com/a/LVeZqZo  https://imgur.com/a/nz34oTe   https://imgur.com/a/izAa4fl",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2242057786406329936
  },
  {
    "id": 419318,
    "post_id": "yo7neo",
    "title": "If you are wondering why Sunday goes dark sooner than the day before.",
    "self_text": "It is day light saving time, so say good bye to sunshine.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3484490313712267487
  },
  {
    "id": 770469,
    "post_id": "yzyl97",
    "title": "Cheap Laptop for Programming",
    "self_text": "Anyone got recs for a cheap laptop that can hold its weight? My Mac is struggling a little with storage space (system data takes up like 50gb lol) and I was hoping to get another laptop that I could use for coding and running other useful softwares on.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8075069306672255331
  },
  {
    "id": 769558,
    "post_id": "yzxdxy",
    "title": "SEARCH ENGINE Compensation at the University of California: Annual Wage",
    "self_text": "&#x200B;  https://ucannualwage.ucop.edu/wage/",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6871063684781606208
  },
  {
    "id": 929469,
    "post_id": "z53253",
    "title": "University Apartments",
    "self_text": "How hard is it to get a university apartment if I request a 1 bedroom/4 person?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3307240264204806789
  },
  {
    "id": 874034,
    "post_id": "z384en",
    "title": "Ling Dropped Spot",
    "self_text": "Does anyone have a spot in Ling 1 that they can drop. I really need the class.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 630198267756363811
  },
  {
    "id": 1030202,
    "post_id": "z8c94s",
    "title": "MFE Program",
    "self_text": "Hi, Looking to join Anderson Business School for a MFE (Masters in Financial Engineering). Was looking for anyone's experience in the program (likes/dislikes) and any regrets about what they should've taken advantage of more. Im looking into mainly here and Cal for my MFE. Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7321168493835984339
  },
  {
    "id": 629789,
    "post_id": "yvf8tp",
    "title": "CS ECE Cross-Listing",
    "self_text": "Why are some classes like cs 151b and ece 116c the same but classes like ece m16 and ca m51a are completely different?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5497256823383598484
  },
  {
    "id": 656685,
    "post_id": "ywcibf",
    "title": "Willing to pay for a spot in Chem 184",
    "self_text": "If anyone is enrolled in chem 184 please dm I need this class to graduate on time and its only offered in winter so I will have to wait one more yr if I dont take it this quarter",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8077080215705192336
  },
  {
    "id": 639834,
    "post_id": "yvqt4j",
    "title": "Antisemitism in Class Today",
    "self_text": "Professor Blake Allmendinger did an impression of a Jewish man in class today. He said “If the Jewish religion is life-affirming, why do they complain so much?” Then he made a racist impression of a Jewish caricature saying “Oi vey! I had to wander for forty years in a desert. I survived the holocaust.” He was laughing as if this was somehow supposed to be funny. I hate it here so bad. I’ve made a DPO complaint about this Professor earlier this month. I’ve reached out to the head of the English department about the hostile environment of this department. I’m at my wits end. This man told us to make our own Ask a Mexican columns and insert our race or identity in place of the word Mexican. This gave the professor the opportunity to insert his own tasteless jokes like “If Indians are so good at math how come they never heard of overpopulation?” This is an English class. Why am I being subjected to this ignorance and racism? When talking about Charles Burnett’s Killer of Sheep today the professor asked if Blaxploitation films are another example of independent Black film making?!?! Why would you frame Killer of Sheep in the context of Blaxploitation films?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3107153342268096331
  },
  {
    "id": 741142,
    "post_id": "yz2hfp",
    "title": "Gray Corolla in Sunset Village Parking",
    "self_text": "You left your dome light on inside your car",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3150999585753290916
  },
  {
    "id": 789437,
    "post_id": "z0kh0r",
    "title": "Buying swipes (dm me)",
    "self_text": "Me and my friends want to get swiped into a dining hall and are willing to pay",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4730341736892656325
  },
  {
    "id": 356645,
    "post_id": "ym3rq0",
    "title": "Free Rapid Test?",
    "self_text": "Does anyone know if there is any place students can get free rapid tests (like at residential front desks)?   If not, where could I get a paid one? Does 7/11 still have them? Or the UCLA store?  Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2023897575130433217
  },
  {
    "id": 508772,
    "post_id": "yr77x9",
    "title": "Vicaria-Angel or Do for Math 61?",
    "self_text": "Anyone have advice on who is easier?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8000905703303620742
  },
  {
    "id": 629879,
    "post_id": "yvfc2k",
    "title": "Huang for Physics 5A",
    "self_text": "I think there was a post about this a while ago but it had no responses.   Anyone who had Huang before recommend him?  Thank you in advance :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6770066504146379667
  },
  {
    "id": 661377,
    "post_id": "ywhgd3",
    "title": "hold class: chem 14b",
    "self_text": "title. will pay $50 to hold chem 14b until the 22nd. pm me!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5530278135557476273
  },
  {
    "id": 636267,
    "post_id": "yvm573",
    "title": "STATS10 Somal or Odhiambo [DESPERATE]",
    "self_text": "has anyone taken Somal or Odhiambo for stats10/in general? how hard was the class/was it recorded or discussions mandatory?  pls respond asap",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7192247131773501913
  },
  {
    "id": 705171,
    "post_id": "yxzd61",
    "title": "HIST179B History of medicine: foundations of modern medicine",
    "self_text": "Anyone of this class is recorded/if attendance is required?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1184311611120866807
  },
  {
    "id": 989184,
    "post_id": "z708y3",
    "title": "uber from burbank airport today (11/28)",
    "self_text": "if anyone is going back to ucla from burbank airport and is willing to share rides lmk! looking to leave around 10:30 am.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5353747677775090115
  },
  {
    "id": 371843,
    "post_id": "ymjx5t",
    "title": "Huang or Stahl for CS31?",
    "self_text": "As context, I don’t have any background on comp sci",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8006524529030182202
  },
  {
    "id": 504538,
    "post_id": "yr2u65",
    "title": "How bad is it to drop a GE class in wk 8",
    "self_text": "I want to drop a GE but I’m not sure if I should do it. There’s a lot of readings that I’m behind on and I also need to focus on my major classes.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5539506104505104611
  },
  {
    "id": 498018,
    "post_id": "yqw4ta",
    "title": "Class schedule suggestions",
    "self_text": "Can anyone who has taken these classes vouch for me? I want to take Com Sci 32, Math 33A, Math 61, Phys 1C, and Phys 4AL in one quarter (probably my spring quarter). How much of a time commitment are these 4 classes + the lab?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4784960129973292456
  },
  {
    "id": 534684,
    "post_id": "ys1ofi",
    "title": "Missing prerequisite for upper-level class",
    "self_text": "Hi I am a senior in FAM major and tried to enroll in 178B for next quarter. I just realized that 170s is a prerequisite for the class but I have not finished yet. I am wondering if anyone know whether it is possible to enroll the class without prerequisite? Really need this class to graduate on time T T",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4866703765125856420
  },
  {
    "id": 652005,
    "post_id": "yw7g41",
    "title": "Are people getting booed for crossing/cutting through picket lines?",
    "self_text": "I’m at home cause I have Covid so I’m not on campus rn. But when I do come back, I’ll have to continue walking 15-20 minutes to my classes and I’m underweight. So I support the protesters but what I support even more is not losing weight from extra walking and not having to take even longer to get to class.   I wouldn’t disrupt the protests. Just say “excuse me” and move through. Idk what people have against this. Us undergrads have lives and we‘re not going to alter them for this movement. You can support the movement and not want to take extra time to get to class.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2781833953398174606
  },
  {
    "id": 869919,
    "post_id": "z33roy",
    "title": "What are David Bauers officer hours?",
    "self_text": "Asking for physics. Thank you so much.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8114537921018406066
  },
  {
    "id": 767791,
    "post_id": "yzvb9n",
    "title": "Anyone that can fix phone?",
    "self_text": "My phone is supperrrr broken but every time i take it to those cheap sketchy phone repair places they just make it so much worse in the long run. Any like comp engineering/engineering students or someone in that area that knows how to fix phones? I think water got in it/my touch screen doesn’t work and sometimes my phone will start typing/clicking random things. LOL TY",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2650702278538736626
  },
  {
    "id": 296552,
    "post_id": "yk6gue",
    "title": "What major has the most CS?",
    "self_text": "Within college of L&S. Thinking of switching majors but switching into Samueli seems very channeling.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8888568031755423735
  },
  {
    "id": 486884,
    "post_id": "yqjofj",
    "title": "Week 8 Drop Notation",
    "self_text": "How bad is it to have a week 8 drop notation on your transcript? Will it be a major red flag for graduate schools",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4499004371205029451
  },
  {
    "id": 304752,
    "post_id": "ykeqei",
    "title": "SEATING GROUP FOR GAMES",
    "self_text": "If I created a seating group for a football game and I don't end up buying a ticket, everyone else in the group can still sit together, right? Please let me know! Thanks ya'll.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3765770076348041752
  },
  {
    "id": 878090,
    "post_id": "z3cr5x",
    "title": "Major minor",
    "self_text": "I know this is a strange question but i just wanna make sure, we dont have to pay to add a major/minor right? Thank u 😭❤️",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2008685384965426909
  },
  {
    "id": 508314,
    "post_id": "yr6rlb",
    "title": "do NOT participate in the walkout, just don’t go to class! join the picket monday nov 14!",
    "self_text": "going to class and participating in the walkout is just scabbing and un-scabbing! picket starts at 8, see you there!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1070934708166392571
  },
  {
    "id": 254429,
    "post_id": "yitieh",
    "title": "What’s the coolest/most fun and interesting class you’ve taken?",
    "self_text": "I’m looking for one more class to take in the winter just to fulfill units. I want to take a class that’s interesting and fun but also not too heavy of a workload.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5861330843598067781
  },
  {
    "id": 653119,
    "post_id": "yw8kig",
    "title": "USC TICKETS",
    "self_text": "DM me on instagram @elli_macdonald_ and i’ll buy your UCLA vs USC football tickets IF they’re in the student section and seated beside each other. THANKS!!!!!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1477346296580100087
  },
  {
    "id": 648212,
    "post_id": "yw3fyc",
    "title": "any back entrances to Broad Art Center?",
    "self_text": "trying to avoid the picket bc i’m still not sure if i should go to class (i know some people are saying it’s scabbing, others say it’s not, i lean more towards it being a bad thing but only because i think the more ppl the better if that makes sense) (i haven’t been to one of my classes in a while for personal reasons and need to catch up)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1680704812406369932
  },
  {
    "id": 625777,
    "post_id": "yvavi7",
    "title": "history 5 class ucla",
    "self_text": "Hi, there are many seats open for this class and I didn’t get the class I wanted during my priority enrollment. So, I’m thinking of taking this class. It has a good rating on bruinwalk but I noticed it says asynchronous for lectures and discussion. If anyone who’s taken it is willing to comment below about your experience :) or if anyone has taken an all asynchronous class (because not sure how it works). Thank you! I just want an easy GE because I’m dealing with fafsa bs with independent appeal & want an easier winter quarter for that bs!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4049822703420829995
  },
  {
    "id": 702174,
    "post_id": "yxwczw",
    "title": "Asking for PTE",
    "self_text": "one of my class got fulled already. Can I ask for PTE number now even though my second pass starts on 21nd? WIll I be able to use it later?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1328747277305547479
  },
  {
    "id": 766411,
    "post_id": "yztwb0",
    "title": "DM for Math 131A Lecture 2 Spot",
    "self_text": "title",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1066700771406229172
  },
  {
    "id": 823523,
    "post_id": "z1myp2",
    "title": "do business/law schools care about pass/no pass",
    "self_text": "wondering if I should pass/no pass a language class. since the strike, the prof hasn't given any grades so I'm not sure what to expect for my final grade, but is it better to take the potential B+ or pass no pass if it'll affect my gpa? do business/law schools actually take pass/no pass as a C+?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 303426092796572687
  },
  {
    "id": 688680,
    "post_id": "yxexuq",
    "title": "Extra rooter bus ticket for Saturday",
    "self_text": "Does anyone have an extra rooter bus ticket for the ucla v usc game? Willing to pay",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1062409378761901494
  },
  {
    "id": 279489,
    "post_id": "yjmnr5",
    "title": "Does Math 31AL count as a pre-req for the stats major?",
    "self_text": "Essentially what the title says. I want to double major in stats but I’m taking 31AL instead of 31A and when I ran my DARs, it didn’t count it as progress for the major. Should I be worried or is it just a weird coincidence?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2736791270724879167
  },
  {
    "id": 277038,
    "post_id": "yjk6om",
    "title": "Saltzberg or Bauer for 1A?",
    "self_text": "Or should I roll the ball and take \"The Staff\"? I'm a CS major. I just want an A.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2136931911826444857
  },
  {
    "id": 867273,
    "post_id": "z30xpk",
    "title": "Need Math 31B Winter Quarter",
    "self_text": "Will pay $100 for math 31B winter quarter",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1004386928254539149
  },
  {
    "id": 974853,
    "post_id": "z6ivxx",
    "title": "Finals?",
    "self_text": "Does anyone know what's going to happen with finals? I just finished my second round of midterms and I can't imagine professors are going to have time to finish grading finals on top of all that also... are finals going to get canceled? Or moved online?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2665289043180589235
  },
  {
    "id": 262794,
    "post_id": "yj33kq",
    "title": "To the people playing the piano at covel",
    "self_text": "If you want to play, just at the very least play the melody and harmony in the same key. And please play with dynamics. nobody wants to hear the same shit over and over again. Unlike others on this reddit I appreciate music but at least keep the music somewhat musically coherent so I don't kill myself.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4478966334148092075
  },
  {
    "id": 494874,
    "post_id": "yqsvy2",
    "title": "math 155 w/ Tymochko vs. math 170e with Yin",
    "self_text": "Trying to decide between these two courses for next quarter, if anyone has any input about either of them and/or teaching styles of the professors that’d be great!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8764705615406952868
  },
  {
    "id": 745074,
    "post_id": "yz6y1z",
    "title": "Rooter bus tickets for usc game",
    "self_text": "Anybody has 1 rooter bus ticket as I forgot to get one, willing to pay!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6862755854865668809
  },
  {
    "id": 725999,
    "post_id": "yynl02",
    "title": "Help Undergrads!",
    "self_text": "Undergraduates should not be harmed by the strike.  Administration should extend deadlines, grant leniency, allow p/np and in general have policies that are helpful during this difficult time.  We should write to demand this.  Update: someone suggested we write to the registrar.  Update: p/np being offered at ucb and ucsd.  Classes getting cancelled.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5147308419994664240
  },
  {
    "id": 471263,
    "post_id": "yq021i",
    "title": "Enrolling in 4 classes in 1 quarter experiences",
    "self_text": "Hello!  Can anyone share their experiences taking 4 classes in one quarter & how you were able to manage the course load. I will be attempting to take 4 classes in this upcoming quarter im a but nervous about how heavy the coursework will especially since im used to taking only 3 classes but I know others have done it. I just wanna prepare myself with what to expect when taking on another course.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5695820929379532471
  },
  {
    "id": 314492,
    "post_id": "ykpjwc",
    "title": "Which prof for Math 32A?",
    "self_text": "Who should I take out of Enakoutsa, B.Y. Shin, and R. Wong?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3594905025785566486
  },
  {
    "id": 524463,
    "post_id": "yrrble",
    "title": "3 Classes + LA Program",
    "self_text": "I’m planning to take 3 classes next quarter (Physics, Writing II, and an upper div bio class) and was wondering if being a new LA on top of that would be manageable. If anyone has experience with being an LA as a “fourth class”, or even just in general, please feel free to share what you thought about it and how you handled it. Thank you in advance!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2345756015664105298
  },
  {
    "id": 548548,
    "post_id": "ysjlcd",
    "title": "Do any companies offer UCLA tuition benefits?",
    "self_text": "I was curious because ASU has a partnership with Starbucks but I have autism and working at Starbucks and dealing with customers is hell. I just want my degree and I need help paying up front because Ive reached my undergrad student loan limit. I need a situation where I get the classes paid up front instead of tuition reimbursment. Im so frustrated with ASU Im throwing up my hands and looking into other colleges. I live in Arizona so I need an online program. Id appreciate it if anyone knew of anything. My major is technical communication (technical writing).",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5761825975438659413
  },
  {
    "id": 611122,
    "post_id": "yuq5op",
    "title": "Ucla application",
    "self_text": "Hello, I am recently done with my PIQ. I am applying to UCLA as a transfer student. Anybody interested in reading it?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5902152314322431420
  },
  {
    "id": 499793,
    "post_id": "yqxzvo",
    "title": "LING 132 - Language Processing",
    "self_text": "Has anyone taken LING 132 before? What does the work look like and is it heavy on phonetics?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6918468921433341634
  },
  {
    "id": 786566,
    "post_id": "z0h6ky",
    "title": "Will they open spaces for 2nd pass students today or are we fucked?",
    "self_text": "And if the latter, what alternatives have you guys taken(if there are no classes that you can sign up for pertaining to your major)?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2739717664431757149
  },
  {
    "id": 665600,
    "post_id": "ywmes9",
    "title": "send our striking TAs to the UC gulag",
    "self_text": "&#x200B;  https://preview.redd.it/8rtmxz11g90a1.png?width=1464&format=png&auto=webp&s=103eb7391095f15c604946d5a2acb2380218ab39",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3137762085074917021
  },
  {
    "id": 706866,
    "post_id": "yy144g",
    "title": "Getting a job",
    "self_text": "Feel so stressed about job prospects as a biology student. Everything seems like you need experience. Feel like I'm never going to find a job",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6320697768258479876
  },
  {
    "id": 282855,
    "post_id": "yjqajk",
    "title": "Tell me why there's only one whole class offered for a required course",
    "self_text": "And it starts at 9:30 am",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7931977932322590601
  },
  {
    "id": 867668,
    "post_id": "z31cp1",
    "title": "final essay grades with the TA strike",
    "self_text": "one of my classes still has us write the final essay which is 35% of our grade. It’s due week 10 and the class is confused on how this is gonna work when grades are due pretty soon after and without TAs. Our professor just blamed the university and said it’s just a matter of “when” and said maybe things will be graded in january.  Anyone know if this is true? are we really not gonna know our final grades until into next quarter? and i still don’t really understand bc then the TAs will be grading our essays while TAing for their new class, and they always took a long time to grade our stuff. Im just confused on how this whole thing was gonna work. Especially since i thought grade submissions were in december",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8056543529370141911
  },
  {
    "id": 450170,
    "post_id": "yp9hij",
    "title": "Buying a Baguette",
    "self_text": "Where can one obtain a full size baguette on a Tuesday morning(2-5 am preferably, 7 am at most) within 1 hour from ucla traveling via public transit. This is not a joke and the question is quite literal. I need a baguette tomorrow and I have no idea where to get one.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 548812597368582059
  },
  {
    "id": 529318,
    "post_id": "yrwalb",
    "title": "bfit gym crush",
    "self_text": "i always see him around noon what should I dooooooo",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4512548703517163029
  },
  {
    "id": 700434,
    "post_id": "yxul0c",
    "title": "What was the Samsung event yesterday?",
    "self_text": "When I was in campus yesterday I saw a tent of Samsung and also a stage and a also projecting stuff on students activities center.  Many times I walked on campus and see all kind of events that I didn’t know about, how can I get updated on those events?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8568910423364182260
  },
  {
    "id": 628938,
    "post_id": "yvebc6",
    "title": "Hold psych 100A for me",
    "self_text": "Please please please anybody, can you hold this for me until tonight! I will give you free swipes and will pay a bit. Message me!!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9166409562235361527
  },
  {
    "id": 964140,
    "post_id": "z67hb6",
    "title": "dorm swap for winter quarter",
    "self_text": "(f)  have:  a double shared bath in hedrick   looking for: double shared/or private anywhere more down on the hill",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7399401749005017991
  },
  {
    "id": 280790,
    "post_id": "yjo2k6",
    "title": "Cluster Help",
    "self_text": "So as a dumb freshman I signed up for the cluster because everyone talked about how great they are without even looking if they fit into my individual goals. Apperantly the only GE I need from that class is the one about biology, AKA not worth the three quarters of classes. If I decide not to take it next year, do I get to keep that specific GE since it was discussed this quarter? If I decide to cut my losses anyways will it show up in my transcript that I dropped a class?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6204479936518271561
  },
  {
    "id": 738116,
    "post_id": "yyzh0t",
    "title": "lost bruin card",
    "self_text": "did anyone find a bruin card in or around ackerman today?? it’s printed vertically if that helps :/",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8761876200401527838
  },
  {
    "id": 476413,
    "post_id": "yq5ngr",
    "title": "what is gayley heights like?",
    "self_text": "I’m in an emergency transfer and the offer from my RD is a 2 bd/6 person apartment in Gayley Heights on the 9th floor. I am getting out of a 4 bd/8 person apt in Laurel and was just wondering if anyone could offer insight on the overall quality of Gayley Heights as a complex (bonus if u can compare it to Laurel)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 20711099749558268
  },
  {
    "id": 819035,
    "post_id": "z1i2xv",
    "title": "shortest minor",
    "self_text": "what’s the minor with the least number of classes required",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2360045805523640518
  },
  {
    "id": 415607,
    "post_id": "yo3p92",
    "title": "New Student Orientation !",
    "self_text": "Anyone acknowledge hoe‍ to schedule an appointment for New Student Orientation? I can't find it in my myUCLA portal... Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4643154847506742303
  },
  {
    "id": 816705,
    "post_id": "z1fq2u",
    "title": "Chem 14B, Chem 14BL, Stats 13, GE -- Doable?",
    "self_text": "Taking Chem 14B, Chem 14BL, Stats 13, and GE next quarter.  No background in statistics and not a fan of coding but did well in LS 30A/B, decent in Chem but I'm taking it w Lavelle with a poor grade distribution. Is this doable or should I drop Stats or the GE?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2597129113581937806
  },
  {
    "id": 719643,
    "post_id": "yyfkr3",
    "title": "Parking spot",
    "self_text": "$elling parking spot at Tiverton Court starting from December till the end of the school year! Looking for 200 a month, price negotiable. DM if interested :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5323003864521573134
  },
  {
    "id": 693688,
    "post_id": "yxlhnj",
    "title": "please sell me 3 tix to the usc game",
    "self_text": "we all last min wanna go",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5332369097563520697
  },
  {
    "id": 818740,
    "post_id": "z1hswx",
    "title": "meal swipes/food truck tickers",
    "self_text": "do people sell meal swipes/food truck tickets?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4749886708144857160
  },
  {
    "id": 717408,
    "post_id": "yycgp8",
    "title": "World Cup watch parties over thanksgiving?",
    "self_text": "There’s some banging games over the break (USA-ENG, MEX-ARG) but I’m going to be here over the break and was hoping there might be people who would also be here and want to watch them?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2182884232904387255
  },
  {
    "id": 625758,
    "post_id": "yvaunt",
    "title": "new black panther was the embodiment of mid",
    "self_text": "save yourself 3 hours and 16 bucks, go buy oats from the store and feed ducks at a pond rather than see mid panther",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7203893142137140078
  },
  {
    "id": 883109,
    "post_id": "z3jmoe",
    "title": "mental health options",
    "self_text": "Does anyone recommend student led mentor health clubs (where you talk to another student) helpful?  CAPS is really hard to schedule, but it feels weird diverging stuff to another student. Like they probably have their own ongoing issues and they'll probably look at me weird in the future if we bump in school, knowing all my backstory?? Or worst still they gossip?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 299573490677730962
  },
  {
    "id": 731950,
    "post_id": "yytd8j",
    "title": "Swap Psych 100a for ls30a (Winter 2023)",
    "self_text": "Currently enrolled in psych 100a, but need ls30a for winter quarter. If interested will be willing to switch if I am unable to get into 30a. Also willing to pay pls kinda desperate.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5000559103424522603
  },
  {
    "id": 373348,
    "post_id": "ymlwd4",
    "title": "how easy is asian american 10w?",
    "self_text": "for reference i am taking it alongside chem 14b, 14bl, and physics 5a. i have not taken 4 classes in one quarter before.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6915741317195229600
  },
  {
    "id": 479930,
    "post_id": "yq9kbr",
    "title": "Online Summer Classes",
    "self_text": "are Math upper divs typically offered online? Was last summer just because of Covid still? Trying to figure out if it’s likely they will still be online for Summer 2023.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5481779500534477350
  },
  {
    "id": 604797,
    "post_id": "yuj3l9",
    "title": "Holding course",
    "self_text": "Looking for someone to hold a math upper div til second pass! Willing to pay.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7544440195807216220
  },
  {
    "id": 587468,
    "post_id": "ytv9wo",
    "title": "unable to enroll in major class",
    "self_text": "I'm an HBS major and I'm trying to enroll in one of the upper divs. I've taken the necessary requisites for the class and I'm of appropriate standing. Is there any reason why it's not letting me enroll? I've been able to enroll in another upper div for the class on my first pass before, too.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 296348038894872343
  },
  {
    "id": 914422,
    "post_id": "z4lanf",
    "title": "Don’t have space in car to move; (hypothetical) what items would someone want when taking over a lease?",
    "self_text": "So I’m looking at moving to a room closer to campus for better commute time, and I don’t have the space in my car to make any such move, nor is renting a moving van feasible. Multiple trips works, but I live out of state and I’ll just have the same problem later after the academic year is over. I wanted to gauge what people’s response would be when it comes time to move. If you were taking over my lease and I were to offer you to buy anything in my room off me, would people be interested? Is that something people do?  This would extend to my bed frame, refrigerator, desk, ac, dehumidifier, dishes, wardrobe, mattress and pressure cooker.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7858959226313392269
  },
  {
    "id": 551166,
    "post_id": "ysmrf7",
    "title": "A class says that 0/9 spots are taken of the waitlist, but when I try to get added to the waitlist it says waitlist is full?",
    "self_text": "I am wondering if this is like a glitch in the system and I should keep trying, or if it just means the class is full and has no waitlist. Because usually if the class has no waitlist, it would say \"closed class\" or something like that, not say \"waitlist: 0/9 taken\"",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2255811848797999718
  },
  {
    "id": 995864,
    "post_id": "z76ziv",
    "title": "Are meal swipes taken in Ackerman?",
    "self_text": "Does anyone know which restaurants in Ackerman, if any accept meal swipes in the form of tickets? I was at Kikka and saw someone use a ticket while I paid 🥲 trying to use up my swipes for this quarter so would love to know! Thanks !",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 262456153286012789
  },
  {
    "id": 611902,
    "post_id": "yur5cp",
    "title": "(Bus/Econ Majors) ECON 106V pay to hold a spot",
    "self_text": "Im a math/econ major looking to take it, will pay $$ to take the class, i loved 106f and 106v is the only other finance related class, so naturally I'm interested since I'm going into quant finance",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2722924950009277547
  },
  {
    "id": 899832,
    "post_id": "z42o8j",
    "title": "Math in Computation major",
    "self_text": "What are the best/most ideal upperdivs to choose for this major if you are majoring in math in comp  There are so many options and I'm confused on which ones to pick out of the Math/Stats options and the CS upperdiv options  If anyone is an upperclassman completing this major, could you share with me what classes you are taking?  I am a second year and I am done with my lower divs so I need to start taking the upper div classes. I'm starting my upperdivs with Math 115A because that's just what I've heard from everyone to do.  Thank you!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7897788619936388319
  },
  {
    "id": 422014,
    "post_id": "yoag6w",
    "title": "Finalizing my schedule for Winter",
    "self_text": "CS 35L  Physics 1A  Math 33B  CS M151B  &#x200B;  Manageable? Eggert, Bauer, Min, and Reinman. I'm also self-studying CS 35L over winter break to get a head start and I have a good group.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3342613124530163080
  },
  {
    "id": 687859,
    "post_id": "yxe1uq",
    "title": "Best cheap food near campus",
    "self_text": "I really really really don’t feel like cooking tonight :(( does anyone have any recommendations that aren’t Taco Bell",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3382895192382812085
  },
  {
    "id": 425264,
    "post_id": "yoe27u",
    "title": "Easy Writing II class for freshman",
    "self_text": "Does anyone have suggestions for an easy writing II class? I’m a freshman trying to fulfill this requirement for next quarter",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7240506025935476479
  },
  {
    "id": 822346,
    "post_id": "z1li9j",
    "title": "CS31 to PIC10A",
    "self_text": "How can I change my cs31 credit to satisfy the pic10a requirement instead? Changed majors",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8455979368919528708
  },
  {
    "id": 684497,
    "post_id": "yxa4f5",
    "title": "Waiving UCSHIP as an International Student",
    "self_text": "Hi, I am techincally an international student but I have Medi-cal (Cal-Optima). Can anyone please help me in knowing if I could qualify for a waiver for UCSHIP? I'm uncertain about the extra requirements they have for international students.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 126435357634750595
  },
  {
    "id": 281455,
    "post_id": "yjotmj",
    "title": "Is this doable?",
    "self_text": "&#x200B;  https://preview.redd.it/cg3uzve6bfx91.png?width=1290&format=png&auto=webp&s=ffc697d2659d003c5077ac5ebe85ed701171b8de",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1532467066247940198
  },
  {
    "id": 979406,
    "post_id": "z6nh64",
    "title": "Haircut/Barber Shops Near UCLA",
    "self_text": "Living on the hill wondering what are some recommendations for nearby barber shops to get a haircut.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8389101510471843564
  },
  {
    "id": 600624,
    "post_id": "yudf3q",
    "title": "Good strike sign ideas?",
    "self_text": "Supporting my partner in the strike tomorrow and I wanna make some good signs, any ideas? My best friend and her baby will also be there, baby sign ideas welcome too lol  Thanks in advance  Edit: Thanks y'all for giving me a heads up, there are pre approved slogans only and rules about signage (no discussion of pay etc)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8077505289035356861
  },
  {
    "id": 927875,
    "post_id": "z50mp9",
    "title": "11/30 Thuy Concert",
    "self_text": "is anyone going to the thuy concert? i’m going by myself but don’t want to go on the bus at night alone",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7846023577933009884
  },
  {
    "id": 631008,
    "post_id": "yvgm51",
    "title": "Books like ‘Organic Chemistry as a Second Language’ for Computer Science",
    "self_text": "One of my favorite books of all time but I’ve switched into CS. Curious if anything like it exists for any of the main topics of CS, specifically algorithms, automata theory, formal languages, etc.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8522402691790653598
  },
  {
    "id": 1046186,
    "post_id": "z8wjfu",
    "title": "Swap from Single (Tipuana) to Double in Gayley Heights (female)",
    "self_text": "Hey y'all! I'm looking to swap from a single in Tipuana to a double or single in Gayley Heights. PM if you're interested! (I could also be interested in Levering Terrace)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6964226339499994498
  },
  {
    "id": 481775,
    "post_id": "yqc0t5",
    "title": "holding a spot in ling 1",
    "self_text": "hi! i’m looking for someone to hold a spot in ling 1 for me! willing to pay :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 672407117072795757
  },
  {
    "id": 476880,
    "post_id": "yq65hh",
    "title": "hows the feast line rn",
    "self_text": "help",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1995170116632309471
  },
  {
    "id": 385631,
    "post_id": "yn2n6r",
    "title": "Roommate Needed",
    "self_text": "Hi Bruins! I signed a 1b/1b lease in hopes of getting a female roommate to split rent with after the person who I was subleasing from told me I can stay at that place for the school year and last minute they said I couldn't stay. I am paying full rent by myself and its been getting really expensive and was wondering if there is anyone that still needs a roommate (or knows anyone) or is having housing issues if you could let me know! I have already posted on all the fb posts too. I would greatly appreciate if anyone can help me out on this, thank you so much!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9016940375936942731
  },
  {
    "id": 311261,
    "post_id": "ykmezo",
    "title": "Prof. Pinter-Wollman",
    "self_text": "Hi! Does anyone have experience with Pinter-Wollman? She's teaching PSYCH 129 winter quarter, but there are pretty minimal reviews on BruinWalk",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8605433037330531831
  },
  {
    "id": 612463,
    "post_id": "yury7f",
    "title": "ling 1 waitlist",
    "self_text": "i know for some classes they let in everyone on the waitlist after week 2, does anyone know if this is true for ling 1?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5711068496371053601
  },
  {
    "id": 552606,
    "post_id": "ysodho",
    "title": "Anyone else feel like this",
    "self_text": "Sometimes when I'm waiting to cross from Bruin walk to de neve, I feel like an idiot if there are no cars coming. And I mean at night. Like when you can see and know that there are barely any cars. I know it's the right thing to do to wait, but it just feel awkward.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 468616152903527321
  },
  {
    "id": 331239,
    "post_id": "yl9wdu",
    "title": "Best professor for CS 180?",
    "self_text": "Hearing bad things about Hsieh.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7447207620813294681
  },
  {
    "id": 822683,
    "post_id": "z1lvb6",
    "title": "Anyone has no Thanksgiving plans this weekend?",
    "self_text": "Hmu 🥲",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5512663495857230500
  },
  {
    "id": 660687,
    "post_id": "ywgrz1",
    "title": "can civil engineering majors not enroll into cs first pass????",
    "self_text": "im trying to enroll into cs31 but it says restricted to \"Computer Engineering, Com Sci, Com Sci and Engineering, Electrical Engineering, Ling of Com Sci, Undeclared Engineering Majors, or Cog Sci, C&S Bio, Math of Computation Majors or Premajors or Bioinfo, or Data Engineering Minors\"  &#x200B;  but on the cs31 petition form it says if youre in HSSEAS you can apply. HELP?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7636572354932497974
  },
  {
    "id": 612399,
    "post_id": "yurv6y",
    "title": "Anyone else missing the wild?",
    "self_text": "Is there anyone else on this forsaken site that’s attending ucla and missing the wilderness at all? I’m someone who needs the forest or desert or some wilderness. Looking for anyone else here that feels the same",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2724841457963198149
  },
  {
    "id": 918486,
    "post_id": "z4pmaz",
    "title": "West Coast EMT",
    "self_text": "Anyone planning on taking the West Coast EMT evening classes from January to March next quarter wanna carpool or smth?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8983042063195946088
  },
  {
    "id": 344116,
    "post_id": "ylnrb4",
    "title": "anyone have an extra usc game ticket?",
    "self_text": "pm me please!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2605179396205527813
  },
  {
    "id": 844805,
    "post_id": "z2ayc3",
    "title": "Buying Dining hall swipes",
    "self_text": "I am trying to buy 3 swipes to Covel at 7-730 tonight, dm if interested",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3268564165187629127
  },
  {
    "id": 901567,
    "post_id": "z44qn6",
    "title": "Ya'll idk what to do about CHEM 153A with Lee",
    "self_text": "This class has been so challenging for me and I honestly don't know what to do. I feel so lost and yet somehow people know what's going on? I have been blaming myself for my bad grades, but I feel like i've tried everything to improve in this class.   I go to every lecture and genuinely try to pay attention and actively write notes. I try to read the textbook for each chapter before lecture. I start the homework early and go to discussion (when we had them). I watch supplemental videos and do practice problems.   I feel so stupid and hopeless. All the time and effort I put into this class doesn't even matter. I'm hesitant to tell the professors or TA's because they haven't been very supportive thus far.  :(",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5503694587162578175
  },
  {
    "id": 972332,
    "post_id": "z6g6aa",
    "title": "CASB Capstone classes",
    "self_text": "I might be dumb, but any other 4th year CASB majors not see the capstone classes available next quarter?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 1487130055373410512
  },
  {
    "id": 307781,
    "post_id": "yki59r",
    "title": "Theater C146A",
    "self_text": "Is Theater C146A a class that you have to take throughout all 3 quarters of the year? I am interested in taking it during the winter but am not sure if I had to take the first part in the fall.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5257944175398303935
  },
  {
    "id": 839200,
    "post_id": "z24qpo",
    "title": "Looking to buy a Ling 1 or Theater 10 Spot",
    "self_text": "DM me to negotiate price, willing to pay $50+",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2878431546060766869
  },
  {
    "id": 481042,
    "post_id": "yqaziu",
    "title": "admissions",
    "self_text": "how did you guys ease the tension of college applications? just submitted mine yesterday and i’m having the WORST anxiety.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4923642602599803360
  },
  {
    "id": 824037,
    "post_id": "z1np86",
    "title": "Looking to Buy Food Truck Dinner/Late Night Tickets",
    "self_text": "PM me with prices, down to buy more than just one",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4311667185330005479
  },
  {
    "id": 740778,
    "post_id": "yz24k0",
    "title": "Looking for rooter bus ticket!",
    "self_text": "Please pm me if you have one you’re looking to sell! :))",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 2485235507723564432
  },
  {
    "id": 739097,
    "post_id": "yz0h0k",
    "title": "looking for rooter bus ticket",
    "self_text": "^ title, but looking for a rooter bus ticket :( friend got sick and cant take me anymore so trying to get a bus ticket! pls dm me",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7145411406492713946
  },
  {
    "id": 590927,
    "post_id": "yu0s9q",
    "title": "Do I need to select specialisation for UCLA MS CS?",
    "self_text": "I am filling the application for MS CS at UCLA. The computer science section in the application is asking me to choose an area of specialisation but it is not required as per the program description. Anyone who has applied for MSCS at UCLA ?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3653509707369357956
  },
  {
    "id": 387190,
    "post_id": "yn4do4",
    "title": "Women’s haircut for cheap",
    "self_text": "Does anyone know a place where I can get a haircut for cheaper like less than $50 or know anyone that can cut women’s hair for cheap? Please let me know((((:",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8197286841303532475
  },
  {
    "id": 679830,
    "post_id": "yx4r0x",
    "title": "We need ALL STUDENTS on board! UNDERGRADS, join us even if you are still going to class!",
    "self_text": "Hello everyone  A general PSA to TAs, grad students, undergrads, GSRs, and all. The strike needs all students, and not just grad students, to continue to grow in strength! You are more than welcome to march and picket with us, even if you're still going to classes. Our working conditions are our teaching conditions which are your learning conditions, so we have a common interest at stake here! If you're fed up with UC for whatever reason and believe positive change is possible, join us today! This is a great first step for fighting for a more equitable and just UC!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3399491427929094660
  },
  {
    "id": 813441,
    "post_id": "z1c7pb",
    "title": "Pic 10b and CS31",
    "self_text": "Does cs31 give credit for Pic 10b? I am a math major but have coding experience. Im doing a specialization in computing and it would be nice to kill 2 reqs with one class.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 9009295454794308978
  },
  {
    "id": 280617,
    "post_id": "yjnw4p",
    "title": "usc/ucla guest tickets",
    "self_text": "heyy, would anyone with a den pass be willing to buy me 3-4 guest tickets (:: i'll pay u back !!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3115143061851763009
  },
  {
    "id": 576681,
    "post_id": "ytiudt",
    "title": "MCDB 144 w/ Nakano or MCDB 138 w/Hartenstein",
    "self_text": "Anyone taken these professors before? How difficult were their classes?  Would appreciate some help their bruinwalk reviews are old. Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 5713268207945220412
  },
  {
    "id": 711412,
    "post_id": "yy61ew",
    "title": "How is Mutlu Akaturk, H.? How does she run her classes?",
    "self_text": "I was thinking of taking Hatice’s Math 33A class during my second pass, but one of the lecture days conflicts with my CS discussion. Does she record her lectures so I can watch them later?  Also, how is she in general as a professor? What’s her teaching style? What are her exams like? What’s her grading/homework policy?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6583346952514180748
  },
  {
    "id": 833849,
    "post_id": "z1zgf5",
    "title": "philos 132 with Walsh",
    "self_text": "has anyone taken philos 132 with Walsh? how was it?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6433470846308637482
  },
  {
    "id": 552275,
    "post_id": "ysnzhe",
    "title": "immunization req",
    "self_text": "i have an enrollment appointment today and only just submitted my immunization records since i had to get TB testing and all that these past weeks, does anyone know how long it’ll take for my hold to be removed? i submitted everything at around 9pm yesterday   ty",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6824066391643303291
  },
  {
    "id": 275668,
    "post_id": "yjio90",
    "title": "POWELL CAT (:",
    "self_text": "In the spirit of Powell cat I am asking u to vote 4 my project (: Public chooses a winner and uhhh Powell cat will bless u with good karma (: https://pr.easypromosapp.com/voteme/945641/643549758?lc=eng&fbclid=PAAaYx3Goju1M0Iefzk3tj7DL_iugpSHmQSKuvfjEYGN7mjGSsyPF0HCDbzJk  https://preview.redd.it/82glbqaq5ex91.png?width=4032&format=png&auto=webp&s=6859000adc99e9b09a366d0d447c71466c62ec18  https://preview.redd.it/24r2cqaq5ex91.png?width=4032&format=png&auto=webp&s=2b9d55e8883630cd638dd5ae8580e6a7d0dd6c37",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6338161671404578269
  },
  {
    "id": 520809,
    "post_id": "yrniij",
    "title": "interesting neuro electives?",
    "self_text": "Heya, I need some (upper div) neuro electives recommendations.  I don’t care much for workload/difficulty as long as the material is super interesting!   Thanks :)",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 318031675616762361
  },
  {
    "id": 478673,
    "post_id": "yq82gh",
    "title": "manageable class schedule?",
    "self_text": "PLS advise  is psych 100A (pre req), psych 85 (pre req), LS 30A (pre req) and asia am 10W (writing II) a doable course load or will i die? which classes should i prioritize for my first pass?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7852194305804243182
  },
  {
    "id": 691368,
    "post_id": "yxi3ta",
    "title": "Winter Stats 10 Lecture 4",
    "self_text": "Does anyone want to drop stats 10 (lecture 4) for this winter? Please let me know.",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4843896902886682189
  },
  {
    "id": 877474,
    "post_id": "z3bxem",
    "title": "Rec classes",
    "self_text": "Does anyone know when rec classes will be open for registration for winter quarter? The website only shows classes for fall",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 8244290349575731957
  },
  {
    "id": 609273,
    "post_id": "yunzfe",
    "title": "Impacted Class Enrollment Advice",
    "self_text": "I'm trying to get into Chem 153B for next quarter, but it's already full. I'm assuming that since the class is an impacted class that's why they don't have a waitlist.  I was wondering if emailing the professor/ department would help or if I should just wait (really don't want to).",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3512260211392623429
  },
  {
    "id": 652555,
    "post_id": "yw7zon",
    "title": "Anyone wanna switch Spanish 2 sections",
    "self_text": "I’m enrolled in Lecture 5 but want Lecture 6. (T/Th). DM if you want to switch",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 7535873364405216836
  },
  {
    "id": 308908,
    "post_id": "ykjhre",
    "title": "Brining a Guest to Wooden or B-Fit",
    "self_text": "Is it possible to bring a guest to wooden or b-fit. Am I allowed to swipe them in, or would they need their own membership/card/whatever? Thanks!",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 4893212911878602598
  },
  {
    "id": 904423,
    "post_id": "z48m5c",
    "title": "Transfer from another UC",
    "self_text": "Hello, I currently go to UCR and am looking to transfer to ucla since it is closer to home and I have always wanted to go here. I am a biology major and have a 3.91 culm. And 4.0 bcpm gpa and should have a 3.93 gpa after I finish this quarter. I will have completed all of the recommended and required prereqs by spring. I was looking to transfer as another biology related major, this is where my question comes in:  I am debating on what to transfer into, I’m stuck between choosing my alternate major and I have 3 main options -    molecular and cell biology (39% acceptance with top 75% having a 3.93 gpa)  microbiology (34% acceptance rate with top 75% having a 3.93 gpa)   -ecology and evolution (13% acceptance rate with top 75% having a 3.76)  I am definitely going to put my first main major as cell biology as it has the highest acceptance rate but for the alternate major I am kind of stuck because micro has a good acceptance rate but high gpa and ecology has a significantly lower acceptance rate but a significantly lower gpa making it easier to stand out between the other applicants. I’m leaning towards micro just because of the acceptance rate but I would like to get your opinions.  Which alternative major do u think I should choose?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 3469647935588604315
  },
  {
    "id": 383222,
    "post_id": "ymzzlw",
    "title": "Brain and Behavioral Health Minor Response",
    "self_text": "Hey everyone! Has anyone who’s applied to the minor heard anything back?",
    "subreddit": "ucla",
    "over_18": false,
    "link_flair_text": "",
    "is_ai": false,
    "random_key": 6785430924611233437
  }
]