{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 8,
  "num_layers": 34,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 64,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Generate a reddit post.",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 2560,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "google/gemma-3-4b-it"
}